import 'package:flutter/material.dart';
import 'package:gradution_project/features/splash/EachPatternInfo/InfoPatterns.dart';
import 'package:gradution_project/features/splash/EachPatternInfo/PatternsStructure.dart';
import 'package:gradution_project/features/splash/EachPatternInfo/TabPatterns.dart';
import 'package:gradution_project/features/splash/EachPatternInfo/TabsColumn.dart';
import 'package:gradution_project/features/splash/EachPatternInfo/TabsListView.dart';

class Esfj extends StatelessWidget {
  const Esfj({super.key});

  @override
  Widget build(BuildContext context) {
    return const Patternsstructure(Childs: [
      Infopatterns(
          text1: 'ESFJ',
          text2: 'قنصل',
          text3:
              '''باعتبارك من فئة القنصل (ESFJ)، فأنت القلب الدافئ واليد الثابتة التي تحافظ على سير دوائرك الاجتماعية ومكان عملك وعائلتك بسلاسة. إن اهتمامك الحقيقي بالآخرين، إلى جانب طبيعتك العملية، يجعلك جانب دعم في أي مجتمع. كما أنه لديك قدرة فائقة على استشعار احتياجات الآخرين ودافع قوي لتلبية هذه الاحتياجات. إنك تضع أولوية مصالح من حولك قبل نفسك غالباً.''',
          image: 'assets/Esfj2.png'),
      Tabpatterns(Tabchilds: [
        TabsListView(childs: [
          TabsCloumn(
              text1: 'عادات مكان العمل',
              text2:
                  '''عندما يتعلق الأمر بمكان العمل، يتمتع الأشخاص من نوع شخصية ESFJ (القناصل) بميول واضحة تبرز بغض النظر عن موقعهم الوظيفي. يزدهرون في بيئة تتسم بالنظام الاجتماعي والتناغم. يستخدمون دفئهم وذكاءهم الاجتماعي لضمان أن كل شخص يعرف مسؤولياته ويتمكن من إنجاز المهام المطلوبة. يشعرون بالراحة، بل يعتمدون أحيانًا، على وجود تسلسل هرمي وأدوار واضحة، وسواء كانوا مرؤوسين أو زملاء أو مدراء، فإن شخصيات ESFJ تتوقع احترام السلطة ودعمها بالقواعد والمعايير.'''),
          TabsCloumn(
              text1: 'الموظفون من نوع ESFJ',
              text2:
                  '''مع وجود مسؤوليات واضحة وإحساس بالهدف، يتميز الأشخاص من نوع ESFJ بالصبر والكفاءة والاجتهاد، مما يجعلهم موضع ثقة لإنجاز العمل بشكل جيد. يحترمون سلطة مديريهم وغالبًا ما يعجبون بهم، مما يدفعهم إلى بذل الجهد اللازم للتعلم منهم والبقاء على علاقة جيدة معهم.

على الرغم من أن شخصيات ESFJ قد تواجه صعوبة مع الكثير من الحرية أو العمل الارتجالي، إلا أنهم يزدهرون في بيئات العمل التي تتسم بالهيكلية، والأمان، والإرشادات الواضحة. المهام الروتينية ليست مشكلة بالنسبة لهم، وتفانيهم وولاؤهم يكسبانهم احترام مديريهم.'''),
          TabsCloumn(
              text1: 'المديرون من نوع ESFJ',
              text2:
                  '''يحب الأشخاص الذين يحملون شخصية ISTJ تحمل المسؤولية والاستفادة من القوة الناتجة عنها. يدفعون أنفسهم بشدة للوفاء بالتزاماتهم، وعادة ما يبذلون جهدًا يفوق المتوقع منهم، ويتوقعون أن يظهر مرؤوسوهم نفس المستوى من التفاني.
في الوقت نفسه، فإن تفضيلهم لاتباع القواعد، والالتزام بالتسلسل الهرمي، والنفور العام من الابتكار، يجعل مرؤوسيهم يسيرون على خط رفيع عند التفكير خارج الصندوق. أي خروج عن الحدود المتوقعة يجب أن يكون مدعومًا بأدلة قوية ونتائج استثنائية لإقناعهم.

يُقال إنه من الأفضل القيام بالعمل أولًا ثم طلب الإذن لاحقًا، لكن من الصعب تطبيق ذلك مع ISTJs، حيث إنهم لا يتسامحون مع إخفاقات مرؤوسيهم في الالتزام بالخطط الموضوعة مسبقًا. مع إيمانهم بأن الحقيقة (كما يرونها) أهم من الحساسية، يمكن لشخصيات ISTJ أن توجه انتقادات قاسية عند الحاجة. كما أن استعدادهم لاتخاذ قرارات صعبتستمتع شخصيات ESFJ بالمسؤولية المرتبطة بتنظيم المواقف الاجتماعية، وينعكس استمتاعهم بإدارة الآخرين بشكل جيد في المناصب الإدارية. كقادة فرق، يجدون طرقًا لجعل الجميع يشعرون بالمشاركة، ويوحدون الأفراد ويعملون على تلطيف العلاقات لإنجاز المهام.

في الوقت نفسه، يتمتعون باحترام قوي للهيكلية التقليدية للسلطة. ولكن إذا تحدى أحد مرؤوسيهم سلطتهم بعد كل جهودهم لإقناعهم بالعمل معًا، فقد يصابون بالتوتر، ويفقدون أعصابهم، ويتصرفون بشكل سيئ عمومًا. شخصيات ESFJ حساسة تجاه وضعهم الاجتماعي وتكره الصراعات. يفضلون المواقف التي يعرف فيها الجميع دورهم. وطالما أن التوقعات موضحة بشكل واضح، فإنهم يكونون مدراء فعالين ومحبوبين.ة يجعلهم لا يتسامحون مع أي تصرف يُفسر على أنه عدم احترام أو تجاوز للسلطة.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'مسارات الحياة المهنية',
              text2:
                  '''نظرًا لأن سماتهم الشخصية معبَّر عنها بقوة، حيث يقودهم الحس العملي والحيوية الاجتماعية، فإن الأشخاص من ذوي نمط الشخصية ESFJ (القناصل) يميلون إلى الشعور بالرضا الأكبر في المهن التي تتيح لهم استغلال هذه الصفات بأفضل طريقة. يتميزون بتنظيمهم الجيد، ويستمتعون بجلب النظام والبنية إلى بيئة العمل، وغالبًا ما يعملون بشكل أفضل في بيئات ذات هياكل هرمية واضحة ومهام متوقعة.
الرتابة والعمل الروتيني لا يشكلان تحديًا كبيرًا لهم، طالما أنهم يعملون بصحبة الآخرين.'''),
          TabsCloumn(
              text1: 'الدوافع الإيثارية',
              text2:
                  '''المهن في مجال الإدارة تناسب نمط شخصية ESFJ (القناصل) بشكل طبيعي، حيث تتيح لهم تنظيم البيئة والأشخاص داخلها. مهاراتهم العملية تتكامل مع اعتماديتهم، مما يجعلهم مفاجأة جيدة كمحاسبين – على الرغم من أنهم غالبًا ما يفضلون أن يكونوا محاسبين شخصيين، حيث يمكنهم مساعدة الناس والتفاعل معهم مباشرة، بدلاً من أن يكونوا محاسبين مؤسسيين يعملون في غرف خلفية مع الأرقام فقط.

المهن التحليلية البحتة قد تبدو مملة جدًا للقناصل – إلا إذا كانت مصحوبة بتفاعل إنساني وتغذية راجعة عاطفية. وباعتبارهم مستمعين جيدين وأعضاء فريق متحمسين، فإن الأشخاص من نمط الشخصية ESFJ يقدمون أداءً ممتازًا في الرعاية الطبية والعمل الاجتماعي. التعليم أيضًا خيار رائع لهم، حيث يشعرون بالراحة مع السلطة، لكنهم داعمون وودودون بما يكفي لجعل هذه السلطة غير ثقيلة على الآخرين.'''),
          TabsCloumn(
              text1: 'يد مساعدة',
              text2:
                  '''نظرًا لطبيعتهم الإيثارية، يجد أصحاب شخصية ESFJ (القناصل) صعوبة في الشعور بالرضا ما لم يكونوا قد قدموا شيئًا ذا قيمة لشخص آخر. غالبًا ما يكون هذا الدافع هو القوة المحركة وراء خياراتهم المهنية وتقدمهم في العمل، مما يجعل الأعمال الدينية والإرشاد من المجالات التي يجدون فيها إشباعًا كبيرًا.

مهما كانت الوظيفة التي يختارونها، فإن القناصل يجمعون بين راحتهم في التعامل مع المواقف الاجتماعية المزدحمة ومعرفتهم ومهاراتهم العملية. هذه المزايا تجعلهم ليس فقط قادرين على أن يكونوا منتجين ومفيدين، بل أيضًا يستمتعون بذلك بصدق.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'الأبوة',
              text2:
                  '''كآباء، يمتلك الأشخاص من نمط الشخصية ESFJ (القناصل) فرصة رائعة لإظهار دفئهم ومودتهم وتفانيهم بطرق تترك تأثيرًا حقيقيًا وإيجابيًا.بفضل حساسيتهم وحزمهم في الوقت نفسه، يتمكن آباء ESFJ من وضع قواعد وسلطة دون أن يكونوا متسلطين بشكل مفرط، مستخدمين تعاطفهم ودعمهم لتجاوز حالات سوء التفاهم أو الاختلاف في وجهات النظر.

منذ البداية، يحرص هؤلاء الآباء على ضمان شعور أطفالهم بالأمان والسعادة. يجدون متعة كبيرة في تقديم الدعم الذي يحتاجه أطفالهم الرُضَّع، والذين يعتمدون بالكامل على رعايتهم. وبما أن العائلة تمثل أهمية كبيرة بالنسبة لهم، فإن هذه البداية للعلاقة تعتبر مجزية للغاية.'''),
          TabsCloumn(
              text1: 'حماية أم إفراط في الحماية؟',
              text2:
                  '''ريجلب الآباء من ذوي نمط الشخصية ESFJ (القناصل) قدراتهم العملية القوية ومهارات التنظيم إلى دورهم في التربية. فهم يتميزون بالكفاءة العالية في تنظيم جداول أطفالهم، ومتابعة تقدمهم الدراسي، وإدارة الأعمال المنزلية والمسؤوليات. تفانيهم واعتمادهم عليهم يجعلهم آباءً مشاركين بشكل كبير، سواء جسديًا أو عاطفيًا، في حياة أطفالهم.

مع نمو أطفالهم وبدء استكشافهم للعالم، ينمو حب ورعاية ESFJ معهم، لكنه قد يتحول أحيانًا إلى حماية مفرطة. لا يقتصر الأمر على الحفاظ على سلامة أطفالهم جسديًا فحسب، بل أيضًا اجتماعيًا، من خلال ترتيب مواعيد اللعب، وزيارات المخيمات الصيفية، والأنشطة الأخرى. قد يملؤون جداول أطفالهم لدرجة تمنعهم من اتخاذ قراراتهم الخاصة أو ارتكاب الأخطاء التي تسهم في النمو العاطفي والاستقلال الاجتماعي.
يقدّر ESFJ بشدة الانسجام والاستقرار، وغالبًا ما يحاولون استخدام الضغط غير المباشر لتعليم دروس الحياة. ومع ذلك، عندما يُجبرون على مواجهة أخطاء صريحة من أطفالهم، يتدخلون بحزم ويتوقعون أن تُحترم كلماتهم. وباعتبارهم مؤمنين بالأدوار التقليدية، يميل الآباء من هذا النمط إلى رؤية العلاقة بين الوالدين والأطفال بوضوح تام، حيث تُعتبر سلطتهم الكلمة النهائية.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'العلاقات الرومانسية',
              text2:
                  '''يأخذ الأشخاص من نمط الشخصية ESFJ كل مرحلة من مراحل تطوير العلاقة، من المواعدة إلى ما بعدها، على محمل الجد. تعتمد جميع جوانب علاقاتهم على تلبية الاحتياجات المتبادلة. يهدفون منذ البداية إلى خلق فهم متبادل وبناء الاحترام والدعم لأراء وأهداف بعضهم البعض مع مرور الوقت. معرفة أنهم محبوبون ومقدرون يمكن أن يكون لها تأثير كبير على مزاج وثقة ESFJ بأنفسهم.'''),
          TabsCloumn(
              text1: 'قلب رقيق',
              text2:
                  '''إذا شعر الأشخاص من نمط الشخصية ESFJ أن الدعم الذي يتوقون إليه مفقود، مثل تلقيهم للنقد من شريكهم، فقد يشعرون بجرح عميق. هؤلاء الأشخاص يكرهون الصراع والنقد، مما يجعل التعامل مع المشاكل التي قد تنشأ تحديًا كبيرًا. لا شيء يسبب لهم الألم أو الإحباط أكثر من إدراك أن شريكهم لا يحترم أحلامهم أو آراءهم. على الرغم من ذلك، يمكن أن يكون ESFJ مفاجئًا بقوته وتحمله في مواجهة المصاعب، لكنه بحاجة ماسة إلى معرفة أن شريكه يدعمه بنسبة 100%.
للأسف، قد يفتقر الأشخاص الأقل نضجًا من هذا النمط إلى القوة الداخلية والحكمة اللازمة لجذب هذا النوع من الدعم بطرق صحية.

 يمكن أن يشعروا بالضياع دون التقدير، مما قد يدفعهم إلى التنازل عن مبادئهم وقيمهم للحصول على موافقة شريكهم. يعد هذا فخًا خطيرًا – فهو لا يؤدي فقط إلى فقدانهم اتصالهم بأنفسهم، بل قد يؤدي أيضًا إلى استغلالهم بسهولة، مما يزيد من تقليل احترامهم لذاتهم. ومن الفخاخ الأخرى التي قد يواجهونها هو انشغالهم بالمكانة الاجتماعية والموافقة، حيث يمكن أن تلعب دوائرهم الاجتماعية وأقاربهم دورًا أكبر في اختيار شريك حياتهم مقارنة بقيمهم الشخصية.'''),
          TabsCloumn(
              text1: 'بناء الثقة',
              text2:
                  '''يتميز ESFJ بالدفء والولاء ورغبته في الشعور بالثقة والتقدير. يشعر هؤلاء الأشخاص بالسلام الداخلي عندما يكونون في علاقة آمنة ومستقرة ومليئة بالحب، ولا يجدون مشكلة في التفاني الذي تتطلبه العلاقات الأحادية. في الواقع، يميلون إلى التفوق في الأمور العملية مثل إدارة المال والمهام المنزلية، ويشعرون بالسعادة عند تحمل هذه المسؤوليات في سبيل رعاية من يحبونهم – وهي صفة رائعة.

ومع ذلك، يجب أن يتأكدوا من بناء علاقات تمكنهم أيضًا من تحقيق احتياجاتهم وأحلامهم مع شريك يقدر رعايتهم وكرمهم بشكل كامل ويبادلهم ذلك بالمثل. وبينما يُعد ميلهم الطبيعي للعناية بالآخرين أمرًا يستحق الثناء، يجب عليهم أن يتذكروا عدم إهمال رغباتهم وتطلعاتهم في هذه العملية.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'نقاط القوة',
              text2:
                  '''مهارات عملية قويةأصحاب شخصية ESFJ (المستشارون) بارعون في إدارة المهام اليومية وصيانة الروتين، حيث يستمتعون بضمان أن من حولهم يحصلون على العناية التي يحتاجونها.

إحساس قوي بالواجبيتسم ESFJs بشعور قوي بالمسؤولية ويسعون دائمًا للوفاء بالتزاماتهم. وهذا يجعلهم غالبًا مجتهدين وفعّالين في مكان العمل ومخلصين للغاية في علاقاتهم الشخصية. كما أنهم يحرصون على التقاليد التي تهمهم، ويعملون على الحفاظ عليها بجدية واستمرارية. 

إخلاص كبيريُقدر ESFJs الاستقرار والأمان بشكل كبير، مما يجعلهم مخلصين للغاية وشركاء موثوقين وموظفين يعتمد عليهم. فهم أعمدة حقيقية لأي مجموعة ينتمون إليها، سواء كانت الأسرة أو نادٍ اجتماعي. يمكن دائمًا الاعتماد عليهم للمساعدة وتقديم الدعم.

حساسية ودفءيمنحون الآخرين الشعور بالأمان والاستقرار الذي يبحثون عنه بأنفسهم. يسعون لتحقيق الانسجام ويهتمون كثيرًا بمشاعر الآخرين، حريصين على عدم إيذاء أحد. إنهم لاعبو فريق أقوياء، ومواقف الربح للجميع هي مصدر سعادتهم.

مهارة في التواصل مع الآخرينتتضافر هذه الصفات لتجعل أصحاب شخصية ESFJ اجتماعيين وواثقين وعادة ما يكونون محبوبين. لديهم حاجة قوية "للإنتماء" ولا يجدون مشكلة في الأحاديث الجانبية أو اتباع الإشارات الاجتماعية ليكون لهم دور نشط في مجتمعاتهم.'''),
          TabsCloumn(
              text1: 'نقاط الضعف', text2: '''قلقون بشأن مكانتهم الاجتماعية
يميل أصحاب شخصية ESFJ إلى الانشغال بالمكانة الاجتماعية والتأثير، مما يؤثر على العديد من قراراتهم وقد يحد من إبداعهم وانفتاحهم على الأفكار الجديدة. يمكن أن يربطوا هويتهم بتوقعات الآخرين، مما يجعلهم يفقدون إحساسهم بأنفسهم.

غير مرنين
تولي شخصية ESFJ أهمية كبيرة لما هو مقبول اجتماعيًا، وقد يكونون حذرين للغاية، بل وحتى ناقدين، لأي شيء غير تقليدي أو خارج عن المألوف. قد يترددون في الخروج من منطقة راحتهم، غالبًا خوفًا من أن يكونوا مختلفين أو يُظهروا ذلك.

حساسين للنقد
يمثل النقد تحديًا خاصًا لهم لأنهم يتجنبون الصراعات بشكل كبير. قد يصبحون دفاعيين ويتألمون إذا انتقد أحد، خصوصًا من المقربين منهم، عاداتهم أو معتقداتهم أو تقاليدهم.

بحاجة مفرطة للتقدير
تحتاج شخصية ESFJ إلى سماع ورؤية الكثير من التقدير. إذا لم يتم ملاحظة جهودهم، قد يبدأون في البحث عن الإطراء كوسيلة للحصول على تأكيد لمدى قيمتهم.

تضحية مفرطة بالنفس
الجانب الآخر لهذا هو أن ESFJs يحاولون أحيانًا إثبات قيمتهم من خلال اهتمامهم الزائد بالآخرين، مما قد يُثقل كاهل من لا يحتاج إلى هذا الاهتمام ويجعله غير مرحب به. علاوة على ذلك، غالبًا ما يهملون احتياجاتهم الخاصة في هذه العملية.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'الصداقات',
              text2:
                  '''أصحاب شخصية ESFJ (المستشارون) يتمتعون بطبيعة اجتماعية للغاية، حيث يسعون لتكوين دوائر واسعة من الأصدقاء ويبذلون الوقت والجهد اللازمين للحفاظ على هذه العلاقات.
بفضل ولائهم ودفئهم، يُعرفون بدعمهم الدائم لأصدقائهم مهما كانت الظروف، ويكونون دائمًا مصدرًا مستمرًا للدعم العاطفي والتشجيع.
بشكل عام، يُظهر ESFJs التزامًا قويًا بتقاليد الصداقة، ويرون أن الدعم الذي يقدمونه للأصدقاء ليس مجرد مسؤولية، بل هو أيضًا مصدر سعادة ورضا بالنسبة لهم.'''),
          TabsCloumn(
              text1: 'محبوبون وحمايون',
              text2:
                  '''أصحاب شخصية ESFJ يبذلون كل ما بوسعهم لضمان سعادة أصدقائهم، وبفضل راحتهم الكبيرة مع المحادثات القصيرة والتعارف، فإنهم يتمتعون بشعبية طبيعية في أي بيئة تقريبًا. هذا التفاعل يُعدّ مصدر سعادة حقيقية لهم، لكنهم في المقابل يتوقعون تقدير جهودهم ودعمهم.

لا شيء يجرح مشاعر ESFJs أكثر من اكتشاف أن صديقًا موثوقًا ينتقد معتقداتهم أو عاداتهم – خصوصًا إذا حدث ذلك في مواجهة مباشرة.
ورغم شعبيتهم العامة، يمكن لـ ESFJs توسيع دوائرهم الاجتماعية أكثر إذا تعلموا أن يكونوا أكثر انفتاحًا لتقبل وجهات النظر المختلفة بدلًا من إصدار الأحكام السريعة.من المهم لهم، كما هو الحال مع أي شخص، أن يتجنبوا الانعزال عن الآراء الأخرى وأن يسعوا لفهم المزيد من الناس والتواصل معهم.'''),
          TabsCloumn(
              text1: 'نحن معًا في هذا الطريق',
              text2:
                  '''عند النظر إلى الأمور بشكل عام، يتمتع أصحاب شخصية ESFJ بمهارة رائعة في استغلال حساسيتهم لفهم ما يحفز أصدقائهم ويشجعهم.وفي لحظات ضعفهم، قد يستخدمون هذه الملاحظات أحيانًا للتأثير على الآخرين، لكن اهتمامهم الحقيقي يكمن في بناء علاقات قوية، مما يجعل هذه المهارة أداة فعّالة في تحقيق ذلك.

باعتبارهم شخصيات إيثارية حقيقية، فإن ESFJs نادرًا ما يستخدمون قدراتهم إلا للخير، فهم دائمًا يسعون لتشجيع وإلهام الآخرين.
بشكل عام، يتميز أصحاب هذه الشخصية بأنهم أشخاص ودودون وصادقون. طاقتهم وذكاؤهم الاجتماعي يمنحهم الكثير من المعارف والأصدقاء، بينما يضمن دعمهم وإخلاصهم بقاء تلك الصداقات قريبة ومتينة.ومع حبهم الكبير للحياة، فإن أوقات الوحدة أو الملل نادرة للغاية في حياتهم!'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'مقدمة تعريفية',
              text2:
                  '''إن عالمك مبني على أساس من التقاليد والواجب والمسؤولية الاجتماعية. تنجح في أماكن منظمة حيث تكون الأدوار والتوقعات واضحة وتفخر كثيرًا بالوفاء بالتزاماتك. مهاراتك التنظيمية من الدرجة الأولى، وهذا يُتيح لك الموازنة بين مسؤوليات متعددة بسهولة واضحة، سواءً كان ذلك التخطيط لتجمع عائلي أو تنسيق مشروع عمل.

في حين أن طبيعتك المنفتحة وسماحتك الاجتماعية تجعلك تبدو واثقًا، إلا إنك تتصارع مع حاجة داخلية غالباً للحصول على التقدير والقبول. أنت حساس للغاية لآراء الآخرين ويمكن أن تكون من أشد منتقدي نفسك. هذه الحساسية، رغم أنها صعبة أحياناً، فإنها أيضاً مصدر تعاطفك الرائع وقدرتك على تحقيق الانسجام في محيطك.
تتمثل قوتك في قدرتك على تجميع الناس معاً وإضافة شعور بالانتماء. مع ذلك، فإن رغبتك في الانسجام قد تقودك أحياناً إلى تجنب الصراعات الضرورية أو إهمال احتياجاتك الخاصة. يعد تعلم كيفية تحقيق التوازن بين ميلك الطبيعي لرعاية الآخرين مع الرعاية الذاتية والحزم جزءًا أساسياً من مسار تطورك الذاتي.'''),
          TabsCloumn(
              text1: 'جمال الحياة المسؤولة',
              text2:
                  '''أصحاب شخصية ESFJ هم أناس يتمتعون بالروح الإيثارية. يأخذون على عاتقهم مسؤولية رد الجميل وخدمة الآخرين وفعل الشيء الصحيح على محمل الجد. ويؤمنون بأن هناك دائمًا طريقة صحيحة وواضحة للتصرف في كل موقف تقريبًا.
في حين أن بعض الشخصيات الأخرى قد تتبنى موقفًا أكثر تساهلاً وشعار "عِش ودَع غيرك يعيش"، قد يجد ESFJs صعوبة في الامتناع عن إصدار الأحكام عندما يسلك شخص ما طريقًا يبدو لهم خاطئًا أو مضللاً. ونتيجة لذلك، غالبًا ما يكافحون لتقبل اختلاف الآراء أو القرارات، خاصة إذا كان الشخص الذي يختلف معهم عزيزًا عليهم أو يختار طريقًا لا يفهمونه.'''),
          TabsCloumn(
              text1: 'بناء علاقات تدوم',
              text2:
                  '''الأشخاص من أصحاب شخصية ESFJ يتميزون بالدعم والانفتاح، ويمكنك دائمًا التعرف عليهم في أي حفلة – فهم أولئك الذين يتنقلون بين الجميع للتأكد من أن الجميع يقضون وقتًا رائعًا! ولكن لا تخلط الأمور: هؤلاء الأشخاص لا يمرون مرور الكرام في حياة الآخرين.
بفضل ولائهم العميق، يبنون علاقات تدوم طويلاً ويمكن الاعتماد عليهم دائمًا، سواء لتقديم يد العون أو للإصغاء بإنصات. في الواقع، معرفة أن هناك أشخاصًا يعتمدون عليهم ويحتاجون إليهم تمنحهم شعورًا عميقًا بالرضا وتملأ قلوبهم السخية بالسعادة.

بفضل حبهم للنظام والترتيب، يفضل أصحاب شخصية ESFJ الأنشطة المخططة على الفعاليات المفتوحة أو اللقاءات العفوية. وهم يسعدون باستضافة الأحداث لضمان سير الأمور بسلاسة. هؤلاء الأشخاص يضعون قدرًا كبيرًا من الجهد والطاقة في جعل الآخرين يشعرون بأنهم مميزون ومقدرون، وقد يشعرون بالإحباط إذا لم يبدُ أن جهودهم محل تقدير.

بالنسبة للكثيرين من أصحاب هذه الشخصية، واحدة من أكبر تحديات الحياة هي تقبل حقيقة أنهم لا يستطيعون التحكم في أفكار أو تصرفات الآخرين – حتى لو كانوا من أقرب الناس إليهم.

لكن الخبر السار هو أنهم يمكنهم إيجاد السلام والرضا من خلال التركيز على ما يجيدونه: أن يكونوا مثالاً يحتذى به في العناية والاعتبار والمسؤولية، وأن يجمعوا الناس معًا في هذه العملية.'''),
        ]),
      ])
    ]);
  }
}
