import 'package:flutter/material.dart';
import 'package:gradution_project/features/splash/EachPatternInfo/InfoPatterns.dart';
import 'package:gradution_project/features/splash/EachPatternInfo/PatternsStructure.dart';
import 'package:gradution_project/features/splash/EachPatternInfo/TabPatterns.dart';
import 'package:gradution_project/features/splash/EachPatternInfo/TabsColumn.dart';
import 'package:gradution_project/features/splash/EachPatternInfo/TabsListView.dart';

class Estp extends StatelessWidget {
  const Estp({super.key});

  @override
  Widget build(BuildContext context) {
    return const Patternsstructure(Childs: [
      Infopatterns(
          text1: 'ESTP',
          text2: 'رائد أعمال',
          text3:
              '''أنواع شخصية رائد العمل دائمًا لهم تأثير مباشر على محيطهم – أفضل طريقة لاكتشافهم في حفل هو البحث عن دوامة متحركة من الناس لأنهم ينتقلون من مجموعة إلى أخرى، وتنتقل الناس معهم. وتحب شخصيات روَّاد الأعمال الضحك والترفيه بروح من الفكاهة الحادة، لأنهم مولعون بأن يكونوا مركز الاهتمام. وإذا طلب من أحد أفراد الجمهور الحضور على خشبة المسرح، ستتطوع شخصية رائد العمل – أو ستقدِّم هذه الشخصية صديقًا خجولاً كمتطوع.''',
          image: 'assets/estp2.png'),
      Tabpatterns(Tabchilds: [
        TabsListView(childs: [
          TabsCloumn(
              text1: 'عادات مكان العمل',
              text2:
                  '''في أي بيئة، بما في ذلك مكان العمل، من السهل ملاحظة الأشخاص الذين ينتمون إلى نوع الشخصية ESTP (رواد الأعمال). فهم صاخبون وعفويون، يحبون المرح وأحيانًا قد يكونون قليلين في اللباقة. يحب ESTPs التعامل مع المشاكل بمجرد ظهورها ومشاركة القصص الرائعة عن حلولهم بعدها. بالطبع، هناك بعض الوظائف التي تتناسب بشكل أفضل مع هذه الصفات، لكن هؤلاء الأشخاص مرنون ويمكنهم إيجاد طريقة لجعل أي موقف أكثر إثارة للاهتمام.'''),
          TabsCloumn(
              text1: 'الموظفون من نوع ESTP',
              text2:
                  '''أصعب وظيفة بالنسبة لهم هي الوظيفة التي يبدأ فيها معظم الناس: كمرؤوسين. وعلى الرغم من أنهم قادرون تمامًا على ممارسة ضبط النفس وفقًا لشروطهم الخاصة، إلا أن الأشخاص الذين يمتلكون شخصية ESTP يكرهون أن يتم فرض القواعد والأنظمة عليهم من قبل الآخرين. هم معروفون بتجاربهم وابتكاراتهم وقدرتهم على التفكير السريع – إذا لم يُسمح لهم باستخدام هذه الصفات وكان عليهم التحقق مع المشرف في كل شيء صغير، فسوف يشعرون بالملل والإحباط.

يعرف الأشخاص ذوو شخصية ESTP جيدًا أن المخاطرة تعني المكافأة، وسوف يتهربون بسرور من المهام العادية لصالح شيء أكثر إثارة على أمل أن يجذب انتباه شخص ما. لوحة شرف ومكافأة مالية هما من الأشياء التي تثير اهتمام هؤلاء الأشخاص. التقدم من خلال مبادئ الاعتماد على النفس الهادئ أو البساطة أو مجرد الأقدمية ليس طريقتهم – بل يتحرك الأشخاص ذوو شخصية ESTP للأمام بقوة شخصيتهم في أزمة يتم التعامل معها بشكل جيد.'''),
          TabsCloumn(
              text1: 'المديرون من نوع ESTP',
              text2:
                  '''تعتبر المناصب الإدارية هي المكان الذي يشعر فيه الأشخاص ذوو شخصية ESTP عادةً براحة أكبر، حيث إنها تمنحهم أكبر قدر من المرونة. القواعد والتقاليد تمثل إزعاجًا لهذه الشخصية – فهم يفضلون تجربة العديد من الأفكار الجديدة مع فرصة إنجاز الأمور بسرعة أو بشكل أفضل بدلاً من الالتزام بـ "الطريقة التي تم تنفيذ الأشياء بها دائمًا" أو راحة المرؤوسين مع التجربة.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'مسارات الحياة المهنية',
              text2:
                  '''عندما يتعلق الأمر بخيارات الوظائف للأشخاص ذوي شخصية ESTP (رواد الأعمال)، فإن "العمل" هو الكلمة الأساسية. هم يفكرون بسرعة ويبرعون في اتخاذ قرارات سريعة في اللحظة الحاسمة. في نفس الوقت، هم أفراد اجتماعيون يبدو أنهم يكوّنون أصدقاء واتصالات أينما ذهبوا. يمكن أن تكون الشعبية والشبكات القوية من الأصول الكبيرة في عالم العمل، والأشخاص ذوو شخصية ESTP ليس لديهم مشكلة في استخدام هذه المهارات الاجتماعية لصالحهم.

يُعتبر الذكاء الاجتماعي، إلى جانب الجرأة الطبيعية ومهاراتهم في الارتجال، من العوامل التي تجعل الأشخاص ذوي شخصية ESTP مناسبين تمامًا لمجالات مثل المبيعات، والتفاوضات التجارية، والتسويق، وحتى التمثيل – أي بيئة مليئة بالتوتر والتحديات التنافسية. هؤلاء الأشخاص يثقون في قدرتهم على اتخاذ القرار الصائب. المخاطر، سواء الكبيرة أو الصغيرة، هي جزء من الحياة بالنسبة لهم، وهم لا ينتظرون أن يأتي شخص في منصب أعلى ليخبرهم بما يجب عليهم فعله. قد يتسبب هذا في وقوعهم في مشكلات في بعض الأحيان، لكن في كثير من الأحيان يكون هذا هو ما يحتاجه الموقف تمامًا ويمكن أن يساعدهم في التقدم في مسارهم المهني بنجاح.
القيود والقواعد والبيئات المنظمة للغاية – هذه هي الطرق المثالية لجعل الأشخاص ذوي هذه الشخصية يشعرون بالجنون. يعيش الأشخاص ذوو شخصية ESTP حياتهم وفقًا لشروطهم الخاصة، مما يجعلهم رجال أعمال رائعين وأشخاصًا يعملون بشكل مستقل. تتيح لهم هذه الأدوار أيضًا تفويض الجوانب المملة من العمل – مثل المحاسبة، والبحث الدقيق، وما إلى ذلك – لأولئك الذين يتناسبون أكثر مع هذه المهام. ومع ذلك، على الرغم من أن الأشخاص ذوي شخصية ESTP يفضلون المناصب التي تمنحهم الحرية في اتخاذ قراراتهم بشأن الجدول الزمني، إلا أنهم لا يحبون العمل من المنزل كل يوم. يفضلون أن يكونوا في العالم، محاطين بالآخرين في أي نوع من العمل الذي يقومون به.

الأشخاص ذوو شخصية ESTP فضوليون ومليئون بالطاقة ويحبون العمل الميداني. هناك من يقومون بتحليل وإدارة لوجستيات توزيع الموارد الخاصة بالسلامة العامة، وهناك من يقودون سيارات الإسعاف، ويطوفون الشوارع، وينقذون الأرواح بأنفسهم – وهم من الفئة الثانية. إنهم يتمتعون بملاحظة حادة ولكنهم غير صبورين، مما يتيح لهم استيعاب الموقف برمته بنظرة سريعة ثم اتخاذ القرار بسرعة. أي دور في الاستجابة للطوارئ هو مثالي لشخصيات ESTP، سواء كان ذلك كمسعفين أو ضباط شرطة أو جنود.'''),
          TabsCloumn(
              text1: 'إثارة اللعبة',
              text2:
                  '''إن هذه الصفة المتمثلة في العيش في اللحظة الحالية والرغبة في الحصول على نتائج فورية لجهودهم تتناسب بشكل جيد مع مجال آخر: الرياضة. لا شيء يمكن أن يقارن بإثارة المنافسة، ودفع أنفسهم إلى الحد البدني لتحقيق نقطة إضافية من أجل الفوز بالنسبة للأشخاص ذوي شخصية ESTP. سواء كانوا في الميدان كرياضيين بأنفسهم، أو مدربين من على الخطوط الجانبية، أو معلقين من فوق، يستمتع الأشخاص من هذا النوع بالجهود الجماعية المدروسة والخطة المنفذة بشكل جيد، وأي من هذه المناصب يعد مجالًا مناسبًا للعمل لهم.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'الأبوة',
              text2:
                  '''من نواحٍ عديدة، يُعتبر الأشخاص الذين يتمتعون بنوع الشخصية ESTP (رواد الأعمال) من الآباء المثاليين في نظر العديد من الأطفال. فهم يحبون المرح واللعب، مرنون ومتفاهمون، ويستمتعون حقًا بقضاء الوقت مع أطفالهم، ويعرفون كيفية التأكد من أن الجميع يستمتع. لديهم فضول طبيعي وعفوية تتناسب تمامًا مع العجب والرغبة اللامحدودة في التعلم التي يمتلكها الأطفال الصغار.'''),
          TabsCloumn(
              text1: 'حرية الاستكشاف',
              text2:
                  '''يحب الأشخاص ذوو الشخصية ESTP الأنشطة العملية. وهذا يعني أن أطفالهم عادةً لا يضطرون للانتظار كي يجدوا شخصًا للعب معهم أو لمساعدتهم في بناء نموذج للمدرسة. تُرحب وتُشجع الأنشطة العملية مثل الرياضة والمشي وغيرها من الهوايات العملية. في الوقت نفسه، نظرًا لكرههم للقواعد والجداول الزمنية، لا يُحتمل أن يُجبروا أطفالهم على الانضمام إلى أنواع مختلفة من الأندية والفرق. إذا أراد أطفالهم لعب كرة القدم، فهذا رائع – وإذا لم يريدوا، فسيجدون شيئًا آخر يفعلونه.
يمنح الأشخاص ذوو الشخصية ESTP أطفالهم الحرية. يشجعونهم على استخدام حكمهم الخاص (خصوصًا في الأمور الصغيرة) واتباع قلوبهم – بغض النظر عما يظنه الآخرون. كما أن هؤلاء الأشخاص يراقبون أطفالهم عن كثب، مستخدمين قدرتهم على ملاحظة أدق التغيرات في مزاج وعادات الآخرين، بحيث يمكنهم التدخل مع توجيه إضافي عندما تبدأ الأمور في الخروج عن المسار.'''),
          TabsCloumn(
              text1: 'التركيز على الاتصال',
              text2:
                  '''مع ذلك، غالبًا ما يجد الأشخاص ذوو الشخصية ESTP أن الأبوة والأمومة تمنحهم كل الحافز الذي يحتاجونه للعمل على حساسيتهم وتوافقهم العاطفي. من خلال الأنشطة والتجارب المشتركة، يمكن لهؤلاء الآباء بناء روابط صحية وأصيلة مع أطفالهم، مما يمنحهم معرفة أعمق باحتياجات أطفالهم الفريدة وأحلامهم وطرقهم في التفاعل مع العالم. يتمتع الأشخاص ذوو الشخصية ESTP بالفائدة الإضافية للعلاقات المباشرة والمفهمة – فلن يشعر أطفالهم كثيرًا أنهم مضطرون لإخفاء أخطائهم وتحدياتهم، وهو ما يمثل نموذجًا مثاليًا في التواصل بين الوالدين والأبناء.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'العلاقات الرومانسية',
              text2:
                  '''عندما يتعلق الأمر بالعلاقات الرومانسية، من الصعب أن نقول إن الأشخاص ذوي شخصية ESTP (المبادرين) يشتاقون ليوم زفافهم. الحياة ممتعة ومليئة بالمفاجآت (وهي مهارة يبرعون فيها بشكل خاص)، وهم يستمتعون بكل لحظة في الحاضر.
قد لا يقضي الأشخاص ذوو شخصية ESTP الكثير من الوقت في التخطيط لـ "اليوم الذي سيأتي"، لكن هذا لا يعني أنهم يخافون من الوقوع في الحب. هم فقط لا يضعون الكثير من القيمة على تصنيف علاقاتهم، ويميلون إلى التكيف مع مجريات الأمور عندما يتعلق الأمر بحياتهم العاطفية، مما يجعلهم شركاء في المواعدة مثيرين للغاية.'''),
          TabsCloumn(
              text1: 'تحدي العلاقة الحميمة',
              text2:
                  '''في المراحل الأولى من العلاقة، يظهر الأشخاص ذوو شخصية ESTP إحساسًا بالعفوية والإثارة. هم جريئون في محاولاتهم للتودد، نادرًا ما يترددون في flirt علنًا حتى عندما يكون الآخرون حاضرين. إن سحرهم الطبيعي وشعبيتهم غالبًا ما يجعلانهم جذبًا للشركاء المحتملين. عندما يقترن هذا بعدم اكتراثهم بالرفض، يكون لديهم إحساس حاد بالثقة بالنفس يساعدهم على التنقل بسلاسة في عدم اليقين في المواعدة.

ومع مرور الوقت، قد يكون من الصعب عليهم دفع علاقاتهم إلى مستويات أعمق وأكثر حميمية عاطفيًا. بما أنهم سريعو الملل، يسعى الأشخاص ذوو شخصية ESTP إلى الإثارة المستمرة - وأحيانًا يعرضون أنفسهم عمدًا للمخاطرة إذا شعروا بالتوقف. إذا لم يتمكن شريكهم من مواكبة ذلك، قد يحتاجون إلى إنشاء ديناميكية علاقة أكثر استقلالية تسمح لهم بمزيد من الحرية. مع العقلية الصحيحة، يمكن أن يتماشى ذلك بشكل جميل مع الالتزام الأعمق بشريك طويل الأمد.'''),
          TabsCloumn(
              text1: 'الحب دون تردد',
              text2:
                  '''كما هو الحال مع أي علاقة، يتطلب الأمر عملًا وصبرًا. ليس كل يوم هو لحظة من الإثارة. لكن الأشخاص ذوو شخصية ESTP هم أفراد مرنون وفضوليون، وهو ما يساعد بالتأكيد في الحفاظ على تأجج الشعلة. إن الحفاظ على علاقات صحية هو الفرصة المثالية لهم لممارسة مهاراتهم في ملاحظة كل تغيير في مزاج وسلوك شريكهم، بينما يستخدمون أيضًا مهاراتهم في حل المشكلات لتلبية احتياجاتهم.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(text1: 'نقاط القوة', text2: '''جريء
الأشخاص الذين لديهم نوع شخصية ESTP (رواد الأعمال) مليئون بالحياة والطاقة. لا يوجد شيء يسعدهم أكثر من دفع الحدود واكتشاف وتطبيق أدوات وأفكار جديدة.

عقلاني وعملي
هؤلاء الأشخاص يحبون المعرفة والفلسفة، ولكن ليس لذاتها. ما يسعد ESTPs هو العثور على أفكار قابلة للتطبيق والغوص في التفاصيل لتطبيقها. إذا كانت المناقشة غير هادفة تمامًا، فهناك طرق أفضل لاستخدام وقتهم.

أصليون
من خلال دمج جراءتهم وعمليتهم، يحب الأشخاص الذين لديهم شخصية ESTP تجربة أفكار وحلول جديدة. هم يجمعون الأشياء بطرق لا يفكر فيها الآخرون.

مراقبون
تساعدهم أصالتهم بقدرتهم على ملاحظة التغييرات – ومتى يجب عليهم التغيير! التغييرات الصغيرة في العادات والمظاهر تلتقطها ESTPs، وهم يستخدمون هذه الملاحظات لإنشاء روابط مع الآخرين.

مباشرون
لا تُستخدم ملاحظات ESTPs في الألعاب الذهنية – يفضلون التواصل بوضوح، مع طرح أسئلة وأجوبة مباشرة وواقعية. ما تراه هو ما تحصل عليه مع هذا النوع من الشخصيات.

اجتماعيون
تجمع هذه الصفات معًا لجعل شخصية ESTP قائدًا طبيعيًا للمجموعات. هذا ليس شيئًا يسعون إليه بنشاط – لديهم موهبة في الاستفادة بشكل ممتاز من التفاعلات الاجتماعية وفرص الشبكات.'''),
          TabsCloumn(text1: 'نقاط الضعف', text2: '''غير حساس
بالنسبة للأشخاص ذوي شخصية ESTP، تأتي الحقائق والعملية قبل المشاعر والعواطف. المواقف المشحونة عاطفيًا تكون أمورًا غير مريحة لهم، ولا تساعد الصراحة الفظة في هذه الحالات. غالبًا ما يواجهون صعوبة في الاعتراف بمشاعرهم والتعبير عنها، ويفضلون عدم التعمق في المواضيع الثقيلة أو الماضي لفترة طويلة.

غير صبور
يتحرك الأشخاص ذوو شخصية ESTP بسرعة على طريقتهم الخاصة من أجل إبقاء أنفسهم مشغولين. التباطؤ بسبب شخص آخر "لا يفهم" أو الاضطرار إلى التركيز على تفصيل واحد لفترة طويلة يعد أمرًا صعبًا للغاية بالنسبة لهم.
متهور – قد يؤدي نقص الصبر إلى دفع ESTPs إلى اقتحام أراضٍ غير مكتشفة دون التفكير في العواقب طويلة المدى. أحيانًا يتغلبون على الملل عبر زيادة المخاطرة بشكل متعمد.

غير منظم
يرى ESTPs الفرصة – لحل مشكلة، للتقدم، أو للاستمتاع – ويغتنمون اللحظة، في كثير من الأحيان متجاهلين القواعد والتوقعات الاجتماعية في هذه العملية. هذا قد يؤدي إلى إنجاز الأشياء، ولكنه يمكن أن يخلق أيضًا تداعيات اجتماعية غير متوقعة إذا أزعج ذلك الأنواع الشخصية الأكثر تقليدية.

قد يفوتهم الصورة الأكبر
العيش في اللحظة قد يتسبب في أن يفتقد ESTPs الغابة من أجل الأشجار. يحب الأشخاص الذين لديهم هذا النوع من الشخصية حل المشكلات هنا والآن – ربما أكثر من اللازم. قد تكون جميع أجزاء المشروع مثالية، لكن المشروع سيفشل إذا لم تتكامل هذه الأجزاء بشكل صحيح.

متمرد
هذا النوع لا يحب أن يتم حشره في زاوية. التكرار، القواعد الصارمة، والجلوس بهدوء أثناء الاستماع لمحاضرات ليست من الأمور التي يستمتع بها الأشخاص ذوو شخصية ESTP عادةً. هم يفضلون أن يكونوا في بيئات مليئة بالحركة والأنشطة. قد تكون البيئات مثل المدرسة أو الأعمال في المستويات الأولية مملة إلى حد يجعلها غير محتملة، مما يتطلب جهدًا استثنائيًا من ESTPs للبقاء مركزين بما فيه الكفاية حتى يصلوا إلى المناصب الأكثر حرية.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'الصداقات',
              text2:
                  '''يستطيع أصحاب شخصية ESTP أن يحوِّلوا أي تجمع إلى احتفال ينبض بالحياة بفضل شخصيتهم الحيوية. يمكنك التعرف عليهم بسهولة من خلال مجموعة الأشخاص التي تحيط بهم أينما تنقلوا من مجموعة إلى أخرى، يضحكون ويُسلّون الآخرين بروح فكاهة صريحة وبسيطة، ويستمتعون بأن يكونوا محور الاهتمام.
يمتلك أصحاب هذه الشخصية خيالًا رائعًا وإحساسًا منعشًا بالعفوية، مما يجعل الآخرين دائمًا في حالة توقع لما قد يحدث. يحبون استكشاف الأفكار المثيرة للاهتمام سواء عبر النقاش أو من خلال التجربة المباشرة، مما يعني أن لديهم دائمًا أنشطة ممتعة مخفية في جعبتهم. ومع ذلك، يتميزون أيضًا بالبساطة والتسامح والجاذبية، مما يجعلهم يتمتعون بشعبية طبيعية بين الناس.'''),
          TabsCloumn(
              text1: 'شغف بالحياة',
              text2:
                  '''يجد أصحاب شخصية ESTP متعتهم في الأنشطة العملية والحيوية مثل الرياضات الجماعية والحفلات الموسيقية، حيث توفر لهم هذه البيئات العديد من الفرص لتكوين صداقات جديدة. وبالكاد يواجهون صعوبة في هذا الأمر – فهم يبدون وكأنهم يتوافقون مع الجميع ويصنعون أصدقاء في أي مكان يذهبون إليه.
يعيش ESTPs اللحظة بكل حيوية، وبفضل ثقتهم الطبيعية بأنفسهم، نادرًا ما يشغلون بالهم بآراء الآخرين عنهم. هذا النهج المريح في الحياة يجذب أصدقاء يشبهونهم في حبهم للحياة وشغفهم للاستمتاع بكل لحظة.'''),
          TabsCloumn(
              text1: 'شغف بالحياة',
              text2:
                  '''استكشاف وإثارة يتوق أصحاب شخصية ESTP إلى الاستكشاف والإثارة، ويدمنون الأدرينالين والمغامرة – لذا يجب أن يكون أصدقاؤهم مستعدين لكل هذه التجارب. غالبًا ما يستمتعون بالظهور أمام الجمهور وأداء أدوار ممتعة لجذب الأنظار، لكنهم أيضًا يشجعون أصدقاءهم على المشاركة في هذه اللحظات الحماسية.

ورغم أن معظم الأنماط الشخصية قد تشعر بالإحباط أو الرفض إذا قيل لهم "شكرًا، لكن لا أريد المشاركة"، إلا أن ESTPs يتمتعون بثقة مريحة في أنفسهم تجعلهم يتعاملون مع الأمر ببساطة. فهم غالبًا ما يكتفون بهز أكتافهم والمضي قدمًا مع الأصدقاء الذين يشاركونهم حب المغامرة واستكشاف الحياة بشغف.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'مقدمة تعريفية',
              text2:
                  '''أصحاب شخصية ESTP هم أفراد مفعمون بالحيوية، مليئون بالطاقة العفوية والحماسية. يميلون إلى التنافسية، معتقدين غالبًا أن العقلية التنافسية ضرورية لتحقيق النجاح في الحياة. بفضل مواقفهم الدافعة والموجهة نحو العمل، نادرًا ما يضيعون وقتهم في التفكير في الماضي. في الواقع، يتفوقون في تركيز انتباههم على الحاضر، لدرجة أنهم نادرًا ما يجدون أنفسهم منشغلين بالوقت خلال اليوم.

النظريات والمفاهيم المجردة والنقاشات البطيئة حول القضايا العالمية وتأثيراتها لا تبقي اهتمام أصحاب شخصية ESTP لفترة طويلة. يفضلون إبقاء محادثاتهم مليئة بالطاقة مع جرعة جيدة من الذكاء، لكنهم يفضلون الحديث عن ما هو واقع – أو الأفضل من ذلك، الانطلاق والقيام به مباشرة. غالبًا ما يندفعون قبل أن يفكروا، ويصلحون أخطاءهم أثناء تقدمهم بدلاً من الجلوس دون عمل والاستعداد لاحتمالات وخطط هروب.'''),
          TabsCloumn(
              text1: 'الانغماس المباشر',
              text2:
                  '''أصحاب شخصية ESTP هم مجموعة جريئة وشجاعة لا تخشى المخاطرة أو التصرف بناءً على دوافعهم. يعيشون في اللحظة وينغمسون في الأحداث بعقل منفتح وثقة ظاهرة. يستمتع هؤلاء الأشخاص بالدراما، والشغف، والمتعة – ليس من أجل الإثارة العاطفية، ولكن لأنها تحفز عقولهم بشكل كبير. عادةً ما يتخذون قرارات حاسمة بناءً على الواقع الفعلي والفوري، من خلال عملية سريعة من ردود الفعل العقلانية.

هذا النهج يجعل المدرسة والبيئات المنظمة الأخرى تحديًا لأصحاب هذه الشخصية. بالتأكيد، ليس لأنهم ليسوا أذكياء – بل يمكنهم التفوق في مثل هذه البيئات – ولكن النهج المنظم والقائم على المحاضرات في التعليم الرسمي بعيد جدًا عن أسلوب التعلم العملي الذي يستمتعون به عادةً. يتطلب الأمر قدرًا كبيرًا من النضج لرؤية هذا النظام كوسيلة ضرورية لتحقيق غاية – كشيء يفتح فرصًا أكثر إثارة لاحقًا.

بالنسبة لأصحاب شخصية ESTP، فإن اتباع بوصلة أخلاقية شخصية خاصة بهم يبدو أكثر منطقية من الالتزام بمعايير أو قواعد خارجية. بالنسبة لهم، "القواعد وضعت لتُكسر". هذا الشعور نادرًا ما يلقى قبولًا لدى المدرسين في المدارس أو المشرفين في بيئات العمل، مما قد يمنح أصحاب هذه الشخصية سمعة معينة.
ومع ذلك، إذا استطاعوا تقليل الميل لإثارة المتاعب، وتسخير طاقاتهم، والتركيز خلال المهام المملة، فإنهم يتحولون إلى قوة لا يُستهان بها، قادرة على تحقيق نجاحات استثنائية.'''),
          TabsCloumn(
              text1: 'الطريق الأقل اتباعًا',
              text2:
                  '''يتمتع أصحاب شخصية ESTP بقدرة مدهشة على ملاحظة التفاصيل الدقيقة، ربما أكثر من أي نوع شخصي آخر. سواء كان ذلك من خلال تغيّر في تعبير الوجه، أو أسلوب جديد في الملابس، أو عادة مفقودة، فإنهم يلتقطون الأفكار والنوايا الخفية التي قد تغيب عن الآخرين. يستخدمون هذه الملاحظات على الفور، ويشيرون إلى التغيير ويطرحون الأسئلة، حتى لو تسبب ذلك في شعور الآخرين بعدم الراحة. هؤلاء الأشخاص يتميزون بالصراحة والوضوح إلى أقصى حد.
يمتلئ أصحاب هذه الشخصية بالشغف والطاقة، مصحوبين بعقل عقلاني – وإن كان أحيانًا مشتتًا. إنهم قادة طبيعيون للمجموعات، يلهمون الآخرين ويقنعونهم ويجلبون الحياة والحماس أينما ذهبوا، ويسحبون الجميع معهم على "الطريق الأقل اتباعًا". ومع ذلك، فإن التحدي الحقيقي لهم يكمن في توجيه هذه الصفات نحو أهداف بناءة ومثمرة.'''),
        ]),
      ])
    ]);
  }
}
