import 'package:flutter/material.dart';
import 'package:gradution_project/EachPatternInfo/InfoPatterns.dart';
import 'package:gradution_project/EachPatternInfo/PatternsStructure.dart';
import 'package:gradution_project/EachPatternInfo/TabPatterns.dart';
import 'package:gradution_project/EachPatternInfo/TabsColumn.dart';
import 'package:gradution_project/EachPatternInfo/TabsListView.dart';

class Infp extends StatelessWidget {
  const Infp({super.key});

  @override
  Widget build(BuildContext context) {
    return const Patternsstructure(Childs: [
      Infopatterns(
          text1: 'INFP',
          text2: 'وسيط',
          text3:
              '''شخصيات الوسطاء مثاليون بصديق، فهم يبحثون دائمًا عن شواهد الخير حتى في أسوأ الناس والأحداث، ساعين لإيجاد سبل لجعل الأمور أفضل. ففي حين أنه قد يُنظَر إلى شخصيات الوسطاء على أنها شخصيات هادئة ومحافِظة، أو حتى خجولة، إلا أنها تتمتع داخليًا بتوهج وعاطفة يمكنهما التألق بحق. ولأن هذا النوع من الشخصية يمثل 4٪ فقط من البشر، فإن الخطرمن أن يساء فهم مشاعرهم مرتفع للأسف، – لكن عندما تجد شخصية الوسيط من يفكر مثلها فإن الانسجام الذي ستشعر به يمكن أن يكون ينبوع الفرح والإلهام لها.''',
          image: 'assets/infp2.png'),
      Tabpatterns(Tabchilds: [
        TabsListView(childs: [
          TabsCloumn(
              text1: 'عادات مكان العمل',
              text2:
                  '''الأشخاص الذين يتمتعون بشخصية INFP (الوسطاء) يسعون إلى الشعور بالهدف والمعنى في عملهم. بغض النظر عن موقعهم على السلم الوظيفي، يحاولون تنمية ارتباط عاطفي وأخلاقي بما يقومون به، بحثًا عن الطمأنينة بأن جهودهم اليومية تُسهم في مساعدة الآخرين بطريقة ما. هذه الرغبة في تقديم الخدمة تؤثر على كيفية استجابة شخصيات INFP للسلطة في مكان العمل وكذلك على الطريقة التي يمارسون بها السلطة.'''),
          TabsCloumn(
              text1: 'الموظفون من نوع شخصية INFP',
              text2:
                  '''كموظفين، يتميز أصحاب شخصية INFP بالولاء والإيجابية والاعتبار للآخرين. يفتخرون بكونهم صادقين والقيام بالأمر الصحيح في جميع الظروف، ويشعرون بالرضا عندما يسعدون الآخرين، سواء كانوا رؤسائهم أو عملائهم. قد يكون هذا سببًا وراء شعورهم بالحافز الأكبر عندما يركزون على إيجاد طرق لمساعدة الآخرين، بدلًا من الانشغال بالقوائم أو الأرباح.

شخصيات INFP تزدهر في بيئة العمل عندما تتلقى ردود فعل إيجابية. بطبيعتهم المثالية، يضعون لأنفسهم معايير شخصية عالية جدًا. وعندما يتلقون كلمات تشجيع من رئيسهم أو زملائهم، فإن ذلك يمثل لهم تأكيدًا بأنهم يسيرون في الاتجاه الصحيح. وعلى الجانب الآخر، يمكن للنقد أن يؤدي إلى انسحابهم أو شعورهم بالإحباط. عند مواجهة توقعات عقابية أو رئيس سلبي للغاية، قد يجدون صعوبة في إنجاز المهام. كما أنهم يواجهون صعوبة كبيرة، وربما أكثر، إذا اضطروا لمواجهة رئيسهم وتحدي آرائه أو توجيهاته.'''),
          TabsCloumn(
              text1: 'مديرين INFP',
              text2:
                  '''كمديرين، يُعتبر أصحاب شخصية INFP من أقل الأنواع الشخصية التي تتصرف وكأنها تملك السلطة المطلقة. فهم يحترمون موظفيهم كأفراد متكاملين، وليس فقط كعمال. وبدلًا من اتخاذ جميع القرارات بأنفسهم، غالبًا ما يفضلون الاستماع إلى أفكار وآراء موظفيهم.

بشكل عام، لا يميل الأشخاص من هذا النوع إلى الإدارة التفصيلية الدقيقة. وبدلًا من ذلك، يركزون على الصورة الكبيرة. يرون أن مسؤوليتهم الأساسية تكمن في دعم موظفيهم، وليس إملاء ما يجب فعله وكيفية القيام به. وعندما تسنح الفرصة، يشجعون الموظفين على تطوير أفكارهم الخاصة واستخدام حكمهم الشخصي.

ومع ذلك، فإن لهذا الأسلوب الإداري جانبًا سلبيًا. أحيانًا، قد يجد المديرون من نوع INFP صعوبة في وضع الحدود، أو معالجة نقاط القصور، أو تقديم النقد عندما يكون ذلك ضروريًا. يمكن أن يؤدي هذا إلى إبطاء عمل فريقهم وخلق ضغوط غير ضرورية لكل من المديرين والموظفين. وفي بعض الأحيان، قد يحتاج المديرون من هذا النوع إلى أن يكونوا أكثر صرامة لصالح فريقهم وبيئة العمل بشكل عام.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'مسارات الحياة المهنية',
              text2:
                  '''الأشخاص من نوع شخصية INFP يبحثون غالبًا عن مهنة توفر لهم أكثر من مجرد دخل مادي. فهم يتوقون إلى وظيفة يشعرون فيها بالرضا الشخصي، حيث يقضون أيامهم في عمل شيء يحبونه بصدق، ويفضلون أن يكون بعيدًا عن التوتر أو الدراما.

لكن نظرًا لطبيعتهم المثالية، قد يجد INFPs صعوبة في العثور على وظيفة تلبي احتياجاتهم العملية وتنسجم مع أحلامهم في الوقت نفسه. يمكن أن يؤدي هذا التحدي إلى حالة من الإحباط، حيث ينتظرون الوظيفة المثالية لتأتيهم، ما يجعلهم يشعرون بأنهم عالقون أو غير قادرين على تحقيق إمكاناتهم الكاملة.'''),
          TabsCloumn(
              text1: 'مكان للجميع',
              text2:
                  '''على الرغم من أن هذا النوع من الشخصيات لا يُعرف بسعيه وراء الأضواء، إلا أن INFPs يمكنهم العثور على هدف حياتهم في الفنون المسرحية. نظرًا لحساسيتهم للجمال الفني، يجد بعضهم أنفسهم يتألقون في مجالات الموسيقى أو الدراما أو الرقص. يستطيع هؤلاء الأشخاص استغلال أعماقهم الداخلية لإبراز تفسيرات رائعة لأعمال المبدعين. كما قد يبدعون أعمالهم الخاصة ككتّاب مسرحيين، أو ملحنين، أو مصممي رقصات.

مهما كان مجال عملهم، يرغب INFPs في الشعور بأن عملهم يساهم في مساعدة الآخرين. لذا، ليس من المستغرب أن يختار العديد من أصحاب هذه الشخصية وظائف تركز على تقديم الخدمات 
بالنسبة لهذه الشخصيات المتعاطفة والداعمة، لا يوجد ما هو أكثر قيمة من رؤية عملهم يساهم في تحسين حياة الآخرين بشكل ملموس.'''),
          TabsCloumn(
              text1: 'العثور على طريقهم',
              text2:
                  '''أصحاب شخصية INFP يتمتعون بقدر كبير من القدرة على التكيف، لكنهم قد يشعرون بالإحباط عند العمل في بيئات ذات ضغوط عالية، أو بيروقراطية صارمة، أو إيقاع عمل فوضوي. كما قد يواجهون صعوبة في التأقلم مع أماكن العمل التي تتسم بالنقد الشديد أو التنافسية المفرطة. على العكس من ذلك، فإن أماكن العمل التي تُكافئ الاستقلالية غالبًا ما تكون مناسبة لهم، على الرغم من أنهم قد يُقدِّرون وجود بعض الهياكل التنظيمية والإشراف لمساعدتهم على تجنب التسويف أو التشتت في الأفكار.

ومع ذلك، فإن الأشخاص الذين يتمتعون بهذه الشخصية لا يحتاجون إلى ظروف مثالية لتحقيق النجاح المهني. INFPs يرغبون في العيش بما يتماشى مع قيمهم، سواء في حياتهم المهنية أو أي جانب آخر من حياتهم. يمكنهم تحمل – والتغلب على – أي عدد من التحديات طالما أن لديهم شعورًا بالرسالة والهدف في عملهم.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'الأبوة',
              text2:
                  '''بالنسبة للأشخاص ذوي شخصية INFP (الوسطاء)، تُعتبر الحياة رحلة مليئة بالاكتشافات، ولكنهم يشعرون بدعوة داخلية لمساعدة الآخرين على بدء رحلاتهم الخاصة نحو المعنى والرضا والسعادة. بأسلوبهم الهادئ وغير المتسلط، يحب INFP إرشاد الآخرين نحو التعلم والنمو – ويُعد الأبوة أو الأمومة فرصة مجزية للغاية لتحقيق ذلك.
منذ البداية، يهدف آباء INFP إلى أن يكونوا دافئين، متعاطفين، ومنفتحين. يستمتع أصحاب هذه الشخصية بدهشة أطفالهم البريئة تجاه العالم، ويرغبون في منحهم الحرية – الحرية لتشكيل آرائهم الخاصة، واكتشاف اهتماماتهم، والنمو ليصبحوا ذواتهم الفريدة. يوازن آباء INFP بين هذه الحرية وبين تأسيس قاعدة متينة من الدعم والتقبّل، على أمل أن لا ينسى أطفالهم أبدًا مدى حبهم.
4o'''),
          TabsCloumn(
              text1: 'مواجهة التحديات كآباء INFP',
              text2:
                  '''على الرغم من أن INFP قد يستمتعون بتربية أرواح حرة ومستقلة، إلا أن هذا لا يعني أنهم يتبعون نهجًا متساهلًا تمامًا. فهم يسعون لغرس القيم الأساسية في أطفالهم، مثل الصدق، والإنصاف، وأهمية العناية بالآخرين. كما أنهم يريدون أن يدرك أطفالهم معنى المسؤولية الشخصية، وخاصة عندما يتعلق الأمر بعدم إيذاء الآخرين أو استغلالهم لتحقيق مكاسب شخصية.

ومثل أي آباء، يواجه INFP تحديات لا مفر منها أثناء تربيتهم لأطفالهم. ولأنهم يأخذون مسؤولياتهم الأبوية على محمل الجد، فقد يشعرون وكأنهم فشلوا شخصيًا عندما يسيء أطفالهم التصرف، سواء كانت هذه التصرفات صغيرة أو كبيرة. قد يشعرون باضطراب خاص عندما يرون أطفالهم يتصرفون بطرق لا تبدو متعاطفة أو أخلاقية، مما يدفعهم للبحث عن طرق لتوجيههم برفق ولكن بحزم نحو القيم التي يؤمنون بها.'''),
          TabsCloumn(
              text1: 'موازنة النظام بالعفوية كآباء INFP',
              text2:
                  '''يميل آباء INFP إلى أن يكونوا قدوة إيجابية لأطفالهم، حيث يسعون لإظهار أفضل جوانب شخصياتهم مع إخفاء مشاكلهم ومشاعرهم السلبية والإحباطات. يساهم هذا النهج في الحفاظ على التناغم داخل الأسرة، مما يعزز شعور الأطفال بالأمان والرعاية. وبنفس القدر، يحاول آباء INFP حماية أطفالهم من المشاكل الكبيرة في العالم. وعلى الرغم من أن هذا يكون مناسبًا عندما يكون الأطفال صغارًا، إلا أنه يصبح من المهم بمرور الوقت التحدث معهم حول القضايا الصعبة ومناقشتها بأسلوب يناسب أعمارهم.

ومن التحديات التي قد يواجهها آباء INFP هو وضع قواعد وهياكل عملية ليوم أطفالهم. ومع ذلك، يمكن لهؤلاء الآباء الاستفادة من طاقاتهم الإبداعية في وضع حدود وقواعد دون خنق فضول أطفالهم أو تعطيل حماسهم. بفضل قدرتهم الفريدة على التعاطف وفهم وجهات نظر الآخرين، يمكنهم ابتكار جداول وقواعد تتناسب مع الاحتياجات الفردية لكل طفل، مما يساعدهم على تحقيق التوازن بين الانضباط والحرية.
'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'العلاقات الرومانسية',
              text2:
                  '''من العدل القول إن شخصيات INFP تدخل عالم الرومانسية بتوقعات عالية. قد يكونون قد أمضوا سنوات في أحلام اليقظة عن العلاقة المثالية، متخيلين كيف سيكون الشعور عندما يشاركون أعمق جوانبهم الداخلية مع شخص آخر. لكن الواقع الفعلي للمواعدة قد يكون صادمًا لهم، مما يجبرهم على مواجهة سؤال صعب:"إذا أرادوا أن يكونوا في علاقة، فهل سيضطرون إلى التنازل عن مثاليّاتهم؟"'''),
          TabsCloumn(
              text1: 'رومانسيون ميؤوس منهم',
              text2:
                  '''لا يسعى أفراد شخصية INFP فقط للعثور على شريك، بل يتطلعون إلى الارتباط بـ "روح توأم". يتميزون بالتفكير العميق والانفتاح، وعادة ما يكونون مستعدين للنظر في مواعدة أشخاص من مختلف الخلفيات. يفخر INFP بقدرتهم على تجاوز السمات السطحية لشريك محتمل – مثل المظهر أو الحالة الاجتماعية أو الممتلكات – والتركيز على إشارات أعمق وأكثر مغزى تدل على التوافق.

ولكن سيكون من الخطأ الاعتقاد بأن INFP لا يضعون معايير مسبقة لشريك حياتهم. بفضل عقولهم النشطة وخيالهم الواسع، يميل هؤلاء الأشخاص إلى تطوير رؤية مثالية للشريك المثالي وحملها معهم. قد تكون هذه الرؤية مستندة إلى شخصية خيالية مفضلة، أو شخص عرفوه في الماضي، أو ببساطة القصص التي رسموها لأنفسهم حول الشكل "المثالي" للحب.

عندما يلتقون بشخص جديد، لا يستطيع معظم أفراد شخصية INFP إلا مقارنة هذا الشخص بالصورة المثالية التي رسموها لروحهم التوأم. وكما هو متوقع، فإن هذه المقارنات غالبًا ما تستبعد الكثير من الشركاء المحتملين. قد يكون من الصعب – إن لم يكن مستحيلاً – لشخص حقيقي من لحم ودم أن يرتقي إلى مستوى الأحلام الغالية لهذه الشخصية.'''),
          TabsCloumn(
              text1: 'البحث عن الحقيقة',
              text2:
                  '''يميل أصحاب شخصية INFP إلى تعزيز الانسجام بدلاً من الخلاف. ورغم أن هذا يمنح علاقاتهم الاستقرار، إلا أنه قد يؤدي أحيانًا إلى مشكلات. لتجنب الصراعات، قد يتجنبون التحدث بصراحة عن الأمور التي تزعجهم – وبدلاً من ذلك، قد ينشغلون بالمشكلة ذهنيًا أو يحاولون حلها بمفردهم. قد يركز INFP أيضًا على إسعاد شريكهم، حتى لو كان ذلك على حساب أولوياتهم وإحساسهم بذاتهم.
هذا الميل إلى كتمان المشاعر قد يجعلهم عرضة للجرح. فخيبات الأمل والقلوب المكسورة تؤثر عليهم بشدة، وغالبًا ما تدفعهم إلى الانسحاب إلى قوقعتهم. لذلك، قد يحتاج INFP إلى تذكير أنفسهم بأن التواصل المفتوح والصادق ضروري في العلاقة، حتى لو لم يكن دائمًا سهلاً. في الواقع، يمكن للحظات الصراحة أن تُحدث تحولًا إيجابيًا في العلاقة.

على الرغم من هذه التحديات، يظل INFP ثابتًا في سعيه لتحقيق اتصال عاطفي حقيقي. فحب شخص آخر بصدق والقدرة على تلقي الحب بنفس الطريقة هو هدفهم الرومانسي الأسمى، مما يجعل نهجهم في الحب رحلة عميقة وجميلة تُرشدها قلوبهم الحساسة. ومع الحفاظ على تواصل مفتوح، يتمكن أفراد شخصية INFP من البقاء أوفياء لأنفسهم في العلاقة – وتشجيع الشخص الذي يهتمون به على فعل الشيء ذاته.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(text1: 'نقاط القوة', text2: '''الحساسية العاطفية
أفراد شخصيات INFP يمتلكون تعاطفًا عميقًا لا يقتصر فقط على الاهتمام بالآخرين بطريقة مجردة، بل يشعرون بمشاعر الآخرين بشكل مباشر، سواء كانت فرحًا وابتهاجًا أو حزنًا وندمًا. بسبب حساسيتهم، يكونون غالبًا طيبين ويفكرون في الآخرين بعمق، ويكرهون فكرة إيذاء أي شخص حتى ولو دون قصد.

الكرم
نادراً ما يستمتع INFPs بالنجاح على حساب الآخرين. يشعرون بدافع قوي لمشاركة الخير الذي في حياتهم، وإعطاء الفضل لمن يستحقه، ورفع من حولهم. يسعون للمساهمة في عالم يتم فيه سماع كل صوت وتلبية احتياجات الجميع.

الانفتاح
بروح متسامحة ومُرحِّبة، يحاول INFPs تجنب إصدار الأحكام على معتقدات أو أنماط حياة أو قرارات الآخرين. يفضلون التعاطف على الانتقاد، وغالبًا ما يشعرون بالتعاطف حتى مع أولئك الذين ارتكبوا أخطاء. وبسبب انفتاحهم، يصبحون في كثير من الأحيان مستودع أسرار للأصدقاء والأحباء – وأحيانًا حتى للأشخاص الغرباء.

الإبداع
يحب INFPs رؤية الأشياء من زوايا غير تقليدية. من أكثر ما يسعدهم أن يسمحوا لعقولهم بالتحليق في عالم الأفكار والاحتمالات والأحلام. لهذا السبب، لا عجب أن يجذبهم الإبداع، وأن يكونوا ممثلين بشكل جيد بين الكُتّاب والفنانين.

الشغف
يمتلك INFPs بئرًا عميقًا من الشغف، مدفوعًا في الأساس بتعاطفهم العميق وقيمهم الداخلية القوية وفضولهم الدائم حول التجربة الإنسانية. عندما تستهويهم فكرة أو حركة معينة، يرغبون في تقديم قلوبهم وأرواحهم إليها. وعلى الرغم من أنهم قد لا يكونون دائمًا صريحين، فإن هذا لا يقلل من قوة مشاعرهم تجاه قضية تعكس قناعاتهم.'''),
          TabsCloumn(text1: 'نقاط الضعف', text2: '''غير واقعيين
قد يكون تقبل حقيقة أن العالم غير مثالي تحديًا صعبًا لـ INFPs، حيث يميلون إلى أن يكونوا رومانسيين بلا أمل، ينظرون إلى الحياة من خلال عدسات وردية. هذا التوجه يمكن أن يجعلهم عرضة للإحباط عندما لا تفي الواقع بتوقعاتهم المثالية.

انعزاليون
على الرغم من أنهم يتوقون للتواصل مع الآخرين، إلا أن INFPs غالبًا ما يجدون صعوبة في المبادرة بالاقتراب من الناس، خاصة في البيئات الجديدة. قد يترددون في الانخراط أو اتخاذ خطوات للتعارف، مما يجعلهم يشعرون أحيانًا بالوحدة أو العزلة.

يفتقرون إلى التركيز
طبيعتهم الخيالية والاستبطانية تجعل من الصعب عليهم أحيانًا أن يكونوا منتجين. غالبًا ما يشعرون بالإحباط بسبب عدم قدرتهم على التركيز وإتمام المهام، وليس بسبب قلة الكفاءة، بل بسبب انجذابهم لأفكار وأهداف متعددة، مما يجعل من الصعب عليهم الالتزام بمسار عمل محدد.

حساسية عاطفية مفرطة
على الرغم من أن قدرتهم على فهم مشاعر الآخرين من أكبر نقاط قوتهم، إلا أن ذلك قد يتحول إلى عبء إذا لم يضعوا حدودًا واضحة. يمكن أن يؤثر استيعابهم لمزاج الآخرين السلبي بشكل كبير على سلامهم الداخلي وإنتاجيتهم.

رغبة مفرطة في إرضاء الآخرين
الصراع يمثل تحديًا كبيرًا لـ INFPs الذين يسعون للانسجام والقبول. عندما يشعرون برفض أو استياء الآخرين، قد يكرسون أنفسهم بشكل مفرط لتغيير هذا التصور، حتى لو تطلب ذلك الاعتذار عن أشياء لا تخصهم أو بذل جهود مرهقة للحفاظ على العلاقات. هذه الرغبة في إرضاء الآخرين يمكن أن تستنزف طاقتهم وتغطي على حكمتهم الداخلية واحتياجاتهم الخاصة.

نقد ذاتي مفرط
لأنهم يؤمنون بإمكاناتهم الفريدة، فإن INFPs غالبًا ما يضعون لأنفسهم توقعات عالية وغير واقعية. وعندما يفشلون في تحقيق هذه التوقعات، يمكن أن يتهموا أنفسهم بالقصور، ويرون أنهم عديمو الفائدة أو أنانيون أو غير كافين. إذا استمر هذا النقد الذاتي، فقد يؤدي إلى تثبيط عزيمتهم والتخلي عن أحلامهم الأكثر قيمة.
'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'الصداقات',
              text2:
                  '''تجد شخصيات INFP نفسها في بعض الأحيان عالقة في شبكة من التناقضات الاجتماعية. فهم يتوقون إلى الوقت بمفردهم، ولكنهم في نفس الوقت حساسون تجاه الشعور بالوحدة. يرغبون بشدة في أن يتم قبولهم وإعجاب الآخرين بهم، ولكنهم يرفضون التظاهر بأنهم شيء آخر غير ذواتهم الحقيقية. وعلى الرغم من أنهم يترددون في جذب الانتباه لأنفسهم، إلا أنهم لا يريدون أن يكونوا غير مرئيين.
الصداقة كمصدر للراحة

الخبر الجيد هو أنه في صحبة الأصدقاء الحقيقيين، يمكن لشخصيات INFP أن تهرب من عجلة القلق هذه، وأن تركز على الأمور التي تهم حقًا. بالنسبة لهم، الصداقة ليست مجرد علاقة عابرة، بل هي كنز ثمين يمثل فرصة لدعم بعضهم البعض وإحداث تأثير إيجابي في حياتهم. يؤمن INFPs بشدة بالمثل القائل: "الصديق وقت الضيق"، وقلة من الأمور تعزز إحساسهم بالهدف مثل كونهم موجودين من أجل شخص يهتمون به.
هذه الصداقات العميقة ليست مجرد دعم متبادل، بل هي أيضًا وسيلة لشخصيات INFP للتعبير عن تعاطفهم اللامحدود وإحساسهم العميق بالإنسانية.'''),
          TabsCloumn(
              text1: 'البحث عن روح متآلفة',
              text2:
                  '''على الرغم من دفء شخصيات INFP وقبولهم للآخرين، إلا أنهم لا يجدون دائمًا سهولة في تكوين صداقات. قد يعود ذلك إلى أن العلاقات السطحية والعابرة تتركهم غالبًا بشعور من الفراغ. يبحث INFPs عن صداقات دائمة وأصيلة مع أشخاص يشاركونهم الرغبة في التفكير العميق والشعور الحقيقي، والقيام بما هو صواب، وإضافة قيمة إلى العالم بدلًا من أخذها فقط.

يحب INFPs الغوص في مناقشات فلسفية عميقة واستكشاف الأفكار المختلفة، وغالبًا ما يسدون الفجوة بين الواقع والخيال. ومع ذلك، فإن هذا النوع من الشخصيات قادر على تكوين صداقات مع جميع أنواع الأشخاص. الجمع بين السمات الحدسية (N) والاستكشافية (P) في شخصياتهم يجذبهم إلى وجهات نظر متنوعة، مما يساعدهم على تقدير الأصدقاء الذين تختلف تجاربهم ورؤاهم للعالم تمامًا عن رؤاهم.

الجاذبية للتنوع
قد يجدون في الواقع أنه من المنعش أن يتواصلوا مع شخص يبدو أنه لا يوجد بينهما قواسم مشتركة واضحة. يمكن لهذا التنوع أن يثري حياتهم ويمنحهم فرصة للتعلم والنمو من خلال علاقات تتجاوز توقعاتهم المعتادة.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'مقدمة تعريفية',
              text2:
                  '''على الرغم من أن أصحاب شخصية INFP (المعروفون باسم الوسطاء) قد يبدون هادئين أو متواضعين، إلا أنهم يتمتعون بحياة داخلية نابضة بالحيوية والشغف. بفضل إبداعهم وخيالهم الواسع، يمكنهم بسهولة الغرق في أحلام اليقظة، حيث يخترعون العديد من القصص والمحادثات داخل أذهانهم. يُعرف أصحاب هذه الشخصية بحساسيتهم العالية – فهم يستجيبون عاطفيًا بشكل عميق للموسيقى والفن والطبيعة والأشخاص من حولهم. وغالبًا ما يكونون عاطفيين للغاية ومتشبثين بالماضي، يحتفظون بالتذكارات والأشياء التي تملأ أيامهم بالفرح وقلوبهم بالسعادة.

بفضل طبيعتهم المثالية والمتعاطفة، يتوق أصحاب شخصية INFP إلى إقامة علاقات عميقة ومفعمة بالروحانية، ويشعرون بأنهم مدعوون لمساعدة الآخرين. ومع ذلك، وبسبب الطبيعة السريعة التغير والتنافسية لمجتمعنا، قد يشعرون أحيانًا بالوحدة أو بعدم الظهور، وكأنهم يسبحون ضد التيار في عالم لا يبدو أنه يقدّر السمات التي تجعلهم مميزين. ومع ذلك، فإن حساسيتهم الغنية وإبداعهم العميق يمنحهم القدرة الفريدة على التواصل بعمق وإحداث تغيير إيجابي.'''),
          TabsCloumn(
              text1: 'هبة التعاطف',
              text2:
                  '''تتميز شخصيات INFP بفضول صادق تجاه أعماق الطبيعة البشرية. كونهم متأملين بطبيعتهم، فإنهم متناغمون بشكل مذهل مع أفكارهم ومشاعرهم، ولكنهم يتوقون أيضًا لفهم من حولهم بعمق. يمتلك أصحاب هذه الشخصية قلبًا مليئًا بالرحمة والانفتاح، دائمًا على استعداد للاستماع إلى قصص الآخرين دون إصدار الأحكام. وعندما يفتح شخص ما قلبه لهم أو يلجأ إليهم طلبًا للراحة، يشعرون بالشرف لأن يكونوا هناك للاستماع والمساعدة.

يُعد التعاطف من أعظم الهدايا التي تمتلكها شخصية INFP، لكنه في بعض الأحيان يمكن أن يشكل عبئًا. تحملهم هموم العالم على أكتافهم قد يجعلهم عُرضة لاستيعاب المزاجات السلبية أو العقليات المحبطة للآخرين. وإذا لم يتعلموا كيفية وضع الحدود، فقد يشعرون بالإنهاك بسبب كثرة الأخطاء التي يرون أنها بحاجة إلى تصحيح'''),
          TabsCloumn(
              text1: 'التعبير عن حقيقتهم',
              text2:
                  '''قليل من الأشياء تجعل شخصيات INFP تشعر بعدم الارتياح أكثر من التظاهر بأنهم شخص آخر غير أنفسهم. بفضل حساسيتهم والتزامهم بالأصالة، يميل أصحاب هذه الشخصية إلى السعي وراء فرص للتعبير الإبداعي عن الذات. لذا، ليس من المستغرب أن العديد من الشخصيات البارزة في مجالات مثل الشعر والكتابة والتمثيل والفنون هم من INFP.

لا يمكنهم مقاومة التأمل في معنى الحياة وهدفها، مما يدفعهم إلى تخيل مجموعة واسعة من القصص والأفكار والاحتمالات. بالنسبة لهم، الإبداع ليس مجرد مهارة أو هواية؛ إنه وسيلة للتواصل مع أنفسهم ومع العالم من حولهم بعمق وصدق
من خلال هذه العوالم الخيالية، يمكن لشخصيات INFP استكشاف طبيعتهم الداخلية ومكانتهم في العالم. وبينما يُعَد هذا ميزة جميلة، يميل INFPs أحيانًا إلى الانغماس في الأحلام والخيال بدلاً من اتخاذ خطوات عملية. قد يجدون أنفسهم عالقين في نقاشات داخلية طويلة، يتصارعون مع خياراتهم حتى اللحظة الأخيرة.
'''),
        ]),
      ])
    ]);
  }
}
