import 'package:flutter/material.dart';
import 'package:gradution_project/TabsColumn.dart';
import 'package:gradution_project/TabsListView.dart';

class Tabpatterns extends StatefulWidget {
  const Tabpatterns({super.key});

  @override
  State<Tabpatterns> createState() => _TabpatternsState();
}

class _TabpatternsState extends State<Tabpatterns>
    with SingleTickerProviderStateMixin {
  late TabController _tabController;
  int currentIndex = 0;

  @override
  void initState() {
    super.initState();
    _tabController = TabController(length: 7, vsync: this);
    _tabController.addListener(() {
      if (_tabController.indexIsChanging) {
        setState(() {
          currentIndex = _tabController.index;
        });
      }
    });
  }

  @override
  Widget build(BuildContext context) {
    return Expanded(
        child: DefaultTabController(
      length: 7,
      child: Column(
        children: [
          const SizedBox(
            height: 50,
          ),
          TabBar(
            indicatorWeight: 2,
            dividerColor: Colors.white,
            indicatorColor: const Color(0xff4A826C),
            labelPadding: const EdgeInsets.symmetric(horizontal: 15),
            labelStyle: const TextStyle(
                color: Colors.black, fontWeight: FontWeight.bold, fontSize: 17),
            isScrollable: true,
            controller: _tabController,
            tabs: const [
              Text('عادات مكان العمل'),
              Text('مسارات الحياة المهنية'),
              Text('الأبوة'),
              Text('العلاقات الرومانسية'),
              Text('نقاط القوة والضعف'),
              Text('الصداقات'),
              Text('مقدمة تعريفية'),
            ],
          ),
          Expanded(
            child: TabBarView(
              controller: _tabController,
              children: const [
                TabsListView(childs: [
                  TabsCloumn(text1: 'مقدمة تعريفية', text2: '''
مثاليون ومبدئيون، الأشخاص الذين يتمتعون بشخصية INFJ (المحامون) لا يكتفون بالمرور عبر الحياة بلا هدف – بل يسعون للوقوف وإحداث فرق. بالنسبة لهؤلاء الأشخاص المتعاطفين، النجاح لا يتمثل في المال أو المكانة، بل في البحث عن الإشباع، ومساعدة الآخرين، وأن يكونوا قوة للخير في العالم.

على الرغم من أهدافهم وطموحاتهم السامية، لا ينبغي أن يُخطأ في اعتبار INFJ مجرد حالمين كسالى. الأشخاص الذين يتمتعون بهذه الشخصية يهتمون بالنزاهة، ونادرًا ما يشعرون بالرضا حتى يحققوا ما يعرفونه بأنه صحيح. مدفوعون بالضمير إلى أقصى حد، يتحركون في الحياة بوضوح قيمهم، ويهدفون إلى عدم فقدان التركيز على ما هو مهم حقًا – ليس بناءً على آراء الآخرين أو المجتمع بشكل عام، ولكن بناءً على حكمتهم وحدسهم الخاصين.
'''),
                  TabsCloumn(text1: 'مقدمة تعريفية', text2: '''
مثاليون ومبدئيون، الأشخاص الذين يتمتعون بشخصية INFJ (المحامون) لا يكتفون بالمرور عبر الحياة بلا هدف – بل يسعون للوقوف وإحداث فرق. بالنسبة لهؤلاء الأشخاص المتعاطفين، النجاح لا يتمثل في المال أو المكانة، بل في البحث عن الإشباع، ومساعدة الآخرين، وأن يكونوا قوة للخير في العالم.

على الرغم من أهدافهم وطموحاتهم السامية، لا ينبغي أن يُخطأ في اعتبار INFJ مجرد حالمين كسالى. الأشخاص الذين يتمتعون بهذه الشخصية يهتمون بالنزاهة، ونادرًا ما يشعرون بالرضا حتى يحققوا ما يعرفونه بأنه صحيح. مدفوعون بالضمير إلى أقصى حد، يتحركون في الحياة بوضوح قيمهم، ويهدفون إلى عدم فقدان التركيز على ما هو مهم حقًا – ليس بناءً على آراء الآخرين أو المجتمع بشكل عام، ولكن بناءً على حكمتهم وحدسهم الخاصين.
'''),
                  TabsCloumn(text1: 'مقدمة تعريفية', text2: '''
مثاليون ومبدئيون، الأشخاص الذين يتمتعون بشخصية INFJ (المحامون) لا يكتفون بالمرور عبر الحياة بلا هدف – بل يسعون للوقوف وإحداث فرق. بالنسبة لهؤلاء الأشخاص المتعاطفين، النجاح لا يتمثل في المال أو المكانة، بل في البحث عن الإشباع، ومساعدة الآخرين، وأن يكونوا قوة للخير في العالم.

على الرغم من أهدافهم وطموحاتهم السامية، لا ينبغي أن يُخطأ في اعتبار INFJ مجرد حالمين كسالى. الأشخاص الذين يتمتعون بهذه الشخصية يهتمون بالنزاهة، ونادرًا ما يشعرون بالرضا حتى يحققوا ما يعرفونه بأنه صحيح. مدفوعون بالضمير إلى أقصى حد، يتحركون في الحياة بوضوح قيمهم، ويهدفون إلى عدم فقدان التركيز على ما هو مهم حقًا – ليس بناءً على آراء الآخرين أو المجتمع بشكل عام، ولكن بناءً على حكمتهم وحدسهم الخاصين.
'''),
                  TabsCloumn(text1: 'مقدمة تعريفية', text2: '''
مثاليون ومبدئيون، الأشخاص الذين يتمتعون بشخصية INFJ (المحامون) لا يكتفون بالمرور عبر الحياة بلا هدف – بل يسعون للوقوف وإحداث فرق. بالنسبة لهؤلاء الأشخاص المتعاطفين، النجاح لا يتمثل في المال أو المكانة، بل في البحث عن الإشباع، ومساعدة الآخرين، وأن يكونوا قوة للخير في العالم.

على الرغم من أهدافهم وطموحاتهم السامية، لا ينبغي أن يُخطأ في اعتبار INFJ مجرد حالمين كسالى. الأشخاص الذين يتمتعون بهذه الشخصية يهتمون بالنزاهة، ونادرًا ما يشعرون بالرضا حتى يحققوا ما يعرفونه بأنه صحيح. مدفوعون بالضمير إلى أقصى حد، يتحركون في الحياة بوضوح قيمهم، ويهدفون إلى عدم فقدان التركيز على ما هو مهم حقًا – ليس بناءً على آراء الآخرين أو المجتمع بشكل عام، ولكن بناءً على حكمتهم وحدسهم الخاصين.
'''),
                ]),
                Text('3'),
                Text('4'),
                Text('5'),
                Text('6'),
                Text('7'),
                Text('7'),
              ],
            ),
          ),
        ],
      ),
    ));
  }
}
