import 'package:flutter/material.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Info_Patterns.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Tab_Patterns.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Tabs_Column.dart';
import 'package:gradution_project/View/features/EachPatternInfo/patterns_structure.dart';
import 'package:gradution_project/View/features/EachPatternInfo/tabslistview.dart';

class Enfj extends StatelessWidget {
  const Enfj({super.key});

  @override
  Widget build(BuildContext context) {
    return const PatternsStructure(childs: [
      InfoPatterns(
          text1: 'ENFJ',
          text2: 'بطل',
          text3:
              '''شخصيات ENFJ هم قادة بالفطرة، مفعمون بالعاطفة والكاريزما. وهم يشكلون حوالي اثنين في المئة من البشر، وهم في كثير من الأحيان يعملون بالسياسة أو مدربين أو معلمين، يتواصلون مع الآخرين ويلهمونهم لتحقيق وفعل الخير في العالم. بالثقة الطبيعية لديهم التي تولد النفوذ، فإن شخصيات ENFJ تتمتع بقدر كبير من الفخر والفرح عند توجيه الآخرين للعمل معاً لتحسين أنفسهم ومجتمعهم.''',
          image: 'assets/enfj2.png'),
      TabPatterns(tabchilds: [
        TabsListView(childs: [
          TabsCloumn(
              text1: 'عادات مكان العمل',
              text2: '''الأشخاص من نوع شخصية ENFJ (البطل)
يتميز الأشخاص الذين ينتمون إلى شخصية ENFJ بكونهم دافئين، مثاليين، يتمتعون بالكاريزما، مبدعين، واجتماعيين. بفضل هذه الصفات المميزة، يمكنهم التألق في العديد من الأدوار المختلفة وفي جميع مستويات القيادة.
علاوة على ذلك، فإن ENFJ يتمتعون عمومًا بشخصية محبوبة وطباع حسنة، وهي سمات تدفعهم نحو النجاح، خاصة عندما تتاح لهم الفرصة للعمل مع الآخرين. تُمكّنهم طبيعتهم الاجتماعية من بناء علاقات قوية وترك انطباع إيجابي في أي بيئة مهنية، مما يجعلهم من أبرز المرشحين للنجاح في مساراتهم المهنية.'''),
          TabsCloumn(
              text1: 'الموظفون من نوع شخصية ENFJ',
              text2:
                  '''كموظفين الأشخاص من نوع شخصية ENFJ طموحون ومنظمون. لا يقتصر جهدهم على إثبات كفاءتهم وترك انطباع إيجابي لدى مديريهم، بل يسعون أيضًا لإحداث تأثير إيجابي داخل مؤسساتهم. بفضل إدراكهم العميق وتفانيهم، يمكنهم تحمل مسؤوليات متعددة بكفاءة وروح مرحة.

لسوء الحظ، قد يستغل بعض المديرين أخلاقيات العمل العالية لدى ENFJ عن طريق تحميلهم طلبات كثيرة أو تكليفهم بمهام إضافية. وعلى الرغم من أن لديهم القدرة على الدفاع عن أنفسهم، إلا أنهم قد يقبلون كل هذه المهام الزائدة للحفاظ على السلام وتجنب خيبة أمل الآخرين.'''),
          TabsCloumn(
              text1: 'مديرين ENFJ',
              text2:
                  '''يشعر الكثير من الأشخاص من نوع ENFJ بدعوة للقيام بأدوار كمديرين وقادة.
بفضل جاذبيتهم وبصيرتهم وطريقتهم الملهمة في التعبير عن أنفسهم، غالبًا ما يبرع الأشخاص من هذا النوع عند منحهم الفرصة لقيادة فريق – كما يحرصون على أن يتألق فريقهم أيضًا.

يميل المديرون من نوع ENFJ إلى رؤية كل عضو في فريقهم كشخص يتمتع بمواهب مهمة وإمكانات فريدة. نتيجة لذلك، قد يكون العمل تحت إدارتهم تجربة مليئة بالمعنى والإثارة، حيث يوفر ذلك فرصة للتطور على المستوى الشخصي والمهني.
ومع ذلك، قد تمنعهم مثاليتهم أحيانًا من إدراك الحدود الواقعية لإمكانات موظفيهم. ففي بعض الأحيان، قد يُكلفون أعضاء الفريق بمهام لا يكونون مستعدين لها بعد – وهو نهج غالبًا ما يؤدي إلى نتائج عكسية. لحسن الحظ، يمكن للأشخاص من نوع ENFJ الاستفادة من ذكائهم العاطفي وحكمتهم الشخصية لتحقيق توازن بين تشجيع موظفيهم على النمو وعدم دفعهم إلى ما يتجاوز حدود قدراتهم.
'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'مسارات الحياة المهنية',
              text2:
                  '''عندما يتعلق الأمر باختيار مهنة يجد الأشخاص من أصحاب شخصية ENFJ (البطليون) الإشباع في القيام بما يحبونه أكثر – مساعدة الآخرين. كما يفضلون الوظائف التي تلعب فيها الكاريزما الطبيعية دورًا مهمًا في تحقيق النجاح. بفضل سحرهم الطبيعي وإبداعهم ودوافعهم، يمكن لأصحاب شخصية ENFJ العثور على العديد من الطرق لخدمة الآخرين ورفع معنوياتهم في أي بيئة عمل تقريبًا – سواء كانوا يجلسون خلف طاولة لامعة في غرفة اجتماعات شركة كبرى أو خلف طاولة البيع في مقهى محلي محبوب.'''),
          TabsCloumn(
              text1: 'كسب مكانهم',
              text2:
                  '''بفضل ذكائهم العاطفي ومهاراتهم الاجتماعية، يمكن لأصحاب شخصية ENFJ أن يبرعوا في أي مجال يتطلب التفاعل مع الناس، مثل الموارد البشرية، إدارة الفعاليات، التوظيف، أو العلاقات العامة. ومع ذلك، يشعرون بدافع خاص في المناصب التي تمكنهم من توجيه الآخرين للتعلم والنمو ليصبحوا أكثر استقلالية.
يتجه العديد من أصحاب شخصية ENFJ نحو وظائف ذات هدف إنساني، مثل العمل الاجتماعي، التدريس، الإرشاد، التدريب، الرعاية الصحية، أو القانون المتعلق بالمصلحة العامة. أينما عملوا، نادرًا ما يفقدون رؤيتهم لمهمتهم الأساسية: تحسين حياة الآخرين.

بفضل قدرتهم الفطرية على فهم احتياجات العملاء، أو الموظفين، أو الزبائن، يستفيد ENFJ من إبداعهم لتلبية هذه الاحتياجات بطرق مبتكرة وغير متوقعة. ونتيجة لذلك، يتمكنون من إضفاء الإخلاص، والنزاهة، بل وحتى المثالية إلى وظائف مثل المبيعات، وخدمة العملاء، والتسويق، والإعلان، وتطوير المنتجات'''),
          TabsCloumn(
              text1: 'البحث عن القضايا الأعمق',
              text2:
                  '''بفضل تركيزهم ودافعهم القوي، فإن الأشخاص الذين ينتمون لشخصية ENFJ مستعدون دائمًا لمواجهة التحديات. ومع ذلك، فإن بعض التحديات تثير حماسهم أكثر من غيرها. فالعمل الذي يتسم بالتكرار أو العزلة أو القيود قد يكون محبطًا لهم، إذ إن هذه الأدوار لا تمنحهم الفرصة لاستخدام إبداعهم النابض أو تقديم مساهمات ذات معنى.

يرغب هؤلاء الأفراد في رؤية تأثيرهم بشكل ملموس، وليس مجرد إنجاز المهام بشكل منفرد. يشعر ENFJ بالرضا والطاقة عند الانخراط في عمل يسمح لهم بالتراجع خطوة للخلف للتأمل في الصورة الكاملة.

إن ترك إرث إيجابي يُعد أولوية رئيسية لهم. هذا لا يعني أنهم بحاجة إلى حل مشكلة بحجم مشكلة الجوع العالمي (مع أنهم، بفضل طموحهم، يرغبون بذلك بلا شك). لكن العديد من شخصيات ENFJ يستثمرون طاقاتهم المهنية في معالجة بعض القضايا العميقة التي تواجه مجتمعهم، مما يعكس تفانيهم في صنع تأثير إيجابي ومستدام.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'الأبوة',
              text2:
                  '''الأشخاص الذين يتمتعون بشخصية ENFJ (القادة) يجلبون جميع مواهبهم إلى تربية الأطفال، بما في ذلك تعاطفهم، وإصرارهم، وحتى مهاراتهم القيادية. كآباء وأمهات، يقودهم شعور عميق بالهدف. على وجه التحديد، يرى ENFJs أن مهمتهم تتمثل في مساعدة أطفالهم على النمو ليصبحوا أفضل نسخة من أنفسهم وأكثرها لطفًا وكفاءة.

للقيام بذلك، يسعى ENFJs إلى خلق حياة منزلية مليئة بالحب والتشجيع والدعم لأطفالهم. الآباء والأمهات الذين يتمتعون بهذه الشخصية يعززون الإبداع والأصالة، مما يتيح لأطفالهم التعبير عن آرائهم وأن يكونوا على طبيعتهم. بالنسبة لهم، واحدة من أعظم مكافآت الأبوة هي مشاهدة أطفالهم يزدهرون بشخصياتهم الفريدة.'''),
          TabsCloumn(
              text1: 'دروس الحياة الأكثر أهمية',
              text2:
                  '''لكن مجرد أن شخصيات ENFJ تتميز بالرحمة والرعاية لا يعني أنهم يتبنون نهج "كل شيء مسموح". مثل جميع الآباء والأمهات، يلجأ هؤلاء أحيانًا إلى السلطة ويطلبون من أطفالهم القيام بشيء ما "لأنني قلت ذلك". ومع ذلك، في أعماق قلوبهم، يسعى ENFJ إلى التأكد من أن أطفالهم يفعلون الصواب عن فهم واقتناع، وليس عن طاعة عمياء.

لحسن الحظ، يتمكن هؤلاء الآباء المثاليون وذوو الطبيعة الطيبة من شرح الفرق بين الصواب والخطأ بطريقة تُلهم أطفالهم وترفع من معنوياتهم. كما أنهم بارعون في وضع قواعد وحدود واضحة ومناسبة لأعمار أطفالهم، مما يساعدهم على فهم عواقب السلوك غير المسؤول أو غير اللطيف. والأهم من ذلك، فإن شخصيات ENFJ تعلم أطفالها من خلال القدوة، حيث يظهرون السلوكيات التي يأملون أن يتبعها أطفالهم.'''),
          TabsCloumn(
              text1: 'توقعات كبيرة',
              text2:
                  '''يضع الآباء من شخصيات ENFJ معايير عالية لأطفالهم، وعادةً ما تكون هذه التوقعات نابعة من أفضل النوايا. فهم ببساطة يرغبون في ضمان أن يكون أطفالهم على طريق حياة مليئة بالمعنى والرضا تستفيد بشكل جيد من إمكانياتهم.
ومع ذلك، في بعض الأحيان، قد تبدو هذه التوقعات مرهقة بالنسبة لأطفالهم. فقد يشعر أبناء شخصيات ENFJ أنهم بحاجة إلى كسب حب والديهم من خلال تلبية هذه المعايير – معايير قد تبدو صعبة للغاية لتحقيقها. في مثل هذه المواقف، قد يحتاج آباء ENFJ إلى طمأنة أطفالهم بأنهم محبوبون لما هم عليه، وليس فقط لما يحققونه.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'العلاقات الرومانسية',
              text2:
                  '''الأشخاص الذين يتمتعون بشخصية ENFJ (البطل) قد يظهرون بشدة عاطفية عندما يتعلق الأمر بشؤون القلب – وهم لن يقبلوا بغير ذلك. كمتفائلين حقيقيين ومجسدين للشغف، يؤمن ENFJs بأن أرواحهم التوأم موجودة في مكان ما، ولن يستسلموا حتى يعثروا عليها. نادرًا ما يرضى هؤلاء الأشخاص بأي شيء أقل من معاييرهم المثالية، وعلاقاتهم العاطفية ليست استثناءً.'''),
          TabsCloumn(
              text1: 'تجاوز لعبة المواعدة',
              text2:
                  '''عندما يقع الأشخاص الذين يتمتعون بشخصية ENFJ في الحب، فإنهم غالبًا ما يغرقون بشدة – ولا يخفون ذلك. ENFJs هم من بين أنواع الشخصيات الأكثر استعدادًا للتعبير عن مشاعرهم، لذلك غالبًا ما يجدون أنفسهم يأخذون الخطوة الأولى بدلاً من اللعب بالألعاب أو انتظار التأكيد بأن الشخص الآخر يشعر بنفس الطريقة.

في عالم المواعدة، يمكن أن تكون رغبتهم في الإفصاح عن أنفسهم منعشة وربما غير اعتيادية قليلاً. هذه الصفة، إلى جانب شدة شغفهم، تجذب الكثير من الأشخاص بشكل كبير. ومع ذلك، نظرًا لأن شخصيات ENFJ غالبًا ما تقوم بالخطوة الأولى، فقد يواجهون نصيبهم من الرفض أثناء بحثهم عن الروح المتوافقة معهم.'''),
          TabsCloumn(
              text1: 'الحلم المشترك',
              text2:
                  '''من أول موعد حتى الموعد الخمسين، لا يتردد الأشخاص الذين يتمتعون بشخصية ENFJ في توجيه المحادثة نحو مواضيع أعمق. لا يكتفون باكتشاف البرامج التلفزيونية التي يشاهدها شريكهم – بل يرغبون في فهم أحلام شريكهم وتطلعاته والتغييرات التي يأملون في إحداثها لأنفسهم وللعالم. وإذا تعمقت العلاقة إلى المستوى الذي يسعون إليه، فإن ENFJs يشعرون بالفخر لدعم شريكهم في تحقيق هذه الأحلام.

ومع ذلك، قد يأخذ بعض الأشخاص الذين يتمتعون بشخصية ENFJ هذا المنظور المتطلع إلى الأمام خطوة أبعد، حيث يتبنون أهداف شريكهم كأنها أهدافهم الخاصة. وهذا قد يؤدي إلى مشاكل، على أقل تقدير. إذا انغمسوا بشكل مفرط في مساعدة شريكهم، فقد ينتهي بهم الأمر إلى إهمال العناية بأنفسهم وهواياتهم وعلاقاتهم الأخرى. كما أنهم قد يخاطرون بدفع شريكهم لتغيير حياته بطرق قد لا يكون مستعدًا لها.

عندما يتجاوز ENFJs الحد في هذا الأمر، غالبًا ما يجدون أن الضغط الذي يضعونه على شريكهم لتحسين نفسه يرتد بنتائج عكسية بواحدة من طريقتين: قد يصبح الشريك غير واثق، خائفًا من أنه ليس جيدًا بما يكفي كما هو، أو قد يصبح غاضبًا، مستاءً من الإشارة إلى أنه بحاجة إلى التغيير. في كلتا الحالتين، يجب أن يتعلم ENFJs كيفية تشجيع شريكهم على النمو دون المبالغة في الضغط عليه.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'نقاط القوة',
              text2:
                  '''منفتحون على الآراءالأشخاص الذين يمتلكون شخصية ENFJ (البطل) لديهم آراء قوية، ولكنهم بعيدون كل البعد عن ضيق الأفق. يدركون أهمية منح الآخرين الفرصة للتعبير الكامل عن أنفسهم. حتى عندما لا يتفقون مع شخص ما، فإنهم يحترمون حقه في التعبير عن "حقيقته".

يمكن الاعتماد عليهمقلة من الأشياء تزعج ENFJs أكثر من فكرة خذلان شخص أو قضية يؤمنون بها. يمكن الاعتماد على أصحاب هذه الشخصية للوفاء بوعودهم ومسؤولياتهم – حتى عندما يكون ذلك صعبًا.

شغوفونشخصيات ENFJ مليئة بالاهتمامات، ويستمتعون بشدة بممارسة هواياتهم – سواء كانت المشي في الطبيعة، الطبخ، الرقص، زراعة النباتات المنزلية، أو أي نشاط آخر. نتيجة لذلك، نادرًا ما يجدون أنفسهم في حالة افتقار لما يمكنهم فعله.

إيثاريونيشتهر ENFJs برغبتهم العميقة في أن يكونوا قوة للتغيير الإيجابي سواء في حياتهم الشخصية أو المهنية. ميلهم الثابت نحو الإنصاف غالبًا ما يدفعهم للدفاع عن أولئك الذين لا يستطيعون الدفاع عن أنفسهم. سعادتهم تكمن في رؤية من حولهم يزدهرون، مما يجعل إيثارهم صادقًا ونابعًا من القلب.

جذابونعازمون وملهمون، غالبًا ما يجد ENFJs طريقهم إلى أدوار قيادية. سواء كانوا قادة فريق رياضي أو شخصيات قيادية على المسرح العالمي، فإنهم يتألقون في المحادثات، ويجذبون انتباه الناس، ويجمعونهم حول هدف مشترك. يتمتعون أيضًا بقدرة عميقة على التعاطف، مما يجعل الآخرين يشعرون بأنهم مفهومون ومقدرون، مما يعزز جاذبيتهم الطبيعية.'''),
          TabsCloumn(
              text1: 'نقاط الضعف',
              text2:
                  '''غير واقعيينغالبًا ما يضغط ENFJs على أنفسهم لحل كل مشكلة يواجهونها. ولكن مهما حاولوا، فإن محاولة إصلاح كل شيء في العالم ليست واقعية. إذا لم يكونوا حذرين، فقد يفرطون في تحميل أنفسهم الأعباء، مما يؤدي إلى عجزهم عن مساعدة أي شخص بشكل فعال.

مثاليون بشكل مفرطيميل ENFJs إلى تبني أفكار واضحة حول ما هو صواب وما هو خطأ، وغالبًا ما يعتقدون أن الجميع يشاركونهم هذه المبادئ – أو على الأقل، يجب أن يشاركوها. لهذا السبب، يشعرون بصدمة حقيقية عندما ينتهك الآخرون قيمهم الأساسية، مثل الحقيقة أو العدالة.

متعالونيستمتع الأشخاص الذين يتمتعون بهذه الشخصية بتعليم الآخرين، خاصة فيما يتعلق بالقضايا والمعتقدات التي تهمهم كثيرًا. ولكن في بعض الأحيان، قد تبدو محاولاتهم "لتنوير" الآخرين متعالية – وهي ليست الطريقة الأكثر فعالية لإقناع الآخرين، للأسف.

شديدو الحدةنادراً ما يفتقر ENFJs إلى الطاقة أو العزيمة عندما يتعلق الأمر بتحسين الذات. ومع ذلك، قد لا يدركون أن الآخرين لا يشاركونهم نفس المستوى من الحماسة. في بعض الأحيان، قد يدفعون الآخرين لإجراء تغييرات لم يكونوا مستعدين لها – أو لم يهتموا بها في المقام الأول.

مفرطو التعاطفالتعاطف هو أحد أعظم نقاط قوة هذه الشخصية. ومع ذلك، يميل ENFJs إلى التعامل مع مشاكل الآخرين كما لو كانت مشاكلهم الخاصة – وهو ما قد يرهقهم عاطفياً وجسدياً.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'الصداقات',
              text2:
                  '''التواصل مع الآخرين يجعل أصحاب شخصية ENFJ (الرواد) يشعرون بالحيوية والهدف.ليس من المستغرب، إذًا، أنهم ليسوا على الإطلاق غير مبالين بالصداقة. يبذل أصحاب هذه الشخصية جهدًا صادقًا ومخلصًا للبقاء قريبين من أصدقائهم. بالنسبة لهم، الصداقات ليست شيئًا يمكن الاستغناء عنه أو التقليل من أهميته – بل إنها جزء أساسي من حياة تُعاش بشكل جيد.'''),
          TabsCloumn(
              text1: 'ثراء وجهات النظر',
              text2:
                  '''قليل من أنواع الشخصيات يمكنه مضاهاة الرغبة الصادقة لأصحاب شخصية ENFJ في التعرف على الآخرين. بالنسبة لهم، اكتشاف تفاصيل شخصية الآخرين وآرائهم وآمالهم وحتى نقاط ضعفهم هو أحد أنقى متع الحياة. لا يستطيع معظم أصحاب شخصية ENFJ إلا أن يكونوا مفتونين بوجهات النظر المختلفة، حتى تلك التي يختلفون معها تمامًا. استكشاف تنوع وجهات النظر هو ما يجعل الحياة مثيرة وممتعة لهذه الشخصيات.

ونتيجة لذلك، يحيط أصحاب شخصية ENFJ أنفسهم بمختلف الأصدقاء والمعارف. في الواقع، هم النوع الأكثر احتمالًا لأن يكون لديهم أكثر من مجموعة أصدقاء لأغراض مختلفة في حياتهم. سواء كانوا أصدقاء من العمل أو شركاء في التمارين الرياضية أو رفقاء السهر، يستمتع أصحاب شخصية ENFJ بالاسترخاء وقضاء الوقت مع الأصدقاء، والغوص في محادثات جيدة، والتعرف على ما يحفز أصدقاءهم.

مع ذلك، يجد معظم أصحاب شخصية ENFJ صعوبة في احترام الأشخاص الذين يسلكون الطرق السهلة، أو يسيئون للآخرين، أو يرفضون تحدي الوضع الراهن. بدلاً من ذلك، يشعرون بالانسجام الأكبر مع الأشخاص الذين يشاركونهم قيمهم الأساسية، وخاصة التزامهم بفعل الشيء الصحيح وتحسين العالم من حولهم. مع هؤلاء الأصدقاء المقربين، يكشف أصحاب شخصية ENFJ عن أنفسهم بصدق، ويشاركون نقاط ضعفهم وأحلامهم الأكثر قيمة لمستقبلهم.'''),
          TabsCloumn(
              text1: 'إيجاد التوازن',
              text2:
                  '''بينما يستمتع أصحاب شخصية ENFJ بتقديم يد المساعدة، إلا أنهم لا يكونون دائمًا راضين عن النتائج. الحقيقة أن بعض الأشخاص قد لا يمتلكون الطاقة أو الدافع للاستفادة الكاملة من عروض المساعدة التي يقدمها ENFJ – أو قد لا يرغبون في ذلك ببساطة. على سبيل المثال، قد يتجاهل صديقهم نصيحة بشأن تحسين السيرة الذاتية، أو يفضل الاسترخاء بدلًا من استخدام السيرة الذاتية المحدثة للتقديم على الوظائف.

عندما يحدث هذا، قد يشعر أصحاب شخصية ENFJ بعدم التقدير، أو بالإحباط، أو حتى بالاستياء. وفي بعض الأحيان، قد يلجؤون إلى إصدار الأحكام أو محاولة دفع أصدقائهم نحو الأمام بأسلوب حازم – وهو أسلوب غالبًا ما يأتي بنتائج عكسية.
4o'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'مقدمة تعريفية',
              text2:
                  '''يجد أصحاب شخصية ENFJ (الشخصيات القيادية) أنفسهم مدفوعين لخدمة هدف أسمى في الحياة. بفضل تفكيرهم العميق وطبيعتهم المثالية، يسعى هؤلاء الأشخاص إلى ترك أثر إيجابي على الآخرين والعالم من حولهم. ونادرًا ما يتجنب أصحاب هذه الشخصية فرصة لفعل الشيء الصحيح، حتى عندما يكون ذلك بعيدًا عن السهولة.

يُولد أصحاب شخصية ENFJ قادة بالفطرة، وهذا يفسر وجودهم بين العديد من الشخصيات البارزة مثل السياسيين والمدربين والمعلمين. شغفهم وكاريزميتهم يمنحانهم القدرة على إلهام الآخرين، ليس فقط في حياتهم المهنية، ولكن أيضًا في جميع مجالات حياتهم، بما في ذلك علاقاتهم الشخصية. قلة من الأشياء تجلب لأصحاب شخصية ENFJ شعورًا أعمق بالفرح والرضا مثل مساعدة الأصدقاء والأحباء على النمو ليصبحوا أفضل نسخة من أنفسهم.
'''),
          TabsCloumn(
              text1: 'الدفاع عن ما هو صحيح',
              text2:
                  '''يميل أصحاب شخصية ENFJ إلى التعبير عن قيمهم، بما في ذلك الأصالة والإيثار. عندما يرون شيئًا غير عادل أو خاطئ، فإنهم لا يترددون في التحدث عنه. ومع ذلك، فإنهم نادرًا ما يظهرون بأسلوب فظ أو متعجرف، حيث تقودهم حساسيتهم وفهمهم العميق للتعبير بطرق تصل إلى قلوب الآخرين.

تتميز هذه الشخصية بقدرة مذهلة على فهم الدوافع والمعتقدات الكامنة لدى الآخرين، بالإضافة إلى براعة في التعرف على مشاعر الناس بمجرد النظر إليهم. في بعض الأحيان، قد لا يدركون حتى كيف تمكنوا من فهم عقل وقلب شخص آخر بهذه السرعة. هذه الومضات من البصيرة تجعل أصحاب شخصية ENFJ متحدثين مقنعين وملهمين للغاية.'''),
          TabsCloumn(
              text1: 'قيادة الطريق',
              text2:
                  '''أصحاب شخصية ENFJ هم أناس مكرسون للإيثار، مستعدون لمواجهة التحديات والصعاب من أجل الدفاع عن الأشخاص والأفكار التي يؤمنون بها. هذه القناعة القوية تعزز قدرتهم على توجيه الآخرين للعمل معًا في سبيل الخير العام.

لكن أعظم هبة يمتلكونها قد تكون قدرتهم على القيادة من خلال القدوة. في حياتهم اليومية، يظهرون كيف يمكن التعامل مع المواقف العادية بقدر كبير من التعاطف والتفاني والاهتمام. بالنسبة لهؤلاء الأشخاص، حتى أصغر الخيارات والأفعال اليومية – بدءًا من كيفية قضاء عطلة نهاية الأسبوع إلى ما يقولونه لزميل يعاني من مشكلة – يمكن أن تصبح فرصة لقيادة الطريق نحو مستقبل أكثر إشراقًا.'''),
        ]),
      ])
    ]);
  }
}
