import 'package:flutter/material.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Info_Patterns.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Tab_Patterns.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Tabs_Column.dart';
import 'package:gradution_project/View/features/EachPatternInfo/patternsstructure.dart';
import 'package:gradution_project/View/features/EachPatternInfo/tabslistview.dart';

class Enfp extends StatelessWidget {
  const Enfp({super.key});

  @override
  Widget build(BuildContext context) {
    return const Patternsstructure(childs: [
      Infopatterns(
          text1: 'ENFP',
          text2: 'مناضل',
          text3:
              '''شخصية المناضل هي بحق روح حرة. وهي غالباً ما تكون روح أي حفلة تشارك فيها، ولكنها أقل اهتماماً بالإثارة والمتعة اللحظية المحضة بل تهتم بالتمتع بالصلات الاجتماعية والعاطفية التي يقومون بها مع الآخرين. وهي شخصية ساحرة مستقلة حيوية ورحيمة، والمتمتعين بها يشكلون 7٪ من البشر، ولذا ستلاحظهم بالتأكيد في أي تجمع بشري''',
          image: 'assets/images/enfp2.png'),
      Tabpatterns(tabchilds: [
        TabsListView(childs: [
          TabsCloumn(
              text1: 'عادات مكان العمل',
              text2:
                  '''"ربما يمكنني... قيادة طائرات هليكوبتر، والعمل كعالم محيطات، وكتابة الأغاني، والطهي؟" – يُعرف الأشخاص من نوع ENFP (الحملات) بامتلاكهم لثروة من الأفكار والاهتمامات والهوايات، لدرجة أنهم قد يجدون صعوبة في استيعاب كل ما يهتمون به في حياتهم.
لذلك، ليس من المستغرب أن يواجه هؤلاء الأشخاص المبدعون شعورًا بالارتباك أو التشتت عند اختيار مسارهم المهني. فهم يريدون من خلال عملهم أن يضيفوا قيمة للعالم، ويبنون مجتمعًا، ويساهمون في التعلم، ويعبرون عن إبداعهم. ونتيجة لذلك، قد يشعرون بالانجذاب إلى عدة اتجاهات، غير متأكدين من كيفية التوفيق بين شغفهم وقيمهم مع الحفاظ على خياراتهم مفتوحة وضمان دخل مستقر.'''),
          TabsCloumn(
              text1: 'ما يناسب ENFP في العمل',
              text2:
                  '''يتمتع الأشخاص من نوع ENFP بقدرة فريدة على إضفاء البهجة والإشراق على العالم من حولهم – بما في ذلك مكان عملهم. وكأشخاص متفائلين بالفطرة، يمكنهم عادةً العثور على المتعة والرضا في أي وظيفة تقريبًا. بل وقد يرحبون بالتحديات مثل كسر حواجز زميل غاضب، أو جعل العملاء المرهقين يبتسمون، أو رفع معنويات بيئة عمل غير مبهجة.

مع ذلك، يميل ENFP إلى الشعور بالرضا عندما يلبي العمل معايير معينة. أولاً، يحتاجون إلى الإيمان بأن ما يقومون به يوميًا يتماشى مع قيمهم الأساسية. ثانيًا، يشعر أغلب ENFP بأفضل حال عندما يكون العمل الذي يقومون به يستخدم مواهبهم – سواء المكتسبة أو الفطرية – ويساهم في تطويرها.'''),
          TabsCloumn(
              text1: 'السماح للإبداع بالسيطرة',
              text2:
                  '''بالنسبة للأشخاص من نوع ENFP، قلة من الأشياء يمكن أن تكون محبطة بقدر وظيفة تتسم بالرتابة اليومية. فالتكرار والتنبؤ يجعلهم يشعرون ليس فقط بالملل، بل وأحيانًا بالإحباط أيضًا. وعلى الرغم من أنهم يستفيدون من بعض التنظيم والمساءلة، إلا أنهم قد يفقدون الحماس في بيئات العمل التي تعتمد بشكل كبير على الصرامة والتراتبية الهرمية.

تتوق شخصيات ENFP إلى التنوع، ويحبون طرح الأسئلة. وعندما يُطلب منهم تركيز كل طاقتهم على موضوع واحد أو مشروع واحد لفترة طويلة، فإنهم يميلون إلى فقدان التركيز. للحفاظ على حماسهم وتحفيزهم المميز، يحتاجون إلى الشعور بأنهم يستكشفون أفكارًا جديدة ويدفعون حدود الابتكار. أي وظيفة تطلب منهم البقاء صامتين واتباع البروتوكول بدقة تجعل اثنتين من أعظم نقاط قوتهم عبئًا عليهم.
لحسن الحظ، فإن إبداع ENFP الذي لا يقاوم يعد ميزة في معظم بيئات العمل. بفضل حيويتهم وتعاطفهم، يمكنهم تحويل كل يوم عمل إلى فرصة لتعلم شيء جديد وتحسين العالم ولو قليلاً – وهم لا يفضلون أن يكون الأمر بأي طريقة أخرى.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'مسارات الحياة المهنية',
              text2:
                  '''الأشخاص من نوع شخصية INFP يبحثون غالبًا عن مهنة توفر لهم أكثر من مجرد دخل مادي. فهم يتوقون إلى وظيفة يشعرون فيها بالرضا الشخصي، حيث يقضون أيامهم في عمل شيء يحبونه بصدق، ويفضلون أن يكون بعيدًا عن التوتر أو الدراما.

لكن نظرًا لطبيعتهم المثالية، قد يجد INFPs صعوبة في العثور على وظيفة تلبي احتياجاتهم العملية وتنسجم مع أحلامهم في الوقت نفسه. يمكن أن يؤدي هذا التحدي إلى حالة من الإحباط، حيث ينتظرون الوظيفة المثالية لتأتيهم، ما يجعلهم يشعرون بأنهم عالقون أو غير قادرين على تحقيق إمكاناتهم الكاملة.'''),
          TabsCloumn(
              text1: 'مكان للجميع',
              text2:
                  '''على الرغم من أن هذا النوع من الشخصيات لا يُعرف بسعيه وراء الأضواء، إلا أن INFPs يمكنهم العثور على هدف حياتهم في الفنون المسرحية. نظرًا لحساسيتهم للجمال الفني، يجد بعضهم أنفسهم يتألقون في مجالات الموسيقى أو الدراما أو الرقص. يستطيع هؤلاء الأشخاص استغلال أعماقهم الداخلية لإبراز تفسيرات رائعة لأعمال المبدعين. كما قد يبدعون أعمالهم الخاصة ككتّاب مسرحيين، أو ملحنين، أو مصممي رقصات.

مهما كان مجال عملهم، يرغب INFPs في الشعور بأن عملهم يساهم في مساعدة الآخرين. لذا، ليس من المستغرب أن يختار العديد من أصحاب هذه الشخصية وظائف تركز على تقديم الخدمات 
بالنسبة لهذه الشخصيات المتعاطفة والداعمة، لا يوجد ما هو أكثر قيمة من رؤية عملهم يساهم في تحسين حياة الآخرين بشكل ملموس.'''),
          TabsCloumn(
              text1: 'العثور على طريقهم',
              text2:
                  '''أصحاب شخصية INFP يتمتعون بقدر كبير من القدرة على التكيف، لكنهم قد يشعرون بالإحباط عند العمل في بيئات ذات ضغوط عالية، أو بيروقراطية صارمة، أو إيقاع عمل فوضوي. كما قد يواجهون صعوبة في التأقلم مع أماكن العمل التي تتسم بالنقد الشديد أو التنافسية المفرطة. على العكس من ذلك، فإن أماكن العمل التي تُكافئ الاستقلالية غالبًا ما تكون مناسبة لهم، على الرغم من أنهم قد يُقدِّرون وجود بعض الهياكل التنظيمية والإشراف لمساعدتهم على تجنب التسويف أو التشتت في الأفكار.

ومع ذلك، فإن الأشخاص الذين يتمتعون بهذه الشخصية لا يحتاجون إلى ظروف مثالية لتحقيق النجاح المهني. INFPs يرغبون في العيش بما يتماشى مع قيمهم، سواء في حياتهم المهنية أو أي جانب آخر من حياتهم. يمكنهم تحمل – والتغلب على – أي عدد من التحديات طالما أن لديهم شعورًا بالرسالة والهدف في عملهم.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'الأبوة',
              text2:
                  '''بالنسبة للأشخاص من نوع ENFP (الحملات)، تعد مشاركة إحساسهم بالدهشة والإلهام مع أطفالهم واحدة من أعظم متع الأبوة والأمومة. قلة من الأشياء تكون أكثر إرضاءً لهم من رؤية أطفالهم يتوهجون فضولًا تجاه العالم من حولهم، ويخطون خطوات لاكتشاف كيفية عمل الأشياء، ويستخدمون معارفهم للمساهمة في تحسين المجتمع. فهؤلاء الآباء لا يرغبون فقط في أن ينجو أطفالهم في العالم – بل يريدون إلهامهم لتغييره.

يبذل آباء ENFP جهدًا كبيرًا لضمان شعور أطفالهم بالقبول والقيمة كما هم. بدلاً من الضغط عليهم للظهور أو التصرف بطريقة معينة، يشجعون إبداعهم وتعبيرهم عن أنفسهم. مستعينين بذكائهم وإبداعهم الخاص، يوجه آباء ENFP أطفالهم لاكتشاف واحتضان شغفهم واهتماماتهم الفريدة.'''),
          TabsCloumn(
              text1: 'موازنة الحب والانضباط',
              text2:
                  '''إيجاد التوازن الصحيح بين احترام استقلالية الأطفال وفرض الانضباط يمكن أن يكون تحديًا أحيانًا لآباء وأمهات ENFP، بسبب ميلهم القوي للتناغم واحترام الحرية الفردية. قد يجدون صعوبة في فرض القواعد والقيود اللازمة لتوفير الهيكل وتعزيز الحدود المهمة، حيث يرون ذلك أحيانًا على أنه "قسوة" تتعارض مع طبيعتهم العطوفة. كما أنهم غالبًا ما يقلقون من أن الصرامة الزائدة قد تؤثر سلبًا على الرابط العاطفي المحب الذي يجمعهم بأطفالهم.

لكن مع مرور الوقت، يكتشف العديد من الأشخاص من نوع ENFP أن وجود بعض الهيكلية يمكن أن يساعد أطفالهم على الازدهار. وبمجرد إدراكهم لهذا الأمر، يتعلم هؤلاء الآباء وضع إرشادات بطريقة تجمع بين الحب والحزم. وفي هذا السياق، يصبح فرض القواعد المناسبة وسيلة إضافية للتعبير عن مدى حبهم ورعايتهم لأطفالهم.'''),
          TabsCloumn(
              text1: 'انطلق، وافرد جناحيك',
              text2:
                  '''على مدار حياة أطفالهم، يقدم آباء وأمهات ENFP لأبنائهم قدرًا هائلًا من الحب والدعم. ومع ذلك، عندما يصل الأطفال إلى مرحلة المراهقة، يصبح من الطبيعي أن يسعوا لإثبات استقلاليتهم. قد يقضون وقتًا أطول مع أصدقائهم أكثر من عائلاتهم، أو يجربون آراء وأفكارًا تختلف جذريًا عن تلك التي يتبناها آباؤهم.

على الرغم من حبهم لفكرة أن يصبح أطفالهم مستقلين، قد يشعر آباء وأمهات ENFP أحيانًا بأن أطفالهم يبعدونهم عن حياتهم – وهو أمر يمكن أن يكون مؤلمًا للغاية بالنسبة لهذه الشخصيات. فرغم طبيعتهم الحرة، يتمتع ENFP بحساسية عالية تجاه مشاعر الآخرين وتوقعاتهم، وقد يجدون صعوبة في عدم أخذ تصرفات أطفالهم على محمل شخصي.

لحسن الحظ، فإن تعاطف ENFP يمكن أن يساعدهم على فهم واحترام احتياجات أطفالهم في كل مرحلة من مراحل التطور. يتمتع الآباء والأمهات من هذا النوع بقدرة رائعة على التواجد مع أطفالهم في اللحظة التي يعيشونها، وفهمهم تمامًا كما هم. هذا النهج يمكن أن يساعد الأطفال على تطوير إحساس قوي بالذات وبالقيمة الشخصية، مما يمكّنهم من الانطلاق بثقة في العالم الواسع، مع علمهم بأنهم يمكنهم الاعتماد على أنفسهم وعلى والديهم من ENFP في أي وقت.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'العلاقات الرومانسية',
              text2:
                  '''يصعب المبالغة في تقدير مدى اهتمام الأشخاص من نوع شخصية ENFP (الحملات) بالحب. فهم أفراد شغوفون، دافئون، ومنفتحون، يمتلئون بالآمال والأحلام والأفكار، ويتوقون لحياة مليئة بالتجارب الغنية. ويجلبون كل ذرة من هذه الطاقة الحيوية إلى علاقاتهم العاطفية.'''),
          TabsCloumn(
              text1: 'إشعال شرارة الحب',
              text2:
                  '''عندما يهتم الأشخاص من نوع ENFP بشخص ما، نادرًا ما يكبحون مشاعرهم. فهم يميلون إلى الوقوع في الحب بسهولة – وبشدة. يغمرون شريكهم الجديد بمشاعر المودة، وهم على ثقة بأن الإخلاص والشغف الذي يشعرون بهما حقيقي.

كونهم متفائلين بالفطرة، لا تثني التحديات العملية أو الإزعاجات الناتجة عن علاقة جديدة عزيمة ENFP. ربما يفسر هذا سبب عدم ترددهم عمومًا في خوض علاقات طويلة المدى. ففي أذهانهم، لا يمكن للمسافة الجغرافية أن تقف أمام قوة الحب الحقيقي. بدلاً من التركيز على المشكلات المحتملة، يغوص ENFP في متعة مرحلة شهر العسل في العلاقة، ويسعون باستمرار لإثبات إخلاصهم وإسعاد شريكهم.
سواء للأفضل أو للأسوأ، ليس الجميع قادرًا على مجاراة شدة الحماس والعاطفة التي يتمتع بها الأشخاص من نوع ENFP. بعض الأشخاص يحتاجون إلى مساحة أكبر – سواء كانت مادية أو عاطفية، أو كلاهما. وإذا لم يبدُ أن حماس الشريك يتماشى مع حماسهم، قد يجد ENFP أنفسهم يتساءلون عما إذا كانوا يفعلون شيئًا خاطئًا.
وعندما تبدأ شرارة الرومانسية في الخفوت أو التراجع مع نضوج العلاقة – كما يحدث في معظم العلاقات طويلة الأمد – قد يقلق ENFP من أن إخلاصهم كان في غير محله، وأن العلاقة قد لا تكون كما تخيلوها في البداية.'''),
          TabsCloumn(
              text1: 'لغز العلاقات',
              text2:
                  '''يميل الأشخاص من نوع ENFP إلى أن يكونوا محبين ومرحين مع شركائهم. فهم يعتبرون التواصل الجسدي جزءًا أساسيًا وفعالًا للتعبير عن حبهم في العلاقات العاطفية.
وربما بسبب سخائهم الكبير في التعبير عن مشاعرهم، قد يجدون صعوبة في فهم السبب وراء فشل بعض العلاقات. ألا يجب أن يكون الحب كافيًا ليبقي شخصين معًا بسعادة – خاصةً عندما يكون أحدهما، مثل ENFP، مستعدًا لبذل كل ما بوسعه لإسعاد الآخر؟
لكن، مثل الجميع، يحتاج ENFP إلى تذكير أنفسهم بأن العلاقات تعتمد في كل جانب على التبادل – تبادل الاهتمام، تبادل النمو، وتبادل المسؤوليات. وكما يتعلم العديد من ENFP، فإن مصير العلاقة يعتمد أقل على ما إذا كانت "مكتوبة" بطريقة كونية، وأكثر على كيفية تعامل الشريكين وتواصلهما مع بعضهما البعض.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'نقاط القوة',
              text2:
                  '''الفضولالأشخاص من نوع ENFP يجدون الجمال والجاذبية في كل شيء تقريبًا. بفضل خيالهم وعقولهم المنفتحة، لا يخشون الخروج من منطقة راحتهم بحثًا عن أفكار وتجارب ومغامرات جديدة. علاوة على ذلك، فإن فضولهم لا يقتصر فقط على السعي وراء الجديد، بل يمتد إلى رغبة عميقة في فهم كيفية عمل الأشياء ولماذا هي كما هي.

الإدراكبالنسبة لشخصيات ENFP، لا أحد يعتبر غير مهم – ربما يفسر ذلك قدرتهم على ملاحظة أدق التغيرات في مزاج أو تعبيرات الآخرين. وبفضل حساسيتهم تجاه مشاعر واحتياجات الآخرين، يمكنهم الاستفادة الكاملة من طبيعتهم العطوفة والمراعية.

الحماسعندما يستحوذ شيء ما على خيالهم ويُلهمهم، يرغب ENFP في مشاركته مع أي شخص يرغب في الاستماع. كما أنهم متحمسون لسماع أفكار وآراء الآخرين – حتى لو كانت هذه الأفكار مختلفة تمامًا عن آرائهم الخاصة.

مهارات تواصل استثنائيةيمتلئ الأشخاص من نوع ENFP بالكثير مما يريدون قوله، لكنهم أيضًا مستمعون جيدون. يمنحهم هذا قدرة شبه فريدة على إجراء محادثات إيجابية وممتعة مع جميع أنواع الأشخاص – حتى أولئك الذين ليسوا اجتماعيين أو متفقين بشكل خاص.

سهولة التعاملعلى الرغم من أنهم يعيشون من أجل المحادثات العميقة والهادفة، يمكن لـ ENFP أن يكونوا تلقائيين ومرحّين. فهم يعرفون كيف يجدون المتعة والفرح في اللحظة الحالية – ولا يوجد ما يسعدهم أكثر من مشاركة هذا الفرح مع الآخرين.

طيبة القلب والإيجابيةكل هذه الصفات تجتمع لتشكل شخصًا دافئ القلب وسهل الاقتراب منه، يتمتع بروح إيثارية وودودة. يسعى ENFP للانسجام مع الجميع تقريبًا، وغالبًا ما تمتد دائرة معارفهم وأصدقائهم لتشمل العديد من الأشخاص.'''),
          TabsCloumn(
              text1: 'نقاط الضعف',
              text2:
                  '''إرضاء الآخرينغالبًا ما يشعر الأشخاص من نوع ENFP بعدم الارتياح عند احتمال أن يكونوا غير محبوبين. وللحفاظ على السلام، قد يقدمون تنازلات بشأن أمور مهمة لهم أو يسمحون للآخرين بمعاملتهم بشكل سيئ. وعندما يفشلون في كسب شخص ما، قد يجدون أنفسهم يعانون من الأرق وهم يحاولون التفكير فيما يمكنهم فعله لحل المشكلة.

عدم التركيزإثارة مشروع جديد – خاصة إذا كان يتضمن التعاون مع الآخرين – يمكن أن تستخرج أفضل ما في هذه الشخصيات. ولكن، نظرًا لتنوع اهتماماتهم المتغير باستمرار، قد يجدون صعوبة في الحفاظ على الانضباط والتركيز على المدى الطويل.

الفوضىيركز ENFP بشكل كبير على الصورة الكبيرة ويحبون استكشاف الأفكار والخبرات الجديدة، مما قد يؤدي أحيانًا إلى إهمالهم الجوانب العملية اليومية. على وجه الخصوص، قد يتجنبون المهام الروتينية التي يرونها مملة مثل الأعمال المنزلية أو الصيانة الأساسية أو الأعمال الورقية. هذا الإهمال يمكن أن يؤدي إلى إحساس بالفوضى ويصبح مصدرًا رئيسيًا للتوتر في حياتهم.

الإفراط في التكيّف مع الآخرينيشعر ENFP بدافع قوي لرفع معنويات الآخرين، وقد يجدون أنفسهم يقولون "نعم" كلما طلب منهم أحد المساعدة أو التوجيه. ولكن إذا لم يضعوا حدودًا، حتى أكثرهم نشاطًا قد يصبح مرهقًا بسبب كثرة الالتزامات، مع وقت وطاقة غير كافيين لتلبية احتياجات حياتهم الخاصة.

التفاؤل المفرطيمكن أن يكون التفاؤل أحد نقاط القوة الأساسية لشخصية ENFP. ولكن، قد يدفعهم منظورهم الوردي إلى اتخاذ قرارات حسنة النية ولكن ساذجة، مثل الوثوق بأشخاص لم يثبتوا جدارتهم بذلك. هذا الجانب يمكن أيضًا أن يجعل من الصعب عليهم تقبل الحقائق الصعبة ولكن الضرورية – ومشاركتها مع الآخرين.

عدم الاستقراررغم موقفهم الإيجابي والمتفائل، نادرًا ما يظهر ENFP انزعاجًا أو عدم رضا على السطح. ولكن، يمكن أن تتركهم مثاليتهم الداخلية بشعور مستمر بأن بعض الجوانب الرئيسية في حياتهم ليست كافية – سواء كان ذلك في العمل، حياتهم المنزلية، أو علاقاتهم.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'الصداقات',
              text2:
                  '''بفضل حيويتهم الطبيعية، يتمتع الأشخاص من نوع شخصية ENFP (الحملات) بقدرة فائقة على التواصل الاجتماعي بسهولة. فهم غالبًا ما يكونون قادرين على تكوين صداقات أينما ذهبوا، مستخدمين سحرهم ومهاراتهم الممتازة في التواصل لجذب دائرة اجتماعية متنوعة ومثيرة للاهتمام – وهو شيء يفتخرون به كثيرًا.

كأصدقاء، يكون الأشخاص من نوع ENFP داعمين ومُحفّزين. فهم دائمًا على استعداد للانخراط في محادثة مرحة أو مناقشة عميقة ومفعمة بالمشاعر حول أي موضوع. وعلاوة على ذلك، يتميزون بقدرتهم على جعل أصدقائهم يشعرون بأنهم مُقدّرون ومُعترف بهم.

كرماء وأصليون، يتمتع ENFP بالكثير ليقدموه في مجال الصداقة. ولكن، قد يواجهون أحيانًا صعوبة مع الشعور بأنهم يهتمون بأصدقائهم أكثر مما يهتم أصدقاؤهم بهم – وهو شعور قد يجعل هؤلاء الأشخاص الاجتماعيين والدافئين يشعرون بالوحدة إلى حد ما.'''),
          TabsCloumn(
              text1: 'مغامرة الصداقة',
              text2:
                  '''بفضل خيالهم وروحهم المتفائلة، يعرف الأشخاص من نوع ENFP كيف يحولون حتى أكثر اللحظات العادية إلى مناسبة خاصة. وبالنسبة لهؤلاء الشخصيات، يُعتبر أي وقت يُقضى مع الأصدقاء فرصة مميزة. ENFP يقدرون أصدقائهم، ويحرصون على عدم تفويت أي لحظة معهم دون تقديرها.

وكما هو متوقع، فإن الطاقة الاجتماعية لـ ENFP يمكن أن تكون مغناطيسًا لأنواع الشخصيات الأخرى المنفتحة. لكن دفئهم وإخلاصهم يجذب أيضًا أنواعًا مختلفة من الأشخاص الذين قد يكونون أكثر خجلًا أو تحفظًا.
وبما أنهم ينجذبون إلى العمق والتعقيد، يجد الأشخاص من هذا النوع متعة كبيرة في رؤية شخص ما ينفتح تدريجيًا ويعبر عن أفكاره ومشاعره العميقة. وبفضل مزيجهم الفريد من الحساسية والحماس، يمكن لشخصيات ENFP أن تجعل أصدقاءهم الأكثر هدوءًا يشعرون بالفهم والقبول – بل وحتى بالحماس.'''),
          TabsCloumn(
              text1: 'غوص في العمق',
              text2:
                  '''من الخارج، قد يبدو أن الصداقة تأتي بسهولة للأشخاص من نوع ENFP – وفي بعض النواحي، هذا صحيح. لكن ذلك لا يعني أن ENFP يختبرون دائمًا العلاقات العميقة والهادفة التي يتوقون إليها.

بعض الأشخاص ببساطة لا يرغبون في الانفتاح العاطفي بالطريقة التي يتوق إليها ENFP. آخرون قد يكونون منغلقين أو متحفظين بأشكال لا تتماشى مع قيمهم. بالنسبة لـ ENFP، قد يبدو أحيانًا كما لو أن بقية العالم راضٍ عن العلاقات السطحية والعرضية. في مثل هذه اللحظات، لا يستطيعون منع أنفسهم من التساؤل عما إذا كان شوقهم العميق للاتصال الإنساني يفوق قدرة الآخرين على استيعابه.

يمكن أن تسبب المثالية مشاكل حتى داخل أقرب علاقات الصداقة. يشتهر الأشخاص من نوع ENFP ببذل جهود كبيرة ليكونوا عطوفين ومساعدين. فهم يفخرون بسخائهم اللامحدود عندما يتعلق الأمر بوقتهم، طاقتهم، أموالهم، اهتمامهم، ومشاعرهم.
لكن في بعض الأحيان، قد يقدم ENFP الكثير في صداقاتهم لدرجة أنهم يهملون تلبية احتياجاتهم الخاصة. ولسوء الحظ، حتى بين أعز الأصدقاء، يمكن أن يؤدي هذا النوع من التوازن غير المتكافئ إلى شعور بالإحباط وسوء الفهم.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'مقدمة تعريفية',
              text2:
                  '''لأشخاص من نوع شخصية ENFP (المعروفين بـ"المسوقين") هم أرواح حرة حقيقية – منفتحون، وذوو قلوب كبيرة، وعقول متفتحة.بفضل نهجهم النابض بالحيوية والتفاؤل في الحياة، يبرز الأشخاص من نوع ENFP في أي تجمع.
ولكن على الرغم من قدرتهم على أن يكونوا روح الحفلة، فإنهم لا يهتمون فقط بالاستمتاع بوقتهم.تمتلك هذه الشخصيات أعماقًا عاطفية عميقة تُغذيها رغبتهم الشديدة في بناء روابط عاطفية ومعنوية ذات مغزى مع الآخرين.'''),
          TabsCloumn(
              text1: 'سحر الحياة اليومية',
              text2:
                  '''يحمل الأشخاص من نوع شخصية ENFP مزيجًا فريدًا من الاجتماعية العفوية، والخيال المتألق، والتأمل العميق.يستخدمون فضولهم الطبيعي وإبداعهم الواسع بانتظام لفهم أنفسهم بشكل أفضل وفهم ديناميكيات العلاقات الإنسانية المعقدة.
وهم ملتزمون بشدة بتنمية علاقاتهم مع العالم وفهمه بشكل أعمق.
بطريقتهم الفريدة، يتم دفع طبيعتهم التأملية من خلال خيالهم وشعورهم بالدهشة وإيمانهم بالأشياء التي لا يمكن دائمًا تفسيرها منطقيًا.يؤمن الأشخاص من نوع ENFP حقًا بأن كل شيء – وكل شخص – مترابط، ويعيشون من أجل تلك اللمحات من البصيرة التي يمكنهم اكتسابها من هذه الروابط.ويعتقدون أن كيفية تعاملنا مع بعضنا البعض لها أهمية حقيقية. في الواقع، يُعدّ الأشخاص من نوع ENFP الأكثر احتمالًا للإيمان بمفهوم الكارما.'''),
          TabsCloumn(
              text1: 'التعبير عن حقيقتهم',
              text2:
                  '''الأشخاص من نوع شخصية ENFP يمثلون دليلًا حيًا على أن البحث عن متع الحياة وأفراحها لا يعني السطحية.في غمضة عين، يمكن أن يتحولوا من مثاليين متحمسين إلى أشخاص مستمتعين على حلبة الرقص.ومع ذلك، حتى في لحظات المرح، يسعون للاتصال العاطفي مع الآخرين.لا شيء تقريبًا يهمهم أكثر من إجراء محادثات صادقة ومفعمة بالمشاعر مع أحبائهم.يؤمنون بأن كل شخص يستحق التعبير عن مشاعره، وتساعد دفئهم وتعاطفهم في خلق مساحات يشعر فيها حتى أكثر الأشخاص خجلًا بالراحة للانفتاح.
رغم ذلك، يجب أن يكونوا حذرين.قد تقودهم حدسهم أحيانًا إلى تفسير مبالغ فيه لتصرفات وسلوكيات الآخرين.بدلًا من طلب تفسير واضح، قد ينغمسون في التفكير المفرط بشأن نوايا أو رغبات الآخرين.
هذا النوع من التوتر الاجتماعي هو ما يجعل الأشخاص من نوع ENFP يقظين في الليل، خاصةً عندما يكونون موجهين نحو تحقيق الانسجام.
يقضي هؤلاء الأشخاص وقتًا طويلًا في استكشاف العلاقات المختلفة، والمشاعر، والأفكار، قبل أن يجدوا طريقًا يناسب حياتهم.ولكن بمجرد أن يجدوا هذا الطريق، فإن خيالهم وتعاطفهم وشجاعتهم يمكن أن تضيف إشراقًا لحياتهم وحياة من حولهم.
'''),
        ]),
      ])
    ]);
  }
}
