import 'package:flutter/material.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Info_Patterns.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Tab_Patterns.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Tabs_Column.dart';
import 'package:gradution_project/View/features/EachPatternInfo/patterns_structure.dart';
import 'package:gradution_project/View/features/EachPatternInfo/tabslistview.dart';

class Entj extends StatelessWidget {
  const Entj({super.key});

  @override
  Widget build(BuildContext context) {
    return const PatternsStructure(childs: [
      InfoPatterns(
        text1: 'ENTJ',
        text2: 'قائد',
        text3: '''هؤلاء الأشخاص قادة بالفطرة. الأشخاص الذين يتمتعون بهذا النوع من الشخصية يجسدون الكاريزما والثقة والسلطة، ويستطيعون توجيه الحشود معًاً وراء هدف مشترك. ولكن خلافًاً لنظرائهم من المركزين على المبادئ، فإن شخصيات القادة تمتاز بمستوى قاسٍ من العقلانية، مستخدمين ما لديهم من دوافع شخصية وتصميم وعقول حادة لتحقيق النهاية التي وضعوها لأنفسهم مهما كانت.''',
        image: 'assets/entj2.png',
      ),
      TabPatterns(tabchilds: [
        TabsListView(childs: [
          TabsCloumn(text1: 'عادات مكان العمل',
           text2: '''بالنسبة للأشخاص من نوع شخصية ENTJ (القادة)، مكان العمل هو بيئتهم الطبيعية. تُقدَّر كفاءتهم وقدرتهم على التواصل الواضح، ويُعجَب بقيادتهم، كما أن قدرتهم على إنجاز الأمور لا تضاهى. ومع ذلك، هناك مواقف تكون أكثر ملاءمة لهذه الشخصيات الجريئة من غيرها، حيث يفضلون التمتع بالحرية لإنجاز أعمالهم بالطريقة التي يجدونها منطقية دون أن يتم التدخل في التفاصيل الدقيقة.
هذا التفضيل يجعل العمل في المناصب الدنيا التي تفتقر إلى الاستقلالية الشخصية تحديًا كبيرًا لهم.'''),
            TabsCloumn(text1: 'الموظفون من نوع شخصية ENTJ',
           text2: '''قد تكون المناصب التابعة تحديًا لشخصيات ENTJ، ويتطلب الأمر إدارة فعالة لضمان رضاهم ومشاركتهم. باعتبارهم من أصحاب الطموح العالي، يسعى أفراد ENTJ إلى تعلم مهارات جديدة ومواجهة تحديات ومسؤوليات جديدة، متحمسين لإثبات أن لا شيء مستحيل مع قليل من العمل الجاد. إذا أصبحت الأمور بطيئة، فقد يبادرون بخلق العمل أو إجراء تغييرات غير ضرورية، ولكن عندما يشعرون بأنهم مشاركون في المشاريع من حولهم، يثبتون أنهم منظمون بشكل جيد وقادرون على تحديد الأولويات بفعالية.

يضع أفراد شخصية ENTJ معايير عالية لأنفسهم، ولكن الكثير مما يشكل هذا النهج يعتمد على ردود الفعل من بيئتهم، وبالتحديد الانتقادات من مديريهم. التصريحات الموضوعية والعقلانية حول ما يتم إنجازه بشكل صحيح وما يمكن تحسينه تكون مفيدة لهذا النوع الموجه نحو التعلم. وعلى العكس من أن يشعروا بالاستياء من تلك الانتقادات، فإنهم يقدرونها. إن الفرص المتاحة للنمو تبقي شخصيات ENTJ متحمسة ومنتجة، وطالما أن مديريهم يدركون أن هذا هو دورهم الأساسي، فمن المرجح أن تكون العلاقة مثمرة ومرضية للغاية.'''),
            TabsCloumn(text1: 'مديرين ENTJ',
           text2: '''مديرو ENTJ يتمتعون بالثقة والكاريزما في التواصل، ويركزون على رؤية واحدة: إنجاز العمل بأعلى مستوى من الكفاءة والجودة. كل شيء آخر يأتي في المرتبة الثانية لتحقيق هذا الهدف. وبفضل ذكائهم الفطري، يمتلك أفراد شخصية ENTJ قدرة طبيعية على تحديد نقاط القوة لكل عضو في فريقهم ودمج تلك المهارات في خططهم بحيث يلعب كل فرد دورًا فريدًا ومهمًا.

تساهم هذه الجهود غالبًا في تعزيز الروح المعنوية والرضا بين المرؤوسين ذوي التفكير المماثل. ومع ذلك، فإنها تظل مصممة لتحقيق الهدف النهائي، وهو إنجاز العمل بكفاءة استثنائية وفي الوقت المحدد. أما من يعتبرهم مدراء ENTJ غير كفؤين أو يظهرون الكسل أو يقدمون عملاً رديئًا، فسيتم إبلاغهم بشكل واضح بعدم رضاهم.

ومع ذلك، فإن هذه الشخصيات المخلصة لا تستسلم بسهولة على أي من أعضاء فريقها. سيعملون بلا كلل لضمان نجاح الجميع في مسؤولياتهم، حتى لو تطلب الأمر بذل المزيد من الجهد والوقت لحل أي مشكلة تواجه الفريق.
'''),
        ]),

        TabsListView(childs: [
           TabsCloumn(text1: 'مسارات الحياة المهنية',
           text2: '''يبرز أصحاب شخصية ENTJ (القادة) بشكل لافت في عالم الوظائف والمهن. هنا، تتجلى شجاعتهم ودافعيتهم بأفضل صورها. لا توجد أي شخصية أخرى تستمتع بالسعي الدؤوب وتسلق سلم النجاح المهني مثلهم. يتميزون بمستوى لا يُضاهى من التصميم الذاتي، حيث يجمعون بين رؤيتهم وذكائهم وإرادتهم القوية لدفع الأفكار نحو التنفيذ بغض النظر عن العقبات. شخصيات ENTJ قوة لا يُستهان بها.'''),
            TabsCloumn(text1: 'دعوة للاستكشاف',
           text2: '''في عالم الأعمال، يتحول مستوى الثقة بالنفس المرتفع الذي قد يساء استخدامه أحيانًا في العلاقات الشخصية إلى سلطة جديرة بالإعجاب. يبرع أصحاب شخصية ENTJ في إبقاء الأمور على المسار الصحيح وإنجاز المهام. بطبيعة الحال، فإن الوظائف التي تجذب هذه الشخصيات الطموحة هي تلك التي تستفيد بالكامل من هذه الصفات. أي منصب يسمح لهم برؤية الأفق بوضوح، مثل المناصب التنفيذية أو الأعمال الريادية، يمثل مجالاً مثاليًا لهم.

النظام والترتيب هما المفتاح، وإذا أظهر أي شخص إهمالًا أو تسبب في إعاقة الأمور بسبب عدم الكفاءة أو الكسل أو عدم الفاعلية، فقد يتعامل هؤلاء القادة مع الوضع بحزم. يلاحق ENTJ أهدافهم برؤية متفردة ويضعون معايير صارمة لأنفسهم وللآخرين مصممة لتكون فعّالة في المقام الأول. هذا يجعلهم استراتيجيين ممتازين في الشركات، ووضوحهم وموضوعيتهم تجعلهم محامين وقضاة يحظون بالاحترام.

لن يتحقق أي من ذلك إذا لم يتمكن الآخرون من فهم أفكارهم. لحسن الحظ، غالبًا ما يكون لدى شخصيات ENTJ قدرة على التواصل بوضوح وإيجاز، خاصة وجهًا لوجه، مما يجعل إدارة الأعمال ملائمة لهم – طالما أن المهام لا تتجه بعيدًا نحو الصيانة الروتينية. كما أن لديهم تعطشًا للمعرفة ولا يخشون استخدام مبدأ بمجرد فهمهم لآلياته الأساسية. بفضل هذا المزيج مع قيادتهم، يصبحون أساتذة جامعيين مرهقين ولكن فعّالين.'''),
            TabsCloumn(text1: 'توقعات كبيرة',
           text2: '''المشكلة الوحيدة هي أن مهاراتهم تحتاج وقتًا ليتم الاعتراف بها، والبقاء في وظائف منخفضة المستوى يجعلهم يشعرون بالإحباط العميق. شخصيات ENTJ تتوق إلى المسؤولية، والنمو، والفرص، ويستمتعون حقًا بإدارة الآخرين لإنجاز المهام. هؤلاء الأشخاص هم رؤيويون وقادة، وليسوا مجرد موظفين عاديين أو إداريين يوميين – على الأقل من وجهة نظرهم.
الحصول على هذا الاعتراف ليس دائمًا أمرًا سهلاً، ولكنهم بالتأكيد على استعداد لمواجهة التحدي.'''),
        ]),

        TabsListView(childs: [
           TabsCloumn(text1: 'الأبوة',
           text2: '''كآباء، يتميز أغلب أصحاب شخصية ENTJ (القادة) بمهارة فائقة في اكتشاف المواهب الكامنة لدى أطفالهم ورعاية هذه القدرات. لكن عليهم أحيانًا التخفيف من نهجهم الحازم والمفرط في المنطقية في الحياة، لإفساح المجال لاحتياجات ومشاعر أطفالهم أثناء مساعدتهم على النمو. وهذا يعني ببساطة أن علاقاتهم مع الأطفال، الذين غالبًا ما يكونون أكثر حساسية وأقل قدرة على إجراء تحليل عقلاني حقيقي، تتطلب منهم التعامل بمزيد من اللباقة العاطفية وإعطاء مساحة أكبر من الحرية الشخصية مقارنة بما اعتادوا عليه.

ومع ذلك، فإن هذه الشخصيات الحازمة دائمًا على استعداد لمواجهة التحديات. يأخذ ENTJs أدوارهم كآباء بجدية ويؤدون المهمة بأقصى قدر من الإحساس بالمسؤولية الشخصية. وبتطبيقهم معايير عالية على أنفسهم تفوق المعتاد، يرى الآباء من نوع ENTJ نجاح أطفالهم انعكاسًا لتلك المعايير الشخصية. إنهم لا يريدون شيئًا أكثر من رؤية أطفالهم ينمون ليصبحوا أشخاصًا أذكياء ومستقلين يسعون لتحقيق أهدافهم. بالنسبة لهم، فإن غرس القيم الأخلاقية المحددة أقل أهمية من تنمية الفكر المستقل والتفكير العقلاني.'''),
            TabsCloumn(text1: 'بناء التسامح العاطفي',
           text2: '''تُرحب شخصيات ENTJ بالاختلافات في الرأي، وينطبق هذا على أطفالهم أيضًا. وعلى الرغم من أنهم يرحبون بالمناقشات المنطقية المدروسة، فإنهم يتوقعون في نهاية المطاف احترام سلطتهم. بالنسبة لهم، فإن الاختلاف في الرأي لا يُبرر التغاضي عن المسؤوليات المُحددة مسبقًا. يمكن أن يكون آباء ENTJ غير متساهلين في الحفاظ على النظام والانضباط. وفي بعض الأحيان، قد تكون هذه الصرامة مصدرًا للتوتر داخل الأسرة. لذا، سيكون من المفيد لهؤلاء الآباء تذكر أن قليلًا من المرونة يمكن أن يُحدث فرقًا كبيرًا.

ومع ذلك، فإن المشكلة الحقيقية التي قد يواجهها آباء ENTJ تظهر عندما تتحول النقاشات مع أطفالهم إلى استئنافات عاطفية. ضعفهم في تحمل العواطف يجعل التعامل مع الأطفال الذين ينمون تحديًا كبيرًا. على هؤلاء الأشخاص أن يسعوا لتقوية هذه المهارة، حيث إن الأطفال الصغار لا يملكون الكلمات للتعبير عن احتياجاتهم بطريقة منطقية، والمراهقون غالبًا ما يفتقرون إلى الصبر على ذلك.'''),
            TabsCloumn(text1: 'تعزيز الإستقلالية',
           text2: '''يمكن لهؤلاء الآباء أن يتذكروا أن جزءًا من تطوير الإحساس اللازم بالاستقلالية يكمن في تمكين أبنائهم من رسم مسارهم الخاص. يستطيع الأشخاص الناضجون من شخصيات ENTJ أن يأخذوا نفسًا عميقًا ويكيفوا نظمهم مع نمو أطفالهم. غالبًا ما يساعد هذا التكيف أطفالهم على تجاوز الأنشطة المخصصة لهم والانتقال إلى الهدف الأطول مدى: أن يصبحوا شبابًا أذكياء وقادرين على توجيه أنفسهم بأنفسهم.'''),
        ]),

        TabsListView(childs: [
           TabsCloumn(text1: 'العلاقات الرومانسية',
           text2: '''أصحاب شخصية ENTJ (القادة) يميلون إلى التعامل مع المواعدة والعلاقات بطريقة مدروسة ومنظمة، حيث يضعون أهدافًا واضحة وخطة لتحقيقها، ويتابعون ذلك بحماس وطاقة ملفتين للنظر. تعتبر هذه الشخصية العلاقات مسعىً يستحق الجهد، وهي على استعداد لتولي أدوار قيادية فيها منذ البداية، مع تحمل المسؤولية الشخصية عن مدى نجاح العلاقة، والعمل بنشاط لضمان تجربة متبادلة ومجزية للطرفين. العلاقات الرومانسية بالنسبة لهم أمر جدي، وENTJs يركزون على بناء علاقات طويلة الأمد.'''),
            TabsCloumn(text1: 'تولي القيادة',
           text2: '''يعني هذا الإحساس بالمسؤولية الشخصية أن أصحاب شخصية ENTJ يبذلون الكثير من الطاقة في علاقاتهم، ويظهرون إبداعهم من خلال الحرص على تقديم أفكار جديدة باستمرار لإبقاء الأمور مثيرة للاهتمام، خاصةً خلال مرحلة المواعدة. ومع ذلك، يركز ENTJs أيضًا على المدى البعيد، وإذا قرروا أن العلاقة تسير نحو طريق مسدود، فقد ينهونها بسهولة شديدة وبسرعة، مما قد يبدو لشريكهم وكأنه نهاية مفاجئة للاهتمام الذي كانوا يتلقونه.

هذا النهج الحاسم أحيانًا في العلاقات الشخصية يُعد نقطة ضعف رئيسية لدى ENTJs. وإذا لم يكونوا حذرين، فقد يكتسبون سمعة سيئة بسبب ذلك. الإحساس بمشاعر الآخرين لن يكون مهارة مريحة لهم على الإطلاق، لكن من الضروري أن يعملوا بوعي على تطويرها، لصالح شريكهم ولصالح تعبيرهم الصحي عن مشاعرهم. وإذا لم يفعلوا ذلك، فإنهم يخاطرون بالسيطرة المفرطة على شريكهم وتجاهل مشاعره، مما قد يؤدي بسهولة إلى انهيار العلاقة، خاصة في مراحلها المبكرة.'''),
            TabsCloumn(text1: 'حب بجرأة',
           text2: '''إذا سارت الأمور بشكل جيد خلال مرحلة المواعدة وتم اعتبار المستقبل مشرقًا، فإن أصحاب شخصية ENTJ يواصلون إبهار شريكهم بإبداعهم وطاقتهم. فهم معروفون بقدرتهم على إبراز أفضل ما في شريكهم، ودفعهم لتحقيق أحلامهم وطموحاتهم. وغالبًا ما يغذي طموحهم طموحات شريكهم أيضًا، مما يخلق ديناميكية ثنائية قوية.

نظرًا لكونهم شديدي التركيز على النمو، يحب ENTJs أيضًا التحسن والتطور في علاقاتهم. يميلون إلى الاستماع إلى انتقادات شريكهم والتصرف بناءً عليها، طالما كانت منطقية، ويسعون دائمًا ليصبحوا أفضل نسخة من أنفسهم – لصالحهم ولصالح شريكهم. قد يكون من المفاجئ لهذه الشخصيات – وربما نبأ سيئًا لعلاقتهم – إذا لم يشارك شريكهم هذا الشغف بالنمو.
مع ذلك، يجدر بأصحاب شخصية ENTJ أن يتذكروا أن أسلوبهم هو مجرد زاوية واحدة ضمن طيف متنوع من البدائل. وبينما قد يرون النقد كأكثر الطرق كفاءة (وغالبًا ما يكونون على حق)، ينبغي عليهم أن يأخذوا في الاعتبار أن شريكهم قد يكون أكثر اهتمامًا بنوع من الدعم العاطفي للنمو، وهو مجال من مجالات التطوير الشخصي الذي يميل ENTJs إلى تجنبه بشكل كبير.'''),
        ]),

        TabsListView(childs: [
              TabsCloumn(text1: 'نقاط القوة', 
              text2: '''فعّالون
يرى أصحاب شخصية ENTJ (القادة) أن عدم الكفاءة ليس مجرد مشكلة بحد ذاتها، بل هو عقبة تسحب الوقت والطاقة بعيدًا عن جميع أهدافهم المستقبلية. بالنسبة لهم، عدم الكفاءة هو بمثابة تخريب معقد يتألف من اللاعقلانية والكسل، ويسعون للقضاء على هذا السلوك أينما وجدوه.

مفعمون بالطاقة
يتعامل أصحاب شخصية ENTJ مع مسؤولياتهم بحيوية ودافعية. لا يتهربون من الجداول المزدحمة أو التحديات المعقدة. في الواقع، كلما أنجزوا المزيد خلال اليوم، شعروا بمزيد من النشاط، وينقلون هذا الحماس الإنتاجي المعدي إلى من حولهم.
واثقون بأنفسهم – يعبر ENTJs عن آرائهم بثقة، ويثقون في قدراتهم على إنجاز المهام، ويؤمنون بقدراتهم كقادة. هم من أكثر الشخصيات التي تشعر بالثقة في مواجهة تحديات الحياة اليومية.

أصحاب إرادة قوية
لا يستسلم أصحاب شخصية ENTJ عندما تصبح الأمور صعبة. بل يواصلون السعي بلا هوادة لتحقيق أهدافهم. لا شيء يُشبع رغبتهم أكثر من تحقيق شيء عزموا عليه.
مفكرون استراتيجيون
يتميز ENTJs بفهم الفرق بين إدارة الأزمات اللحظية والتنقل بين تحديات وخطوات خطة أكبر. يُعرفون بفحص كل زاوية من زوايا المشكلة، ليس فقط لحل القضايا اللحظية، بل لتحريك المشروع بأكمله للأمام بحلولهم.
كاريزميون وملهمون
جميع هذه النقاط القوية المذكورة أعلاه تتكامل لتكوين أفراد قادرين على إلهام وتحفيز الآخرين. وهذا بدوره يساعد ENTJs على تحقيق أهدافهم الأكثر طموحًا، والتي لم يكن من الممكن إنجازها وحدهم.'''),
               TabsCloumn(text1: 'نقاط الضعف', 
              text2: '''عنيدون ومسيطرون
أحيانًا يمكن أن تذهب هذه الثقة القوية والإرادة إلى حد مفرط. شخصية ENTJ قادرة تمامًا على التمسك بمواقفها، محاولة الفوز بكل نقاش، والسعي فقط لتحقيق رؤيتها دون أخذ آراء الآخرين بعين الاعتبار.

غير متسامحين
"إما طريقتي أو لا شيء" – يتميز أصحاب شخصية ENTJ بعدم دعمهم للأفكار التي تشتت الانتباه عن أهدافهم الرئيسية، وبالأخص الأفكار المبنية على اعتبارات عاطفية. ولا يترددون في جعل هذا الموقف واضحًا لمن حولهم.

غير صبورين
بعض الأشخاص يحتاجون إلى وقت أطول للتفكير مقارنةً بالآخرين، وهو ما يعتبره ENTJ تأخيرًا لا يُطاق. قد يُفسرون التمهل على أنه غباء أو عدم اهتمام في عجلتهم، وهو خطأ فادح.

متغطرسون
يحترم ENTJs التفكير السريع والقناعات القوية، وقد ينظرون باستخفاف إلى من لا يتوافقون مع هذه المعايير. يمثل هذا تحديًا لمعظم الشخصيات الأخرى، الذين قد لا يكونون خجولين بحد ذاتهم، لكنهم سيبدون كذلك بجانب هذا النوع المتسلط أحيانًا.

ضعف في التعامل مع المشاعر
في بعض الأحيان، قد تكون شخصية ENTJ بعيدة عن التعبير عن مشاعرها، وأحيانًا تكون مستهينة بمشاعر الآخرين. وغالبًا ما يدهسون مشاعر الشركاء والأصدقاء عن غير قصد، خاصةً في المواقف المشحونة بالعواطف.

باردون وعديمو الرحمة
هوسهم بالكفاءة وإيمانهم الراسخ بفضائل العقلانية، خاصةً في العمل، يجعلهم غير حساسين أثناء السعي لتحقيق أهدافهم. فهم يتجاهلون الظروف الشخصية والحساسيات والتفضيلات، ويعتبرونها غير عقلانية أو غير ذات صلة.'''),
        ]),

        TabsListView(childs: [
           TabsCloumn(text1: 'الصداقات', 
              text2: '''في الصداقة، يسعى الأشخاص من نوع شخصية ENTJ (القادة) إلى تحقيق النمو الشخصي والإلهام، وغالبًا ما يكون لديهم خطة لكيفية تحقيق ذلك. الصداقات التي تعتمد على الظروف، مثل الروتين المشترك، ليست الطريقة المفضلة لهذا النوع من الشخصيات. يفضل ENTJs البحث عن أفراد يشاركونهم شغفهم بالنقاشات العميقة ذات المعنى، والذين يستمتعون بالتعلم والتطور بقدر ما يفعلون.
قد لا يكون من السهل أن تكون صديقًا لـ ENTJs، حيث يطلبون الكثير من هذه العلاقات. لكنهم يولون اهتمامًا كبيرًا لصداقاتهم، ويعملون بجد لضمان أن تكون مُرضية وملهمة، والأهم من ذلك، وسيلة لتحسين الذات المتبادل.'''),
               TabsCloumn(text1: 'دائمًا مستعد للتحدي', 
              text2: '''تُبنى صداقات الأشخاص الذين يتمتعون بنمط الشخصية ENTJ (القادة) على الأفكار والاحترام. لذلك، فإن الكثير مما يجدونه ممتعًا هو تبادل الأفكار والدفاع عنها ضد النقد من جميع الزوايا. يقدّر الأشخاص من هذا النوع الذكاء ويتميزون بكونهم ناقدين للغاية. لا يتراجعون عند وضعهم في موقف دفاعي – في الواقع، لا توجد طريقة أفضل لكسب إعجابهم.

يمكن لأنواع مختلفة من الأشخاص تكوين صداقات قوية مع هؤلاء الشخصيات الجريئة، على الرغم من أن الأنواع الأكثر حساسية قد تجد صعوبة أحيانًا إذا ركّز صديقهم من نوع ENTJ كثيرًا على ما هو منطقي بدلًا من محاولة فهم مشاعرهم. يعدّ نقص الحساسية هذا من أكبر نقاط الضعف في شخصياتهم.

يميل ENTJ إلى تحدي أصدقائهم، والتشكيك في استنتاجاتهم، ورفض الحجج العاطفية باعتبارها غير ذات صلة، مما قد يزعج البعض أحيانًا. ومع ذلك، بمجرد أن تُلفت مشكلات كهذه إلى انتباههم، يصبح الأشخاص من هذا النوع فضوليين للغاية ومنفتحين على محاولة فهم المنظورات العاطفية للآخرين.'''),
               TabsCloumn(text1: 'سد الفجوة', 
              text2: '''ENTJs الذين يتمتعون بمزيد من الوعي يدركون أن هناك مجالاً كبيرًا للتعلم وتحسين الذات في ما يتعلق بالحساسية العاطفية – وإنكار أي جانب من جوانب النمو الشخصي يُعتبر أقرب إلى النفاق. ومع ذلك، فإن معظم أصدقائهم من المحتمل أن يشاركوهم شغفهم بالأفكار المنطقية والطموحة والنقاشات النقدية.
أي شخص يمكنه مجاراة قدرة ENTJs على التفكير الإبداعي ووضع النظريات سيجد صديقًا صادقًا ومخلصًا. أما من لا يستطيع أو لا يرغب، كما هو الحال مع العديد من الشخصيات الأكثر ارتباطًا بالواقع التي غالبًا ما تشكك في جدوى مثل هذه النقاشات، فقد يجد نفسه أمام تحدٍ لاستكشاف طرق جديدة في التفكير – وربما يكون هذا وضعًا يمكن لجميع الأطراف أن تتعلم منه.'''),
        ]),
        
        TabsListView(childs: [
           TabsCloumn(text1: 'مقدمة تعريفية', 
              text2: '''الأشخاص الذين يتمتعون بشخصية ENTJ (القادة) هم قادة بالفطرة. فهم يمتلكون هبات الكاريزما والثقة بالنفس، مما يمكنهم من فرض سلطتهم بطريقة تجمع الناس حول هدف مشترك.
ومع ذلك، تتميز هذه الشخصيات أيضًا بمستوى عالٍ من العقلانية الحادة، حيث يستخدمون دوافعهم وعزيمتهم وذكاءهم الحاد لتحقيق أي أهداف يضعونها لأنفسهم.

قد تكون شدة شخصيتهم أحيانًا مصدر إزعاج للآخرين، لكن في النهاية، يشعر أصحاب شخصية ENTJ بالفخر بأخلاقياتهم في العمل ومستوى الانضباط الذاتي المذهل لديهم.'''),
               TabsCloumn(text1: 'السعي نحو العظمة', 
              text2: '''إذا كان هناك شيء يحبه الأشخاص من نوع شخصية ENTJ، فهو التحديات، سواء كانت كبيرة أو صغيرة. فهم يؤمنون بشدة أنه مع الوقت والموارد الكافية، يمكنهم تحقيق أي هدف. هذه السمة تجعل منهم رواد أعمال بارعين، كما أن قدرتهم على التفكير الاستراتيجي والحفاظ على التركيز طويل المدى مع تنفيذ كل خطوة من خططهم بعزم ودقة تجعلهم قادة أعمال أقوياء.

غالباً ما تكون عزيمتهم بمثابة نبوءة تتحقق ذاتياً، حيث يدفع أصحاب شخصية ENTJ أهدافهم إلى الأمام بقوة إرادتهم المطلقة في الوقت الذي قد يتخلى فيه الآخرون ويمضون قدماً، ومن المرجح أن يدفعوا الجميع من حولهم لتحقيق نتائج مذهلة في هذه العملية.

على طاولة المفاوضات، سواء كان ذلك في بيئة عمل أو أثناء شراء سيارة، يكون أصحاب شخصية ENTJ مهيمنين، لا يلينون، ولا يتراجعون. وليس ذلك لأنهم قساة أو شرسون بالضرورة، بل لأنهم يستمتعون بالتحدي، ومعركة العقول، والحوار الذكي الذي يميز مثل هذه البيئة. وإذا لم يتمكن الطرف الآخر من مجاراتهم، فهذا ليس سبباً يدفعهم للتنازل عن مبدأهم الأساسي: تحقيق النصر النهائي.'''),
               TabsCloumn(text1: 'التحديات الأكبر دائمًا', 
              text2: '''التعبير العاطفي ليس من نقاط القوة لأي نوع من شخصيات المحللين (NT)، لكن بُعد ENTJs عن عواطفهم يكون أكثر وضوحًا وتأثيرًا على نطاق أوسع من الناس. خاصةً في البيئات المهنية، قد يتجاهل أصحاب هذه الشخصية عن غير قصد الحساسية العاطفية للأفراد الذين يرونهم غير فعالين أو كسالى. بالنسبة لهم، غالبًا ما يُنظر إلى العروض العاطفية كعلامات ضعف، مما يجعل من السهل تكوين أعداء بهذا النهج. ومع ذلك، سيكون من الجيد لأصحاب شخصية ENTJ أن يتذكروا أنهم يعتمدون بشكل كامل على وجود فريق فعال، ليس فقط لتحقيق أهدافهم ولكن للحصول على التقدير والتغذية الراجعة أيضًا، وهو أمر يُظهرون حساسية كبيرة تجاهه، بشكل غريب.

شخصيات ENTJ قوة حقيقية، وغالبًا ما يسعون إلى تكوين صورة تبدو أكبر من الحياة – وغالبًا ما ينجحون في ذلك. ومع ذلك، يحتاجون إلى تذكُّر أن مكانتهم لا تأتي فقط من أفعالهم، بل من أفعال الفريق الذي يدعمهم. من المهم أن يعترفوا بمساهمات ومواهب واحتياجات شبكة الدعم الخاصة بهم – خصوصًا من الجانب العاطفي. حتى لو اضطروا إلى تبني عقلية "تظاهر حتى تنجح"، إذا تمكن أصحاب شخصية ENTJ من الجمع بين تركيز صحي عاطفي مع نقاط قوتهم العديدة، فسيُكافَؤون بعلاقات عميقة ومرضية، وبكل الانتصارات والتحديات التي يمكنهم التعامل معها.'''),
        ]),
      ])
    ]);
  }
}