import 'package:flutter/material.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Info_Patterns.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Tab_Patterns.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Tabs_Column.dart';
import 'package:gradution_project/View/features/EachPatternInfo/patternsstructure.dart';
import 'package:gradution_project/View/features/EachPatternInfo/tabslistview.dart';

class Entp extends StatelessWidget {
  const Entp({super.key});

  @override
  Widget build(BuildContext context) {
    return const Patternsstructure(childs: [
      Infopatterns(
          text1: 'ENTP',
          text2: 'محاور',
          text3:
              '''نوع شخصية المناقش كمحامي الشيطان في أشد صوره قساوة، يزدهر بتمزيق الأشرطة الرابطة للحجج والمعتقدات كل ممزق والإلقاء بها في مهب الريح ليراها الجميع. وخلافًا للشخصيات الأكثر عزمًا وتصميماً، فالمناقشون لا يسلكون هذا المنهج سعيًا منهم لتحقيق بعض الأغراض الأعمق أو الأهداف الاستراتيجية، بل للمتعة لا أكثر ولا أقل. ولا أحد يحب عملية السجال العقلي أكثر من المناقش''',
          image: 'assets/entp2.png'),
      Tabpatterns(tabchilds: [
        TabsListView(childs: [
          TabsCloumn(
              text1: 'عادات مكان العمل',
              text2:
                  '''الأشخاص الذين ينتمون إلى نوع الشخصية ENTP (المناقشون) لديهم توقعات واضحة في مكان العمل، ولكنها ليست دائمًا سهلة التحقيق. كونهم مؤمنين بقوة بفكرة الجدارة، يتوقع ENTP أن تُسمع أفكارهم من قبل من هم أعلى منهم، ويسعون إلى النقاش القوي بين زملائهم، ويطالبون من يديرونهم بتقديم حلول وأفكار جديدة بغض النظر عن مناصبهم. ورغم أن الواقع قد لا يسير دائمًا بهذه الطريقة، فإنهم يعرفون ما يبحثون عنه ويمكنهم تجنب المؤسسات ذات الهياكل الهرمية الصارمة التي قد يواجهون صعوبة في التعامل معها.'''),
          TabsCloumn(
              text1: 'الموظفون من نوع شخصية ENTP',
              text2:
                  '''تتجلى تفضيلات الجدارة بوضوح لدى الشخصيات من نوع ENTP عندما يكونون في أدوار المرؤوسين، حيث يشعرون بالراحة عند تحدي أفكار مديريهم ويعبرون بقوة عن كراهيتهم للقواعد والإرشادات المقيدة. يدعم ENTP هذا السلوك غير التقليدي بعقلهم الحاد وفضولهم، وهم قادرون على تبني أساليب جديدة كما يقترحون على الآخرين القيام بذلك. إذا كان بالإمكان تحسين شيء ما، فإن الأمر بسيط بالنسبة لهم. وسيتقبلون النقد بسرور، طالما كان منطقيًا ويركز على الأداء.

التحدي الأكبر لمرؤوسي ENTP هو أن الأدوار "الأدنى" غالبًا ما يكون مصيرها تنفيذ التفاصيل، والقيام بالأعمال الروتينية، ومتابعة الخطط التي يضعها المدراء. وهذا أبعد ما يكون عن الأنشطة التي يفضلها أصحاب هذا النوع من الشخصية. فهم لا يستطيعون تحمل العمل البسيط والروتيني، وتعد المهام المملة بمثابة كابوس لهم. تسير الأمور بشكل أفضل إذا تمكن المديرون من استغلال تفضيلات ENTP في التصدي للتحديات المعقدة والمشاريع المتنوعة بشكل صحيح.'''),
          TabsCloumn(
              text1: 'مديرين ENTP',
              text2:
                  '''على الرغم من أن تولي المناصب الإدارية ليس دائمًا هدفًا رئيسيًا لشخصيات ENTP، إلا أن الإدارة غالبًا ما تكون البيئة الأنسب لهم. هذا الدور يتيح لهم الحرية لتجربة أساليب مختلفة وابتكار طرق جديدة للتعامل مع التحديات، دون الحاجة إلى تنفيذ الخطط خطوة بخطوة بأنفسهم. يتميز المديرون من نوع ENTP بعقلية منفتحة ومرونة، حيث لا يكتفون بمنح الآخرين حرية التفكير بل يتوقعونها أيضًا.

قد يؤدي ذلك أحيانًا إلى الفوضى وظهور أفكار ومناهج متضاربة، لكنهم قادرون على تقييم الخطط بدقة وموضوعية لاختيار الأكثر فعالية بينها. هذا النهج قد لا يساعدهم دائمًا على كسب الأصدقاء، ولكن نادرًا ما يكون ذلك هدفهم الأساسي. بدلاً من ذلك، يفضلون أن يُنظر إليهم باحترام كأشخاص أذكياء وذوي كفاءة.
سواء أكانوا محبوبين أم لا، فإن شخصيات ENTP يتمتعون بموقف قوي في النقاشات العقلانية، مما يجعلهم مدافعين شرسين عن فرقهم. التحدي الذي يواجههم في هذا الدور هو الحفاظ على التركيز، حيث يميلون إلى القفز من مشروع إلى آخر بحثًا عن التجديد والإثارة، قبل أن تتمكن فرقهم من إنهاء التفاصيل وتحقيق الأهداف والالتزامات القائمة.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'مسارات الحياة المهنية',
              text2:
                  '''في عالم الوظائف، يتمتع الأشخاص من نوع شخصية ENTP (المجادلون) بميزة كونهم مشغولين بشكل طبيعي ومهتمين بأن يكونوا منتجين ومفيدين. هذه الشخصيات النشيطة تركز على تطوير حلول للمشاكل التقنية والفكرية المثيرة والمتنوعة. وهذا يعني أن ENTPs يميلون إلى تقدير الوظائف التي تسمح لهم بحرية الاستكشاف والتجربة والتفاعل مع الأفكار والمنظورات المختلفة.

تعد ENTPs نوعًا متعدد الاستخدامات، وعلى الرغم من أنه قد يستغرق الأمر بعض الوقت للوصول إلى نقطة يمكنهم فيها الاستفادة بالكامل من مهاراتهم، إلا أنهم من المحتمل أن يجدوا أن هذه الصفات تترجم بشكل جيد إلى أي مهنة تتحدىهم حقًا بينما تحافظ على إثارة اهتمامهم بشكل مستمر.'''),
          TabsCloumn(
              text1: 'هبة الفضول',
              text2:
                  '''ل هذه القوة الفكرية قد تكون مهيبة، لكن الأشخاص من نوع شخصية ENTP يتمتعون بفائدة إضافية، وهي كونهم متواصلين ممتازين – خاصة في المحادثات المباشرة وجهًا لوجه. على الرغم من أنهم لا يحبون القيود المرتبطة بإدارة الآخرين (أو أن تتم إدارتهم)، فإن هذا التكيف الاجتماعي يجعلهم قادة بالفطرة، يوضحون الطريق للأمام ويلهمون الآخرين بالمنطق السليم والبراعة الفكرية.

في حين قد يعترض الآخرون على هذه الخطط بأسباب عاطفية أو مقاومة عامة للتغيير، وهي أمور لا يضعها ENTPs في قيمة كبيرة، إلا أن هذه التعليقات المتنافسة تُواجه عادةً بحججهم البارعة وأهدافهم التي تتغير بشكل دقيق.

بالتالي، يتميز الأشخاص من نوع شخصية ENTP بقدرتهم على التفوق في مجالات مثل المحاماة، علم النفس، تحليل النظم، والعلوم. كما يمكن لهذه الشخصيات الذكية أن تزدهر أيضًا كممثلين مبيعات، حيث يمكنهم تبرير قرارات الشراء التي قد تبدو في الظروف الأخرى اختيارية – بشرط أن يفهم مدراؤهم حاجتهم إلى مساحة للعمل بطريقتهم الخاصة وتحقيق نتائجهم المذهلة.'''),
          TabsCloumn(
              text1: 'روح الاستقلالية',
              text2:
                  '''يتلخص الأمر كله بالنسبة لشخصيات ENTP في شعورها بالحرية الشخصية، حيث يتيح لهم ذلك تطبيق قدراتهم بشكل كامل لفهم المشكلات التي تثير اهتمامهم وحلها. تبدو الروتينيات والهياكل والقواعد الرسمية كعوائق غير ضرورية لهؤلاء الأشخاص النشطين في حل المشكلات. قد يجد ENTP أن أفضل مساراتهم المهنية هي تلك التي تتيح لهم الانخراط في مساعيهم الفكرية وفقًا لشروطهم الخاصة، مثل العمل كمستشارين مستقلين أو مهندسي برمجيات.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'الأبوة',
              text2:
                  '''قد يعتقد البعض أن طبيعة الأشخاص ذوي شخصية ENTP (المجادلون) المتقلبة والمتقلبة قد تجعل الأبوة تحديًا خاصًا بالنسبة لهم، وفي العديد من الجوانب، سيكونون على صواب. ومع ذلك، هناك شيء واحد يحبه هؤلاء الأشخاص أكثر من أي شيء آخر، وهو التحدي الجيد أو المشكلة التي يجب حلها - حتى لو كان ذلك يعني أنهم يجب أن يواجهوا ضعفهم الشخصي في العملية.

يأخذ الأشخاص ذو شخصية ENTP أدوارهم كآباء على محمل الجد، ومن المؤكد أنهم سيتأثرون بشكل عميق بهذا التحول في حياتهم. بالنسبة لأطفالهم، يسعون جاهدين لتوفير عالم مليء بالإمكانات على أمل أن ينمي أطفالهم حب التعلم، والمنظور المتفتح، والثقة في التعبير عن أنفسهم دون القلق المفرط بشأن ما يعتقده الآخرون عن ذلك.'''),
          TabsCloumn(
              text1: 'تربية المفكرين المستقلين',
              text2:
                  '''من البداية، يظهر نفور الأشخاص ذوي شخصية ENTP من القواعد واللوائح بوضوح، ومن المحتمل أن يمنحوا أطفالهم الصغار الحرية اللازمة للاستكشاف بمفردهم. الاستقلالية هي واحدة من أكبر احتياجات هذا النوع من الشخصيات، ويشعرون أن الشخص لا يكون مكتملًا دون عقل مستقل.

مع نمو أطفالهم وتطورهم، يشجع الأشخاص ذوو شخصية ENTP أطفالهم على إبداء الاعتراضات والآراء والبدائل. يعلمون أطفالهم كيفية التعامل مع هذه الخيارات من موقع الحياد والمنطق – أن يوضحوا ما هو أكثر فاعلية بدلاً من ما قد يشعرهم بالراحة. كما هو الحال في علاقاتهم الأخرى، فإن هذه الصفة الخاصة بعدم الوصول العاطفي هي المكان الذي يواجه فيه الآباء من شخصية ENTP صعوبة.

ومع تطور أطفالهم إلى مرحلة المراهقة وتعلمهم إيجاد التوازن في التعبير العاطفي الصحي، قد يجد الآباء من شخصية ENTP أنفسهم في حالة من الإحباط. بينما هم دائمًا مستعدون لنقاش جيد حول أي موضوع تقريبًا، قد يحتاجون إلى العمل على كيفية التعامل مع انفجاراتهم العاطفية وجدلهم. يمتلك الأشخاص ذوو شخصية ENTP القدرة على ذلك، لكن حتى هم لديهم حدود وقواعد عندما يتعلق الأمر بالنزاع العاطفي.'''),
          TabsCloumn(
              text1: 'إيجاد طريقة أفضل',
              text2:
                  '''لحسن الحظ، يدرك الآباء من شخصية ENTP ما هو على المحك: فهم يريدون لأطفالهم أن ينمووا ليصبحوا بالغين ذكيين ومستقلين وصادقين. ولإيصال هذه القيم، يعرف هؤلاء الأشخاص أنه مثل أي نقاش آخر، يجب عليهم التواصل بطرق مفهومة من جميع الأطراف. وإذا كان ذلك يعني تعلم كيفية استخدام أدوات متنوعة للتعبير العاطفي من أجل أن يصبحوا أكثر براعة في التعامل مع المشاعر، فلا مانع من ذلك.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'العلاقات الرومانسية',
              text2:
                  '''إذا كان هناك شيء واحد يتقنه الأشخاص ذوو نوع الشخصية ENTP (المناظرون)، فهو ابتكار تدفق لا نهاية له من الأفكار والابتكارات لدفع الأمور إلى الأمام، وهذا يظهر أيضًا في علاقاتهم العاطفية. يمكن أن يكونوا شريكًا مثيرًا للتحدي ومليئًا بالحماس. إنهم يجلبون حماستهم وفضولهم الفكري إلى حياتهم العاطفية، مما يؤدي في كثير من الأحيان إلى علاقات مليئة بالشغف والنمو المستمر. قد تكون هذه العملية مرهقة إذا لم يكن شريكهم على نفس المستوى، ولكن عندما يجدون شخصًا يشاركهم حب الاستكشاف الفكري، فاستعدوا لمغامرة'''),
          TabsCloumn(
              text1: 'الشرر قد يطير',
              text2:
                  '''مواعدة هؤلاء الأشخاص ليست تجربة مملة. من تواريخهم الأولى، يختبر الأشخاص ذوو شخصية ENTP حدود شريكهم، يدفعون الحدود والتقاليد، ويبحثون عن الانفتاح والمرونة. يحب هؤلاء الأشخاص التفاعل مع شريكهم في مناقشات ومحاورات تحفز التفكير، ويستفيدون من حماسهم وإبداعهم في إسعاد وإبهار شريكهم بتجارب جديدة. بالنسبة للأشخاص ذوي شخصية ENTP، الحب هو فرصة للتعلم والنمو المتبادل.

ومع ذلك، قد تصبح طبيعتهم غير الصبورة والمضطربة واضحة أثناء سعيهم المستمر وراء التجديد ورفضهم للروتين. هذه الشخصية ليست من النوع الذي يقبل فكرة وجود وضع مستقر سعيد. يمكن أن يكون التوازن بين حاجتهم لتجارب ومغامرات جديدة مع واقع العلاقة العاطفية الثابت أمرًا صعبًا للعديد من الأشخاص ذوي هذا النوع من الشخصية. لكن إذا قوبل حماسهم الثابت بحماس مماثل، فقد يؤدي ذلك إلى علاقة رائعة تتميز بقوتها وعمقها وشرارتها'''),
          TabsCloumn(
              text1: 'فرص للنمو',
              text2:
                  '''حب الأشخاص ذوي شخصية ENTP للتفاعل الفكري والنمو الشخصي قد يصبح مرهقًا في بعض الأحيان، خاصة بالنسبة للشركاء الذين يفضلون الحميمية العاطفية على المناقشات الفكرية. كما أن رغبتهم في تساؤل وتحدي كل شيء يمكن أن تتحول أحيانًا إلى جدل أو حتى قسوة، حيث قد يتجاهلون مشاعر شريكهم لصالح المنطق والحجة العقلانية.

بينما يعد الأشخاص ذو شخصية ENTP أكثر انفتاحًا من غيرهم من أنواع الشخصيات التحليلية (NT) فيما يتعلق بوجهات نظر الآخرين، إلا أنهم أيضًا أكثر ميلاً للتعبير عن ازدرائهم للأمور مثل الحساسية العاطفية بعبارات قاسية ودقيقة، مما يؤدي بسهولة إلى إيذاء مشاعر شريكهم دون أن يدركوا ذلك. قد يتجاهل هؤلاء الأشخاص مشاعر شريكهم تمامًا، وينغمسون بالكامل في فكرة أو فرصة بعيدة.

ومع ذلك، فإن الأشخاص ذو شخصية ENTP هم أفراد متكيفون بشكل استثنائي. قدرتهم واستعدادهم لتغيير وجهات نظرهم قد ينقذهم من أن يصبحوا متصعدين أو قساة. ما عليهم سوى أن يدركوا قيمة الفهم العاطفي والحساسية والتسوية للحفاظ على علاقة قوية. والخبر السار هو أن هذه الشخصيات يمكن أن تعمل بشكل فعال على تطوير هذه الصفات مع الحفاظ على روحهم المحبة للنقاش والغير تقليدية.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'نقاط القوة',
              text2:
                  '''واسعو المعرفةنادرًا ما يفوت أصحاب شخصية ENTP فرصة لتعلم شيء جديد، خاصة المفاهيم المجردة. هذه المعلومات لا تُكتسب عادةً بهدف معين أو من خلال دراسة موجهة، بل لأنهم يجدونها ممتعة ومثيرة للاهتمام.

سريعو التفكيريتمتع أصحاب شخصية ENTP بعقول مرنة للغاية، مما يتيح لهم التنقل بين الأفكار بسهولة. يستخدمون معرفتهم المتراكمة لدعم وجهات نظرهم أو حتى وجهات نظر معارضيهم، حسب الحاجة. في الواقع، هم أكثر الشخصيات قدرةً على الانتقال بسرعة بين المواضيع أثناء المحادثات الممتعة، دون أن يفقدوا تسلسل الأفكار.

أصليوننظراً لقلة ارتباطهم بالتقاليد، يتمكن أصحاب شخصية ENTP من التخلي عن الأنظمة والأساليب التقليدية وتجميع الأفكار المتفرقة من قاعدة معرفتهم الواسعة لتطوير أفكار جديدة وجريئة. وعندما يُواجهون مشكلات مزمنة أو نظامية، يتعاملون معها بحماس وبهجة.

خبراء في العصف الذهنيلا شيء يسعد شخصية ENTP بقدر تحليل المشكلات من جميع الزوايا لإيجاد أفضل الحلول. من خلال الجمع بين معرفتهم وأصالتهم، يعرضون جميع جوانب الموضوع المطروح، ويستبعدون الخيارات غير المناسبة بلا تردد، ويقدمون دائمًا المزيد من الاحتمالات. مما يجعلهم لا غنى عنهم في جلسات العصف الذهني.

جذابونيتمتع أصحاب شخصية ENTP بمهارة فريدة في استخدام الكلمات وروح الفكاهة التي تجذب الآخرين. ثقتهم بأنفسهم، وسرعة تفكيرهم، وقدرتهم على ربط الأفكار المختلفة بطرق مبتكرة، تجعل أسلوبهم في التواصل ساحرًا، ممتعًا، ومفيدًا في الوقت ذاته.

مفعمون بالطاقةعندما تتاح لهم الفرصة لاستخدام هذه السمات معًا لتحليل مشكلة مثيرة، يظهرون بشكل مذهل في حماسهم ونشاطهم. ليس لديهم أي مشكلة في قضاء ساعات طويلة وأيام متواصلة للعثور على الحل الأمثل.'''),
          TabsCloumn(
              text1: 'نقاط الضعف',
              text2:
                  '''مجادلون للغايةإذا كان هناك شيء يستمتع به أصحاب شخصية ENTP، فهو التمرين العقلي الناتج عن مناقشة فكرة ما. الشخصيات الأكثر توجهًا نحو التوافق قد لا تقدّر الحماس الذي يتعامل به هؤلاء الأشخاص مع أفكار الآخرين، مما قد يؤدي إلى توتر كبير.

غير حساسيننظرًا لتركيزهم الشديد على المنطق، غالبًا ما يخطئ أصحاب شخصية ENTP في تقدير مشاعر الآخرين ويدفعون نقاشاتهم إلى ما بعد حدود تحمل الآخرين. هؤلاء الأشخاص لا يرون أن النقاط العاطفية تعتبر ذات قيمة في مثل هذه النقاشات، مما يفاقم المشكلة بشكل كبير.

غير متسامحينما لم يتمكن الآخرون من دعم أفكارهم في جولة من المناقشات العقلية، فمن المحتمل أن يتجاهل أصحاب شخصية ENTP ليس الأفكار فقط، بل الأشخاص أنفسهم. إما أن تقف الفكرة أمام الفحص العقلي أو أنها غير جديرة بالاهتمام.

يجدون صعوبة في التركيزنفس المرونة التي تتيح لأصحاب شخصية ENTP ابتكار أفكار وخطط جديدة تجعلهم يعيدون تعديل الخطط الجيدة كثيرًا أو حتى يتخلون عنها تمامًا مع تراجع الحماس الأولي وظهور أفكار جديدة. يصاب هؤلاء الأشخاص بالملل بسهولة، ويجدون أن الأفكار الجديدة هي الحل، رغم أنها ليست دائمًا مفيدة.

يكرهون الأمور العمليةبما أن شخصية ENTP تفضل العفوية والجدة، فإنها غالبًا ما تعاني من التنظيم، الهيكلية، وكل ما يتعلق بالأمور العملية. هؤلاء الأشخاص مهتمون بما يمكن أن يكون، أي الأفكار والخطط القابلة للتعديل والنقاش. عندما يتعلق الأمر بالتفاصيل الدقيقة والتنفيذ اليومي، فإنهم يميلون إلى فقدان الاهتمام، مما يؤدي في كثير من الأحيان إلى أن تبقى خططهم في الهواء دون تحقيق'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'الصداقات',
              text2:
                  '''آخر ما يرغب أصحاب شخصية ENTP في سماعه هو عبارة "أنت على حق" – إلا إذا استحقوا هذا الامتياز بجدارة في جولة ساخنة من النقاش الفكري. إذا كانوا على خطأ، فإنهم يريدون أن يتم إبلاغهم بذلك، ويرغبون في كشف كل تفاصيل العيوب في منطقهم. جزء من هذا يرجع إلى سعيهم وراء الحقيقة، التي تكون أحيانًا عشوائية، وجزء آخر فقط لأنهم يريدون العمل للدفاع عن منطقهم عبر الحجج المضادة.

من السهل غالبًا على هذه الشخصيات اختبار مدى التوافق مع صديق محتمل. يتميز أصحاب شخصية ENTP بسرعة البديهة، ويعبرون عن ذلك بشكل أساسي من خلال الجدالات والمناقشات، حيث يمكنهم قضاء ليلة كاملة في مناقشة فكرة قد لا يؤمنون بها فعليًا. ونتيجة لذلك، يبحث هؤلاء الأشخاص عن أصدقاء يمكنهم مواكبة أفكارهم السريعة ومفاجأتهم بأفكار أصلية وغير متوقعة.'''),
          TabsCloumn(
              text1: 'لا لحظة مملة',
              text2:
                  '''يعرف أصحاب شخصية ENTP كيف يسترخون ويستمتعون، ولكن تعريفهم لـ"المرح" قد يكون مختلفًا عن الآخرين. بالنسبة لهذه الشخصيات الجريئة وغير التقليدية، قد تكون أمسية ممتعة عبارة عن زجاجة من النبيذ ومناقشة حول أسباب وحلول أزمة عالمية ما – وهي فكرة قد تبدو كـ"ليلة من الجحيم" بالنسبة للعديد من الشخصيات الأخرى. ومع ذلك، فإن ENTPs شخصيات ودودة ومتحمسة في معظم الأحيان، وأي موقف يسمح بالمحادثة والقليل من اللعب بالكلمات يُعتبر فرصة ممتعة بالنسبة لهم.

في الواقع، يُظهر أصحاب شخصية ENTP قدرة رائعة على التواصل مع الأصدقاء والمعارف من مختلف أنواع الشخصيات. ميلهم الطبيعي للجدال بشكل فعال يجعلهم معتادين على التحدث بلغة الآخرين ومن منظورهم، وهو ما ينعكس إيجابًا على المحادثات اليومية. ومع ذلك، تكمن الصعوبة بالنسبة لهم في التعبير العاطفي – وهو نقطة ضعف مشتركة لجميع أنواع الشخصيات المحللة (NT).'''),
          TabsCloumn(
              text1: 'تجاهل المشاعر',
              text2:
                  '''يميل أصحاب شخصية ENTP إلى كبت مشاعرهم، وعندما يواجهون صديقًا بحاجة إلى دعم عاطفي، سواء بشكل رمزي أو حرفي، قد يجدون أنفسهم عاجزين عن التعامل مع الموقف. هم على استعداد كامل وسعادة لتقديم سلسلة من الحلول العقلانية والمنطقية للمشكلة المطروحة، كما يفعلون في أي موقف يتطلب حل مشكلة. ومع ذلك، فهم لا يُعرفون عادة بحساسيتهم أو تعبيرهم الخارجي عن المودة، بغض النظر عن مدى فهمهم البديهي لوضع الآخر.

الأمر يزداد سوءًا عندما يحاول صديق ENTP تحويل هذه المواقف العاطفية إلى شيء أكثر راحة بالنسبة لهم: جدال. على الرغم من براعتهم اللافتة في الدفاع عن كلا طرفي النقاش، إلا أنهم غالبًا ما يكونون سيئين في وضع أنفسهم مكان الآخرين من منظور عاطفي. ينبغي على أصحاب شخصية ENTP تجنب إغراء تحويل نقاش حول أسباب انفصال صديقهم الأخير إلى مادة للتحدي الفكري.

طالما أن الجميع يفهم أن كلماتهم ليست موجهة شخصيًا، فإن أي شخص لا يخشى مناقشة أفكار جديدة ومثيرة سيجد صداقة محفزة وملهمة مع ENTPs. قد لا تكون هذه العلاقة مناسبة للجميع، لكن هذه الشخصيات لا تهتم فعليًا بأن تكون محبوبة من قبل الجميع. ما دام بإمكانهم التبديل بين دور "لوحة الصوت" و"الميكروفون"، فإن ENTPs وأصدقاءهم سيستمتعون بصحبة بعضهم البعض لفترة طويلة جدًا.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'مقدمة تعريفية',
              text2:
                  '''ذوو الشخصية ENTP (المعروفون بالمناقشين) سريعو البديهة وجريئون، ولا يخشون معارضة الوضع الراهن. في الواقع، هم لا يخشون معارضة أي شيء أو أي شخص. قلة من الأمور تثير حماس هذه الشخصيات أكثر من نقاش لفظي حاد، وإذا انحرفت المحادثة نحو مواضيع مثيرة للجدل، فهذا أفضل بالنسبة لهم.
ولكن سيكون من الخطأ الاعتقاد أن الأشخاص من نمط شخصية ENTP خلافيون أو ذوو نوايا سيئة. على العكس، فهم مثقفون وفضوليون ويتمتعون بحس فكاهي مرح، مما يجعلهم ممتعين للغاية. ببساطة، لديهم فكرة فريدة وغير تقليدية عن المرح – تتضمن عادةً جرعة صحية من النقاش الحيوي.'''),
          TabsCloumn(
              text1: 'كسر القواعد',
              text2:
                  '''يشتهر أصحاب شخصية ENTP بنزعتهم المتمردة. بالنسبة لهذا النمط من الشخصية، لا يوجد اعتقاد مقدس للغاية يمنعهم من التساؤل حوله، ولا توجد فكرة أساسية تمنعهم من فحصها بعمق، ولا توجد قاعدة مهمة جدًا تمنعهم من كسرها أو على الأقل اختبارها بدقة. قد يجعل هذا الأشخاص من نوع ENTP يبدون متهورين أو معارضين للغاية، لكن في جوهرهم، ينبع ميلهم الطبيعي لاختبار الحدود من رغبتهم في الابتكار والتغيير.

يرى هؤلاء الأشخاص أن معظم الناس يميلون إلى الامتثال الأعمى للقواعد الاجتماعية والضغوط والمعايير. يستمتع أصحاب الشخصية ENTP بالتمرين الذهني المتمثل في التساؤل عن الأفكار السائدة، ويجدون متعة خاصة في اكتشاف قيمة المهمشين والمغايرين. لا يستطيع عقلهم النشط إلا أن يعيد التفكير في الأمور التي يأخذها الجميع كأمر مسلم به، ويدفعها في اتجاهات جديدة وذكية.'''),
          TabsCloumn(
              text1: 'ثمن المعارضة',
              text2:
                  '''قدرة أصحاب شخصية ENTP على الجدال مشهورة، لكنها لا تعني دائمًا أنها مفيدة. عندما يشككون علنًا برأي مديرهم في اجتماع أو ينتقدون كل ما يقوله شريكهم، قد يظنون أنهم يدافعون عن العقلانية والمنطق. لكن في الحقيقة، قد يضر هذا بسعادتهم وفرص نجاحهم أكثر مما ينفعهم.

ليست كل المواقف مناسبة للنزعة الجدالية التي يتسمون بها، ومعظم الناس لا يتحملون أن يتم التشكيك في معتقداتهم أو تجاهل مشاعرهم باستمرار. ونتيجة لذلك، قد يجد أصحاب الشخصية ENTP أن متعتهم الجدالية تحرق العديد من الجسور، وغالبًا بشكل غير مقصود. تُحترم هذه الشخصيات بسبب رؤيتها الواضحة، وثقتها، ومعرفتها، وحسها الفكاهي، لكن دون أن تنمي حساسية تجاه مشاعر الآخرين، قد تعاني في الحفاظ على العلاقات العميقة أو تحقيق أهدافها المهنية.

مع مرور الوقت، يدرك العديد من أصحاب شخصية ENTP أن الحياة المثالية تتطلب وجود الآخرين، وأن الإفراط في التركيز على "كسب" الجدالات يعني حرمان أنفسهم من الدعم الذي يحتاجونه للوصول إلى ما يطمحون إليه. الخبر الجيد هو أن أصحاب هذه الشخصية لن يفقدوا أبدًا حدتهم غير التقليدية. يمكنهم ببساطة استغلال مرونتهم الإدراكية لفهم وجهات نظر الآخرين واستكشافها، مع الاعتراف بقيمة الاعتبار والتسوية بجانب المنطق والتقدم.'''),
        ]),
      ])
    ]);
  }
}
