import 'package:flutter/material.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Info_Patterns.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Tab_Patterns.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Tabs_Column.dart';
import 'package:gradution_project/View/features/EachPatternInfo/patternsstructure.dart';
import 'package:gradution_project/View/features/EachPatternInfo/tabslistview.dart';


class Esfp extends StatelessWidget {
  const Esfp({super.key});

  @override
  Widget build(BuildContext context) {
    return const Patternsstructure(childs: [
      Infopatterns(
          text1: 'ESFP',
          text2: 'مسلي',
          text3:
              '''إذا وجدت شخصية ما عفوية في الغناء والرقص، فاعلم أنها من نوع شخصية المسلي. فشخصيات المسليين تستغرقها الإثارة اللحظية، ويريدون من الجميع أن يشاركوهم هذا الشعور أيضًا. ولن تجد نوع شخصية آخر سخي بوقته وطاقته كما تفعل شخصيات المسليين عندما يتعلق الأمر بتشجيع الآخرين، ولن تجد نوع شخصية آخر يفعل ذلك بهذا الأسلوب الذي لا يقاوم.''',
          image: 'assets/images/esfp2.png'),
      Tabpatterns(tabchilds: [
        TabsListView(childs: [
          TabsCloumn(
              text1: 'عادات مكان العمل',
              text2:
                  '''نادراً ما يناسب أسلوب الحياة في المكاتب هؤلاء الأفراد الاجتماعيين. يفضل الأشخاص الذين يحملون شخصية ESFP (المؤدون) البيئات الديناميكية والاجتماعية حيث يمكنهم بسهولة بدء المحادثات وتبادل الأفكار. لا يوجد نوع أفضل منهم لوجوده في بيئة عمل نشطة ومزدحمة. كلما زادت الحرية التي يمتلكونها في القيام بما عليهم فعله، كانت النتائج أفضل - طالما أنهم يعرفون الهدف.
ومع ذلك، بغض النظر عن الوظيفة التي يجدون أنفسهم فيها في العمل، يشارك ESFPs رغبة في جعل البيئة أكثر ودية وممتعة قدر الإمكان. لتحقيق ذلك، عادة ما يحافظ هؤلاء الأشخاص على موقف اجتماعي ومريح، ويستخدمونه لجعل الجميع يتعاونون في المهام العملية التي يجب إنجازها.'''),
          TabsCloumn(
              text1: 'الموظفون من نوع ESFP',
              text2:
                  '''كموظفين تحت إشراف، يزدهر الأشخاص الذين يحملون شخصية ESFP في التغيير والأفكار الجديدة، ويشعرون بالضيق تحت المهام المتكررة والمحددة بدقة. يجد مدراء هؤلاء الشخصيات أنهم عبارة عن مجربين مستعدين وقادرين على العصف الذهني، وفهم الأساليب الجديدة بسرعة، وتطبيق هذه الأساليب عملياً – طالما كان لديهم بعض الحرية لتطبيق أسلوبهم الإبداعي الخاص. قد تستغرق التغييرات بعض المحاولات، لأنهم يمكن أن يكونوا سريعًا في النسيان في اللحظات الحرجة ويصبحون أكثر انشغالًا بمحاولة الحصول على نتائج سريعة.

يعطون ملاحظات صادقة حول ما إذا كانت الأمور منطقية، لكنهم أحيانًا يمكن أن يكونوا حساسون تجاه انتقادات الآخرين لعاداتهم الخاصة. تحت الضغط، قد يصبح الأشخاص الذين يحملون هذه الشخصية دفاعيين وسريعًا ما يشعرون بالإحباط. ولكن في النهاية، إذا كانوا يعتقدون أن النقد يأتي من نية صادقة للمساعدة، وليس للإيذاء، فإنهم يأخذونه إلى القلب. أكبر معركة بالنسبة لهم كموظفين هي أنهم يقدرون الحرية أكثر بكثير من الأمان والاستقرار – إذا لم تتوافق شروطهم، فلن يترددوا في العثور على فرصة جديدة.'''),
          TabsCloumn(
              text1: 'المديرون من نوع ESFP',
              text2:
                  '''كمديرين، يبذل الأشخاص الذين يحملون شخصية ESFP كل ما في وسعهم لإضفاء الطاقة والمرح على الأعمال اليومية التي يجب إنجازها. هؤلاء الأشخاص يستمتعون بكونهم مركز الاهتمام، والأكثر من ذلك أنهم يحبون أن يشعروا بأنهم مُحتاجون ومقدّرون. القفز إلى قلب العمل وتطبيق أنفسهم على أي مهمة قد يطلبون من مرؤوسيهم القيام بها هو جزء من وظيفتهم بالنسبة لهم. السلطة والمكانة الاجتماعية تعتبر ثانوية مقارنةً بالشعور بأنهم جزء مهم من الفريق الذي ينجز العمل.

يتمتع الأشخاص الذين يحملون شخصية ESFP بقدرة رائعة على ملاحظة مزاج الآخرين، وقليل من الشخصيات تكون أفضل منهم في منع النزاعات وتشجيع بيئات العمل المريحة والممتعة. مرؤوسوهم دائمًا مرحب بهم للتعبير عن آرائهم، وهم دائمًا سعيدون بالاستماع إلى الآخرين، خاصة إذا كان هناك ما يزعجهم. قدرتهم على التفاعل مع الآخرين والتفكير السريع في المواقف تجعلهم قادة مبتكرين وملهمين.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'مسارات الحياة المهنية',
              text2:
                  '''الناس الذين يحملون شخصية ESFP (المُسليين) يتمتعون بميزة فريدة تجعلهم استثنائيين في بعض المهن وحزينين في البعض الآخر - فهم يعكسون المزاج المحيط بهم. عندما يكونون في حفلة أو حفل موسيقي، يعكسون هذا المزاج، مما يساهم في منحهم صورة "أشخاص الحفلات". وعندما يكون أصدقاؤهم حزينين، يعكسون ذلك بتعاطف وتعاطف. وعندما يحدث أزمة، يتأقلمون أيضًا، معبرين عن شدة الموقف.

نتيجة لذلك، فإن أي مهنة تركز على العمل مع الآخرين هي خيار مناسب لشخصيات ESFP ليكونوا سعداء ومنتجين. علاوة على ذلك، فإن سحرهم وحيويتهم الطبيعية يساعدهم على خلق انطباعات تدوم وتشكيل تحالفات قد تكون مفيدة على المدى الطويل. المقولة القديمة "ليس ما تعرفه، بل من تعرفه" تتردد بشكل عميق لديهم.'''),
          TabsCloumn(
              text1: 'البحث عن تحديات جديدة',
              text2:
                  '''بصفتهم شبكات اجتماعية بالفطرة، يزدهر الأشخاص الذين يحملون شخصية ESFP في الأدوار التي تسمح لهم بالتواصل الاجتماعي وتعزيز العلاقات. هؤلاء الأشخاص ممتازون في تنظيم الفعاليات، والعمل كمندوبين مبيعات، ومنظمي رحلات، ومرشدي سياحة، حيث تخلق كل من هذه المهن شعورًا بالإثارة والتحفيز والجدة بينهم وبين عملائهم. إنهم يستمتعون حقًا بقضاء الوقت مع الآخرين ولديهم قدرة على إسعاد الناس حتى في أكثر المواقف إحباطًا.
يقدّر الأشخاص ذوو شخصية ESFP التحديات الجيدة، وهم يقدمون خدمات رائعة وملهمة كمستشارين، وعمال اجتماعيين، ومدربين شخصيين، ومستشارين يساعدون في تحسين رضا الموظفين أو العملاء.
بفضل قدرتهم على الاستجابة بمواردية وحماسة عندما تكون مساعدتهم في أمس الحاجة، يصبح ESFPs محترفين طبيين رائعين، خاصةً في وظائف مثل المسعفين، والمسعفين الطارئين، والممرضين. إنهم يلتقطون المعلومات عن الآخرين بسرعة، مما يساعدهم على الوصول إلى جوهر المشكلة عند التعامل مع المرضى أو المصابين. يزدهرون في المواقف العاطفية الشديدة، ولا يوجد مكان أفضل لذلك.'''),
          TabsCloumn(
              text1: 'لمسة من الفوضى',
              text2:
                  '''ومع ذلك، فإن الوظائف التي تلغي التواصل البشري وترتكز على القرارات غير المتحيزة والمبنية على البيانات قد تكون مدمرة لهم. ينجح البعض في تجاوز ذلك عن طريق الترفيه مع الأصدقاء بعد العمل، ولكن في الغالب، فإن الوظائف القاسية أو التي تحركها القوة تكون غير مناسبة لهم. إضافة إلى ذلك، فإن عدم ارتياح شخصيات ESFP مع الجداول الزمنية، والهياكل، والتكرار يجعلهم يرفضون العمل المتكرر وغير الإبداعي بسرعة.

بغض النظر عن مكان تواجد شغفهم المتنوع، يحتاج ESFPs إلى الحرية، والجدّة، وفوق كل شيء، التواصل البشري. يحتاج الأشخاص الذين يحملون هذه الشخصية إلى أن يشعروا بأنهم ليسوا فقط موضع تقدير (على الرغم من أن ذلك مهم جدًا) بل محبوبين. عندما يدخل ESFP إلى العمل، يريدون أن يروا لمسة من الفوضى وأن يكونوا قادرين على التنقل فيها مع فريق من الأصدقاء القادرين الذين سيكونون سعداء للغاية بالتحرك إلى جانبهم واتخاذ الإجراءات.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'الأبوة',
              text2:
                  '''الأشخاص الذين يحملون شخصية ESFP (المؤديون) هم من أكثر الآباء استرخاءً ومحبين للمرح. من اللحظة الأولى التي يحملون فيها أطفالهم، يشعرون بالفرح والدهشة مما يختبره أطفالهم من حولهم. اللعب مع الأطفال هو متعة حقيقية بالنسبة لهم، وهم دائمًا يبتكرون طرقًا جديدة ومثيرة لإبقاء أطفالهم سعداء، متحمسين، ومنخرطين.'''),
          TabsCloumn(
              text1: 'البرية والحرية',
              text2:
                  '''يعتبر الاستكشاف والتجارب من الفلسفات الرئيسية للآباء من نوع ESFP – عندما يسأل أطفالهم أسئلة، يكون الرد هو: "لنكتشف!" الهياكل المفرطة والأنشطة المجدولة بشكل محكم ليست جزءًا كبيرًا من أسلوب الأبوة لهذا النوع من الشخصيات. يفضلون أخذ الأمور يومًا بيوم وفتح المجال لأطفالهم لاستكشاف شيء جديد بطريقتهم الخاصة، وهو ما يقدره الأطفال كثيرًا.

بالطبع، هذا لا يعني أنه لا توجد قواعد – فهم كانوا صغارًا أيضًا! الانضباط بعيد عن أن يكون أقوى نقاطهم، لكن الوعي والنضج يؤثران. غالبًا ما يكون الآباء من نوع ESFP حريصين على منع أطفالهم من المعاناة من نفس الأذى والنكسات التي عايشوها هم بأنفسهم. إذا كان ذلك يعني أنه يجب عليهم فرض القوانين من وقت لآخر، فإنهم سيفرضونها بحب على أطفالهم.

أحد أكبر نقاط القوة لدى الآباء من نوع ESFP هو أنهم يوفرون دعمًا عاطفيًا كبيرًا. على الرغم من أنهم ليسوا آباءً متطلبين بشكل خاص، فإن العاطفة الدافئة، والعملية، والقدرة على التكيف تمنح الأشخاص ذوي نوع الشخصية ESFP أسلوبًا في التربية مليئًا بالرعاية والتشجيع.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'العلاقات الرومانسية',
              text2:
                  '''الأشخاص الذين يحملون شخصية ESFP (المؤدون) هم أفراد اجتماعيون، يحبون المرح، وذوو روح حرة يعيشون الحياة في اللحظة ويستمتعون بكل لحظة. بطبيعتهم، لا يبخلون بأي من هذه الحيوية والطاقة عندما يتعلق الأمر بالمواعدة. بالنسبة لشخصيات ESFP، العلاقات ليست حول بناء الأسس ببطء من أجل المستقبل أو التخطيط لحياة مشتركة – بل هي أمور حيوية وغير متوقعة يجب الاستمتاع بها طالما هناك متعة يمكن الحصول عليها.'''),
          TabsCloumn(
              text1: 'شرارة الحب',
              text2:
                  '''من المثير للاهتمام أن الأشخاص الذين يحملون شخصية ESFP يعتبرون الوقوع في الحب هو أفضل جزء من العلاقة. هم يستمتعون أكثر في المراحل التي تشمل المشاعر المكثفة، والشغف، والاكتشاف، والإثارة. ونتيجة لذلك، قد يسعون لإبقاء هذه الشرارات مشتعلة لفترة أطول من المعتاد عن طريق استثمار المزيد في الجوانب المثيرة لعلاقتهم.

نظرًا لهذا الاستثمار في الحيوية والفرح، فإن العلاقات مع أشخاص من هذا النوع لا تُنسى ببساطة. هؤلاء الأشخاص دائمًا ما يكون لديهم نشاط جديد ومثير في جعبتهم، ويستمتعون حقًا بقضاء كل لحظة مع شريكهم. يستمتع الأشخاص من شخصية ESFP بالعلاقة الجسدية للغاية، ويظهرون أنفسهم محبين، فضوليين، ومنفتحين، يحبون المشاركة مع الشركاء المتعاونين والمتفاعلين.'''),
          TabsCloumn(
              text1: 'ظهور الصراع',
              text2:
                  '''نظرًا لكونهم موجهين عاطفيًا وحساسين، غالبًا ما يستجيب الأشخاص الذين يحملون شخصية ESFP بشكل سيئ للمقترحات الخارجية حول كيفية إدارة حياتهم العاطفية. يستجيبون بشكل أسوأ إذا جاءت الانتقادات من شريكهم، والمحاولة في إبعاد العواطف عن الموضوع بقول "لا تأخذ هذا بشكل شخصي" لن تكون مفيدة أيضًا. يعد تباطؤ التعامل مع هذه المواقف بشكل أفضل مجالًا للنمو بالنسبة لأشخاص شخصية ESFP.

من ناحية أخرى، قد تكون المشكلة هي نقص الانتقادات تمامًا. الأشخاص الذين يحملون هذه الشخصية يقدرون المدخلات الاجتماعية بشكل كبير وهم متأثرون تقريبًا بآراء أصدقائهم بشأن شريكهم العاطفي بقدر تأثرهم بآرائهم الخاصة. بما أنهم يجذبهم الأشخاص الذين يشاركونهم نفس المواقف، قد يجدون أنفسهم في حلقة صدى لا تخبرهم إلا بما يريدون سماعه، مما يعزز سلوكيات ومواقف غير مثمرة.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(text1: 'نقاط القوة', text2: '''أصليون
التقاليد والتوقعات تأتي في المرتبة الثانية بالنسبة لهذا النوع من الشخصيات، إن كانت تعتبر أصلاً. يحب الـ ESFP تجربة أساليب جديدة ويجدون طرقًا جديدة للتميز عن الآخرين. لا يتوقفون عند الأزياء فقط، بل يضيفون الإبداع الأسلوبي في كلماتهم وتصرفاتهم أيضًا. كل يوم هو عرض، ويحبون تقديمه.

إيجابيون ومتحمسون
يُعرف الأشخاص الذين يحملون هذا النوع من الشخصيات بحبهم للحياة وحماستهم المعدية. إنهم بشكل طبيعي يبثون نوعًا من الإيجابية التي تضيء الغرفة وتجذب الناس إليهم، وغالبًا ما يتحول هذا إلى كاريزما جذابة تلهم من حولهم. عادة ما يقتربون من الحياة وتجاربها العديدة بعقلية منفتحة، جاهزين للانغماس في الجديد والممتع وغير المتوقع.

عمليون ولافتو الانتباه
بالنسبة لـ ESFP، العالم هو للعيش والتجربة. يفضلون أن يروا ويفعلوا بدلاً من التحدث عن "ماذا لو". مع كل هذا التركيز على اللحظة الحالية، على الفعل والعمل، من المنطقي أن يكون الأشخاص الذين يحملون هذه الشخصية طبيعيين عندما يتعلق الأمر بملاحظة الأشياء والتغييرات الحقيقية.

مهارات اجتماعية ممتازة
أكثر من الأشياء، يحب الـ ESFP الانتباه إلى الناس. إنهم يتحدثون بشكل مستمر، ويمتلكون روح الدعابة، وقليلًا ما ينفد كلامهم. بالنسبة لهذه الشخصية، فإن السعادة والرضا تأتي من الوقت الذي يقضونه مع الأشخاص الذين يحبون التواجد معهم.'''),
          TabsCloumn(text1: 'نقاط الضعف', text2: '''حساسين
الأشخاص الذين يحملون شخصية ESFP عاطفيون بشكل كبير وغالبًا ما يكونون عرضة للنقد – يمكن أن يشعروا وكأنهم محاصرون، وأحيانًا يردون بطريقة سلبية. هذه ربما تكون أكبر نقطة ضعف لديهم، لأنها تجعل من الصعب معالجة أي نقاط ضعف أخرى يتم كشفها.

تجنب الصراع
يفضل أصحاب شخصية ESFP في بعض الأحيان تجاهل الصراع تمامًا وتجنبه. يميلون إلى قول وفعل ما هو مطلوب للخروج من مثل هذه المواقف، ثم الانتقال إلى شيء أكثر متعة.

سريع الملل
دون وجود إثارة مستمرة، غالبًا ما يجد الأشخاص الذين يحملون هذه الشخصية طرقًا لإحداثها بأنفسهم. السلوكيات المتهورة، والانغماس الذاتي، ومتعة اللحظة بدلاً من الخطط طويلة المدى هي أشياء يدخل فيها الأشخاص ذوو هذه الشخصية بشكل مفرط.

ضعف في التخطيط طويل المدى
الأشخاص ذوو الشخصية ESFP نادرًا ما يضعون خططًا مفصلة للمستقبل. بالنسبة لهم، الأمور تأتي كما تأتي، وغالبًا ما لا يهتمون بأخذ الوقت لوضع خطوات وعواقب، معتقدين أنهم قد يغيرونها في أي لحظة.

غير مركزين
أي شيء يتطلب التزامًا طويل الأمد وتركيزًا يشكل تحديًا خاصًا للأشخاص الذين يحملون هذه الشخصية. في المجال الأكاديمي، المواضيع الكثيفة والثابتة تكون أصعب بكثير من المواضيع الديناميكية والقابلة للتواصل. الحيلة بالنسبة لهم هي العثور على متعة يومية في الأهداف الأوسع وتحمل الأمور المملة التي يجب القيام بها.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'الصداقات',
              text2:
                  '''الأشخاص الذين يحملون نوع شخصية ESFP (المؤديون) معروفون بمواقفهم الاجتماعية والمتحمسة التي لا يمكن قمعها. لا يحتفظون بالكثير من الأمور في داخلهم، بل يشاركون كل شيء مع دوائرهم الواسعة من الأصدقاء بحكمة وأسلوب وحماسة وتفاؤل. هم مستكشفون لملذات الحياة، ويأخذون متعة خاصة في مشاركة تلك التجارب مع الآخرين. بالنسبة لـ ESFPs، لا يوجد معنى للحياة إذا لم يشعروا بأنهم على قيد الحياة.'''),
          TabsCloumn(
              text1: 'جعل الحياة مثيرة',
              text2:
                  '''الأشخاص من نوع شخصية ESFP هم أفراد نشطون. الخروج للمشاركة في الأنشطة التي تحفز الحواس هي فكرة هؤلاء الأشخاص عن قضاء وقت ممتع. في بعض الأحيان، قد يبالغون في التصرفات المتهورة أو المتهورة ويحاولون أخذ الآخرين معهم في هذه المغامرات. هم حساسون، وقد يُؤخذ رفض هذه الأنشطة بشكل شخصي، مما يؤدي إلى صراع أو دراما. ليس لديهم وقت لتلقي المحاضرات.

إن تكوين صداقات جديدة ليس مشكلة بالنسبة لهم. يستخدم الأشخاص من نوع شخصية ESFP مزيجًا جذابًا من الحقائق الصريحة، والانفتاح المحير، والجاذبية لإبقاء الأمور تتحرك. حيث يخطئ هؤلاء الأشخاص هو في الحفاظ على الصداقات التي لديهم بالفعل. في حماستهم وتركيزهم على اللحظة الحالية بدلاً من الماضي، قد يتبعون بسهولة المغامرة التالية التي يقدمها شخص جديد، ليشعروا بالندم لأن صديقهم القديم يبدو قد تغير وأصبح أقل متعة.'''),
          TabsCloumn(
              text1: 'باحثون عن الإثارة ذو قلوب رقيقة',
              text2:
                  '''هذا كله قد يعطي انطباعًا بأن الأشخاص من نوع شخصية ESFP هم كائنات سطحية ومركزة على المتعة ولا يهتمون إلا بأنفسهم، لكن هذا سوء فهم كبير، وهو بعيد عن الحقيقة! هم يهتمون بحق بأصدقائهم. وهذا هو السبب في أنهم يبذلون الكثير من الجهد في ابتكار تجارب جماعية يعتقدون أن الجميع سيستمتع بها، وهم يشعرون بالانزعاج الشديد من الصراعات العرضية التي تؤذي هذه العلاقات.

من خلال كل جهدهم لجذب أشخاص جدد، يظهر الأشخاص الذين يحملون شخصية ESFP ولاءً لا يُصدق لأصدقائهم الحاليين. إنهم مستمعون رائعون وغالبًا ما يكونون حساسون للتغيرات في المزاج أو السلوك، مما يجعلهم بارعين في تقديم الراحة في الأوقات الصعبة. يجد الأشخاص ذوو هذا النوع من الشخصيات رضا كبيرًا في مساعدة أصدقائهم، ودعمهم غالبًا ما يتجاوز الكلمات البسيطة.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'مقدمة تعريفية',
              text2:
                  '''إذا كان هناك من يمكن أن يتم العثور عليه فجأة وهو يندفع في الغناء والرقص، فهم الأشخاص ذوو شخصية ESFP (المؤدين). يتفاعلون مع حماس اللحظة ويريدون من الجميع أن يشعروا بذلك أيضًا. لا يوجد نوع آخر أكثر سخاءً بوقته وطاقته عندما يتعلق الأمر بتشجيع الآخرين، ولا يوجد نوع آخر يفعل ذلك بأسلوب لا يمكن مقاومته.'''),
          TabsCloumn(
              text1: 'العيش بشغف',
              text2:
                  '''تتمتع شخصيات ESFP بميول للظهور أمام الآخرين وعادة ما يظهرون ارتياحًا كبيرًا في مركز الاهتمام. ومع ذلك، لا يدفعهم حبهم لأن يكونوا في مركز الانتباه، بل قدرتهم الفائقة على ملاحظة ما هو مناسب في مواقف معينة. لديهم قدرة غير عادية على محاكاة سلوكيات من حولهم.

يستمتع ESFPs حقًا بأبسط الأشياء، ولا يوجد شيء أعظم بالنسبة لهم من قضاء الوقت مع مجموعة جيدة من الأصدقاء. يفضل هؤلاء الأشخاص دائمًا قضاء الوقت مع الأصدقاء بدلاً من البقاء بمفردهم. ومع فكاهتهم الفريدة والعميقة، يحبون جذب الانتباه وجعل كل تجمع يبدو وكأنه حفلة.
لكن الأمر لا يتوقف عند الكلام فقط، فشخصيات ESFP تميل إلى أن تكون الأكثر قدرة على التقدير الجمالي بين جميع الأنواع. من العناية بالمظهر والملابس إلى ترتيب المنزل، لديهم عين فنية لما هو جذاب. يعرفون ما هو جذاب بمجرد رؤيته، ولا يخشون تغيير بيئاتهم لتعكس أسلوبهم الشخصي. هؤلاء الأشخاص فضوليون بطبيعتهم، ويستكشفون التصاميم والأساليب الجديدة بسهولة.

على الرغم من أنه قد لا يبدو ذلك دائمًا، فإن هؤلاء الأشخاص يعرفون أن الأمر ليس كله عنهم – فهم مراقبون وحساسون للغاية تجاه مشاعر الآخرين. غالبًا ما يكونون أول من يساعد شخصًا آخر في الحديث عن مشكلة صعبة، ويقدمون الدعم العاطفي والنصائح العملية بكل سرور. ومع ذلك، إذا كانت المشكلة تخصهم، فمن المحتمل أن يتجنبوا الصراع تمامًا بدلاً من التعامل معه مباشرة. يحب هذا النوع من الشخصيات القليل من الدراما والشغف، ولكن ليس عندما يكونون هم مركز الانتقادات التي قد تجلبها.'''),
          TabsCloumn(
              text1: 'روح عفوية',
              text2:
                  '''أكبر تحدٍ يواجهه هؤلاء الأشخاص هو أنهم غالبًا ما يكونون مركزين للغاية على الملذات الفورية لدرجة أنهم يهملون الواجبات والمسؤوليات التي تجعل تلك الكماليات ممكنة. التحليلات المعقدة، والمهام المتكررة، ومطابقة الإحصائيات مع النتائج الحقيقية ليست أنشطة سهلة بالنسبة للأشخاص من نوع الشخصية ESFP. يفضلون الاعتماد على الفرص العفوية أو ببساطة طلب المساعدة من دائرة أصدقائهم الواسعة. من المهم أن يتحدوا أنفسهم لمتابعة الأشياء طويلة الأجل مثل خطط التقاعد أو تناول السكر – فلن يكون هناك دائمًا شخص آخر يساعد في متابعة هذه الأمور.

يُدرك الأشخاص ذوو شخصية ESFP القيمة والجودة، وهي سمة ممتازة في حد ذاتها. ولكن، عندما تُدمج مع ميلهم لكونهم سيئين في التخطيط، فإن هذا قد يؤدي إلى أن يعيشوا فوق إمكانياتهم، وتعتبر بطاقات الائتمان خطرًا خاصًا. فهم أكثر تركيزًا على اقتناص الفرص بدلاً من التخطيط للأهداف طويلة المدى، مما قد يؤدي إلى أن يجدوا أن إهمالهم قد جعل بعض الأنشطة غير قابلة للتحمل المالي.

يُرحب بالأشخاص من نوع الشخصية ESFP في أي مكان هناك حاجة للضحك، والمرح، ووجود متطوع لتجربة شيء جديد وممتع – ولا يوجد أكبر سعادة لهذه الشخصيات من أن تأخذ الجميع معها في تلك الرحلة. يمكنهم الدردشة لساعات، أحيانًا حول أي شيء عدا الموضوع الذي كانوا يقصدون التحدث عنه، وهم يشاركون مشاعر أحبائهم في الأوقات الجيدة والسيئة. إذا تمكنوا فقط من تذكر ترتيب أمورهم، فسيكونون دائمًا مستعدين للانغماس في جميع الأشياء الجديدة والمثيرة التي يقدمها العالم، ومعهم أصدقاؤهم.'''),
        ]),
      ])
    ]);
  }
}
