import 'package:flutter/material.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Info_Patterns.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Tab_Patterns.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Tabs_Column.dart';
import 'package:gradution_project/View/features/EachPatternInfo/patterns_structure.dart';
import 'package:gradution_project/View/features/EachPatternInfo/tabslistview.dart';

class Infj extends StatelessWidget {
  const Infj({super.key});

  @override
  Widget build(BuildContext context) {
    return const PatternsStructure(childs: [
      InfoPatterns(
          text1: 'INFJ',
          text2: 'محاور',
          text3:
              '''نوع شخصية المحامي نادر للغاية، حيث يشكلون أقل من واحد في المئة من البشر، لكنهم مع ذلك يتركون بصماتهم على العالم. ولديهم الحس الفطري من المثالية والأخلاق، ولكن ما يجعلهم مختلفين عن أنواع الشخصيات المثالية الأخرى هو حسمهم وعزمهم – فشخصية المحامي ليست الشخصية الحالمة الخمولة، ولكنها القادرة على اتخاذ خطوات ملموسة لتحقيق أهدافها وتحقيق نتائج دائمة إيجابية.''',
          image: 'assets/infj2.png'),
      TabPatterns(tabchilds: [
        TabsListView(childs: [
          TabsCloumn(
              text1: 'عادات مكان العمل',
              text2:
                  '''الأشخاص من ذوي شخصية INFJ (الدعاة) لديهم احتياجات محددة عندما يتعلق الأمر ببيئة عمل مرضية. العمل الأكثر إشباعًا بالنسبة لهم هو الذي يمكنهم من مساعدة الآخرين بينما ينمون كشخصيات. ومن الطبيعي أن تكون الوظيفة المثالية لهذه الشخصية متماشية مع قيمهم الشخصية.

أي شيء يعترض طريق هذه القيم – مثل البيروقراطية، القواعد غير الضرورية، سياسات المكتب، أو الزملاء عديمي الضمير – يمكن أن يستنزف دافع INFJ بشكل كبير. فهذه شخصية تزدهر في بيئات تروج للعدالة والمساواة. ومعظمهم يفضلون ألا يروا أنفسهم أعلى أو أدنى من أي شخص آخر – بغض النظر عن مكانتهم في السلم الوظيفي.'''),
          TabsCloumn(
              text1: 'الموظفون من نوع شخصية INFJ',
              text2:
                  '''يقدر الأشخاص من ذوي شخصية INFJ التعاون والحساسية والاستقلالية. كموظفين، ينجذبون نحو المدراء الذين يتمتعون بعقلية منفتحة ومستعدين للاستماع إلى آرائهم. قد يشعرون بالإحباط عندما يشعرون بأن أصواتهم غير مسموعة، لذا فإن وجود مدير يستمع إليهم يمكن أن يحدث فرقًا كبيرًا.

نظرًا لأن INFJs يميلون إلى التصرف بناءً على قناعاتهم ويسعون دائمًا لتقديم الأفضل، فإن روحهم المعنوية قد تكون حساسة للنقد، خاصة إذا كان غير مبرر. من العوامل الأخرى التي تؤثر سلبًا على معنوياتهم هي القواعد الصارمة، والهياكل الرسمية، والمهام الروتينية. وقد يشعرون بإحباط خاص عندما يُطلب منهم إعادة عملهم، خاصة إذا كان السبب وراء ذلك يبدو غير مبرر لهم.'''),
          TabsCloumn(
              text1: 'مديرين INFJ',
              text2:
                  '''كمديرين، قد لا يستمتع أصحاب شخصية INFJ باستخدام سلطتهم، حيث يفضلون رؤية الجميع على قدم المساواة بغض النظر عن ألقابهم الوظيفية. بدلاً من إدارة التفاصيل الدقيقة لعمل مرؤوسيهم، يفضلون تمكينهم من التفكير والتصرف باستقلالية. يعملون بجد لتشجيع الآخرين وتعزيز جو من الاحترام المتبادل، ويقودون غالبًا من خلال القدوة، مظهرين مستوى عالٍ من النزاهة والتفاني.

هذا لا يعني أن INFJs لديهم معايير منخفضة - بل العكس تمامًا. مفهومهم للمساواة يجعلهم يتوقعون من مرؤوسيهم الالتزام بالمعايير التي يطبقونها على أنفسهم. المديرون من هذا النوع يتوقعون من موظفيهم أن يكونوا دقيقين، ومتحمسين، وموثوقين، وصادقين بلا استثناء، وسيلحظون أي تقصير في هذه الجوانب.

يمكن أن يكون INFJ المدير صارمًا بشكل خاص إذا لاحظ سلوكًا يعتبره غير أخلاقي. فهم لا يتحملون التهاون في الموثوقية أو الأخلاق. ومع ذلك، عندما تتماشى نوايا موظفيهم الجيدة مع نواياهم، يعمل هؤلاء المديرون بلا كلل لضمان شعور فريقهم بالكامل بالتقدير والرضا والنجاح.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'مسارات الحياة المهنية',
              text2:
                  '''بالنسبة للأشخاص من نوع شخصية INFJ (المحامون)، فإن القرارات المهنية لا تُوجَّه بمقاييس النجاح التقليدية مثل المكاسب المالية أو المكانة الاجتماعية، بل بما يحمله عملهم من إمكانيات للتواصل العميق والإشباع الشخصي. يتوق هؤلاء الأشخاص إلى العثور على مهنة تتماشى مع قيمهم وأحلامهم – مهنة تتيح لهم تحقيق رسالتهم الفريدة في هذا العالم.

بالنسبة لهم، لا يُعتبر العمل مرضيًا إذا لم يقدم شعورًا أعمق بالهدف – مهما كان الراتب مغريًا. الخبر السار هو أن الأشخاص من هذه الشخصية يمكنهم استخدام إبداعهم وعزيمتهم للعثور على عمل يلبي احتياجاتهم في أي مجال تقريبًا.'''),
          TabsCloumn(
              text1: 'البحث عن الهدف',
              text2:
                  '''بالنسبة لهذه الشخصيات الإيثارية، يمكن أن تكون الوظائف التي تتضمن مساعدة الناس والتواصل معهم مرضية للغاية. لذلك، ليس من المستغرب أن ينجذب العديد من الأشخاص من نوع شخصية INFJ إلى العمل كمستشارين أو معالجين نفسيين أو علماء نفس أو عاملين اجتماعيين أو معلمين أو مدربي يوغا أو قادة روحيين.
قد يجدون أيضًا متعة في العمل في وظائف قطاع الخدمات التي تتيح لهم التفاعل المباشر وبناء علاقات حقيقية مع عملائهم. وبالنسبة للرعاية الصحية، فهي أيضًا خيارات مهنية مجزية للأشخاص من هذه الشخصية، بما في ذلك وظائف مثل التمريض، العلاج الطبيعي أو المهني، الطب، التغذية، أو المسارات الأكثر شمولية مثل العلاج بالإبر.'''),
          TabsCloumn(
              text1: 'إحساس بالمهمة',
              text2:
                  '''شخصيات INFJ تتميز بمرونة عالية، لكن بعض بيئات العمل قد تتعارض مع طبيعتها. خصوصًا الأماكن التي تفتقر إلى الاستقلالية أو تمنح الموظفين مساحة محدودة للتعبير عن احتياجاتهم وقوتهم الشخصية، مما يجبرهم على اتباع بروتوكولات صارمة ومتكررة. كما قد يواجهون صعوبة في تحمل النقد والضغوط المرتبطة ببيئات العمل التنافسية والقاسية.

لذلك، يسعى العديد من أفراد هذه الشخصية إلى وظائف أكثر مرونة واستقلالية – أو يتجهون لتأسيس أعمالهم الخاصة. وقد يجدون متعة في بناء جسور بين مجالات مهنية تبدو متباعدة، مثل الكتابة عن علم النفس أو العمل كمحامين بيئيين. هذه الوظائف الهجينة تقدم الكثير من الفرص لشخصيات INFJ لاستغلال إبداعهم وحبهم للتعلم.

في الواقع، يمكن لهذه الشخصيات أن تنجح في أي مجال. ولكن لتحقيق السعادة الحقيقية، غالبًا ما يحتاجون إلى العثور على وظائف تتماشى مع قيمهم وتمنحهم قدرًا من الاستقلالية. إنهم يتوقون إلى فرص للتعلم والنمو مع الأشخاص الذين يساعدونهم. وعندما يتحقق ذلك، قد يشعرون أخيرًا بأنهم ينجزون مهمتهم الحياتية ويساهمون في رفاهية الإنسانية على مستوى شخصي'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'الأبوة',
              text2:
                  '''كآباء، يتمتع الأشخاص من نوع شخصية INFJ برؤية واضحة لما يهمهم: تربية أطفالهم ليصبحوا مستقلين وأشخاصًا جيدين بكل الجوانب. يأخذ INFJs مسؤولياتهم بجدية، وعندما يصبحون آباء، يفكرون بعمق في كيفية تشكيل حياة وتجارب أطفالهم بطرق إيجابية.

الأبوة ليست سهلة، ولكن قليل من الناس يتوقعون أن تكون كذلك. يدرك INFJs أن العديد من المساعي الأكثر قيمة في الحياة هي أيضًا الأكثر تحديًا – وهي عقلية تساعدهم في الحفاظ على الشعور بالفرح والرضا وسط صعوبات الحياة اليومية لتربية الأطفال. في كثير من النواحي، تتيح الأبوة للأشخاص من هذا النوع استغلال نقاط قوتهم بشكل رائع، بما في ذلك الإبداع، والتعاطف، والتفاني العميق الذي يشعرون به تجاه أحبائهم.'''),
          TabsCloumn(
              text1: 'كن فريدًا، مثلي تمامًا',
              text2:
                  '''الآباء من نوع شخصية INFJ عطوفون ومخلصون، ومستعدون لفعل أي شيء تقريبًا لتحسين حياة أطفالهم. لكن سيكون من الخطأ الاعتقاد بأن هؤلاء الآباء ضعفاء أو سهلين في التعامل. في الواقع، يمكن أن يكون INFJs صارمين للغاية، حيث إن التزامهم ببناء شخصية أطفالهم على المدى الطويل نادرًا ما يتضاءل أمام الاعتبارات اللحظية.

على الرغم من أنهم يقدمون العديد من الهدايا القيمة في تربية الأطفال، من المهم ملاحظة أنه لا يوجد والد مثالي. في بعض الأحيان، قد يضع الأشخاص من نوع شخصية INFJ معايير غير واقعية لأطفالهم، دون أن يأخذوا في الاعتبار شخصية كل طفل أو مرحلته التنموية. على سبيل المثال، قد يتوقع الوالد INFJ أن يتبنى طفله نفس النزاهة والصدق التي يتوقعها من نفسه، ليشعر بالإحباط عندما يتصرف الطفل بطريقة يراها غير كريمة أو غير أخلاقية. أو قد يدفع INFJs أطفالهم ليكونوا مستقلين ومبدعين وفريدين، ويرون في الرغبة في التوجيه الخارجي أو الالتزام بالمعايير الاجتماعية علامة مثيرة للقلق.'''),
          TabsCloumn(
              text1: 'عملٌ جيد',
              text2:
                  '''يسعى الآباء من نوع شخصية INFJ لضمان أن ينشأ أطفالهم بفهم راسخ للفرق بين الصواب والخطأ. يشجع هؤلاء الآباء أطفالهم على النضال من أجل قضية يؤمنون بها وعلى السعي ليكونوا أفضل نسخة من أنفسهم. بغض النظر عن أعمار أطفالهم، يجد الآباء من هذا النوع الكثير من الرضا والمعنى في مساعدة أطفالهم على تعلم أن يكونوا صادقين مع أنفسهم.
'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'العلاقات الرومانسية',
              text2:
                  '''الأشخاص ذوو شخصية INFJ (المدافعون) يبحثون عن العمق والمعنى في علاقاتهم، ولا تختلف علاقاتهم الرومانسية عن ذلك. تُعرف هذه الشخصية بخيالها النابض والحيوي، لكن قلة قليلة من INFJs يمكنهم تصور أنفسهم يكتفون بعلاقة تعتمد على شيء أقل من الحب الحقيقي

قد يستغرق الأمر وقتًا للعثور على شريك متوافق. قد يعتقد البعض أن INFJs يصعب إرضاؤهم، وهذا صحيح إلى حد ما، حيث يمكن أن تكون هذه الشخصية عرضة لتوقعات غير واقعية. في الواقع، عندما يكونون عُزّابًا، غالبًا ما يميلون إلى بناء صورة مثالية لشريكهم في أذهانهم. قد يشعرون بالإغراء للانتظار من أجل هذا الشريك أو العلاقة "المثالية"، بينما في الواقع، هذا التطابق المثالي قد لا يكون موجودًا.
لكن الخبر السار؟ يمكن للمثالية التي يتمتع بها INFJs – إذا توازنت مع قدر كافٍ من الواقعية – أن تعزز حياتهم العاطفية بشكل كبير.'''),
          TabsCloumn(
              text1: 'هل هذا حقيقي؟',
              text2:
                  '''الأشخاص من ذوي شخصية INFJ يميلون إلى التوافق مع قيمهم الأساسية ويُدركون بعمق ما هو مهم بالنسبة لهم على مستوى الروح. هذا الوعي يساعدهم على تجاوز الانجذاب السطحي وفهم ما إذا كانوا متوافقين مع شخص ما على مستوى أعمق وأكثر معنى.

الأهم من ذلك، أن هذه البصيرة تُعد أساسية لمساعدتهم على تجنب العلاقات التي تفتقر إلى الأصالة أو القيم المشتركة. يهتم أصحاب شخصية INFJ بالنزاهة، ويميلون إلى النفور عندما يحاول الآخرون تغييرهم أو إقناعهم بشيء لا يؤمنون به. ونتيجة لذلك، ينجذبون نحو شركاء يقدّرونهم كما هم.'''),
          TabsCloumn(
              text1: 'قوة الحب',
              text2:
                  '''يميل الأشخاص من نوع شخصية INFJ إلى إدراك أن الحب ليس مجرد شعور عابر، بل هو فرصة للنمو والتعلم. لذلك، يتوقعون من شريكهم أن يشاركهم هذه النظرة العميقة. ونتيجة لذلك، فإن العلاقات مع هذه الشخصيات ليست مخصصة للأشخاص غير الملتزمين أو السطحيين. يتميز INFJs بشغف عميق يتجاوز اللحظة الحالية، وما يحقق لهم الرضا الحقيقي هو الطريقة التي يتطور بها الحب وينمو بمرور الوقت ليصبح أكثر عمقًا ومعنى.

يخلق الأشخاص من نوع شخصية INFJ عمقًا لعلاقاتهم يصعب وصفه بطرق تقليدية. بفضل حساسيتهم وفطنتهم، يستطيعون جعل شريك حياتهم يشعر بأنه مفهوم ومقدر بطريقة جميلة. هؤلاء الأفراد لا يخشون التعبير عن حبهم، ويعيشونه بصدق وبكل جوارحهم.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(text1: 'نقاط القوة', text2: '''مُبَصِّرون 
 الأشخاص الذين يتمتعون بنوع شخصية INFJ (المناصرون) يعرفون تمامًا أن المظاهر قد تكون خادعة. هؤلاء الأشخاص يسعون لتجاوز السطحية والبحث عن الحقائق الأعمق في الحياة. وهذا يمنحهم قدرة شبه غير عادية على فهم دوافع الناس الحقيقية ومشاعرهم واحتياجاتهم.

مبدئيون 
 يميل الأشخاص ذوو شخصية INFJ إلى أن يكون لديهم معتقدات وقيم قوية، خاصة فيما يتعلق بالقضايا الأخلاقية. يعتبرون الكذب أمرًا غير أخلاقي، ويبذلون جهدًا كبيرًا لعدم خداع الآخرين – حتى عندما يمكن أن يستفيدوا بشكل مباشر من ذلك. في الواقع، هم أقل نوع من الشخصيات احتمالًا ليقولوا إنهم أحيانًا يستغلون الآخرين.

شغوفون
 يحتاج الأشخاص ذوو شخصية INFJ إلى الشعور بالهدف في الحياة. بدلاً من العيش على وضع الطيار الآلي أو التمسك بالوضع الراهن، يرغبون في السعي وراء أحلامهم. هذه الشخصية لا تتردد في السعي نحو النجوم – فهم يشعرون بالطاقة والحماس لجمال رؤاهم للمستقبل.

أصحاب نزعة خيرية 
 الأشخاص الذين لديهم هذه الشخصية لا يشعرون بالسعادة إذا نجحوا على حساب شخص آخر. يرغبون في استخدام قوتهم من أجل الخير العام، ونادرًا ما يغيب عن أذهانهم تأثير كلماتهم وأفعالهم على الآخرين. في أعماق قلوبهم، يريدون جعل العالم مكانًا أفضل، بدءًا من الأشخاص من حولهم.
مبدعون – شخصيات INFJ ليست مثل الجميع – وهذا شيء رائع. هم يتبنون جانبهم الإبداعي، دائمًا في بحث عن الفرص للتعبير عن أنفسهم والتفكير خارج الصندوق.'''),
          TabsCloumn(text1: 'نقاط الضعف', text2: '''حساسون للنقد
 غالبًا ما يكون الأشخاص ذوو شخصية INFJ متجنبين للنقد، خاصة إذا شعروا أن شخصًا ما يتحدى مبادئهم أو قيمهم المفضلة. عندما يتعلق الأمر بالقضايا التي تهمهم بشدة، قد يصبح الأشخاص ذوو هذه الشخصية دفاعيين أو متجاهلين أو غاضبين.

متحفظون في التعبير عن أنفسهم 
 على الرغم من أن شخصيات INFJ تقدر الصدق والأصالة، إلا أنهم أيضًا أشخاص خصوصيون. قد يجدون صعوبة في الانفتاح والتعبير عن صراعاتهم، لا يرغبون في تحميل شخص آخر همومهم. وللأسف، عندما لا يطلبون المساعدة، قد يعيقون أنفسهم عن التقدم أو يخلقون مسافة في علاقاتهم.

مثاليون
 تعرف هذه الشخصيات الرؤيوية بأنها مشبعة بالمثالية. وبينما تُعتبر هذه ميزة رائعة من نواحٍ كثيرة، إلا أنها قد لا تترك مساحة لفوضى الحياة الحقيقية. قد يجد الأشخاص ذوو هذه الشخصية صعوبة في تقدير وظائفهم أو أوضاعهم المعيشية أو علاقاتهم إذا كانوا يركزون بشكل مستمر على العيوب ويتساءلون ما إذا كان يجب عليهم البحث عن شيء أفضل.

يتجنبون العادي
الأشخاص ذو شخصية INFJ يتوقون لفعل أشياء استثنائية في حياتهم. ولكن من الصعب تحقيق أي شيء استثنائي دون تحليله إلى خطوات صغيرة وقابلة للإدارة. إذا لم يترجموا أحلامهم إلى روتين يومي وقوائم مهام، فقد يواجهون صعوبة في تحويل رؤاهم العظيمة إلى واقع.

عرضة للإرهاق 
 المثالية والاحتفاظ بالمشاعر داخلهم تترك لشخصيات INFJ قليل من الخيارات لتفريغ ضغطهم. يمكن أن يرهق الأشخاص الذين لديهم هذه الشخصية أنفسهم إذا لم يوازنوا بين دافعهم لمساعدة الآخرين والعناية الذاتية والراحة اللازمة.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'الصداقات',
              text2:
                  '''نادراً ما يكتفي الأشخاص من نوع شخصية INFJ (المدافع) بعلاقات سطحية أو صداقات عابرة. عندما يتعلق الأمر بالرضا الاجتماعي، فإنهم لا يجدون الاكتفاء في التفاعلات العادية مع الزملاء أو زملاء الدراسة. INFJ يتوقون إلى صداقات حقيقية وذات معنى – علاقات تتيح لهم مشاركة أحلامهم، والتعبير عن مشاعرهم بصدق، والشعور بأنهم مفهومون ومقبولون كما هم. وإذا كان ذلك يعني وجود صديق أو اثنين فقط بدلاً من دائرة واسعة من المعارف، فلا بأس بذلك.

على الرغم من أن INFJ قد يبدون هادئين أو متحفظين أمام العالم الخارجي، إلا أن هذه الشخصيات تتألق بشكل واضح عندما تكون مع أصدقائهم المقربين. القليل من الأشياء يجلب لهم السعادة والمتعة مثل الحديث عن شغفهم واهتماماتهم ومعتقداتهم مع روح متشابهة. ورغم استمتاعهم برفقتهم الخاصة، إلا أنهم يجدون شعوراً مبهجاً في إسقاط الحواجز والظهور على طبيعتهم تماماً مع صديق يثقون به.'''),
          TabsCloumn(
              text1: 'البحث عن القلب الذهبي',
              text2:
                  '''يشتهر أصحاب شخصية INFJ بتوقعاتهم العالية – ليس فقط تجاه أنفسهم، ولكن أيضاً تجاه صداقاتهم. في مقدمة هذه التوقعات تأتي الأصالة. إذا كان عليهم أن يتصرفوا بطريقة مصطنعة أو يقللوا من ذاتهم لكسب قبول شخص ما، فمن المحتمل أن هذا الشخص ليس الصديق المناسب لهم. ومن الصعب على INFJ احترام شخص لا يتمتع أيضاً بالصدق والأصالة.

توقع آخر يحمله INFJ تجاه صداقاتهم هو الدعم المتبادل والنمو. قضاء وقت ممتع معاً هو أمر رائع، لكن بالنسبة لهذه الشخصية، فإنه لا يكفي. فهم يرغبون في إحاطة أنفسهم بأصدقاء يلهمونهم للتعلم والتوسع وتحسين أنفسهم. بالنسبة إلى INFJ، فإن الطريقة الأضمن لتعميق الصداقة هي من خلال مساعدة بعضهم البعض على التقدم في مسارات حياتهم ورسالتهم الشخصية.'''),
          TabsCloumn(
              text1: 'الولاء والأصالة',
              text2:
                  '''لحسن الحظ، يتمتع أصحاب شخصية INFJ بالقدرة على العثور على نوعية الأصدقاء الذين يتطلعون إلى لقائهم – ولكن قد يتطلب الأمر منهم بذل مزيد من الجهد والطاقة. وعندما يلتقون بأشخاص يشاركونهم نفس طريقة التفكير، تكون الروابط التي تنشأ عميقة ومؤثرة، مما يجعل البحث عن هؤلاء الأصدقاء يستحق العناء.

يجب أن يتذكر INFJ أن الأصدقاء الذين يبحثون عنهم قد يكونون مختبئين أمام أعينهم، بين معارف لا يعرفونهم بشكل جيد. ورغم أنهم معروفون بقدرتهم الفائقة على تكوين انطباعات أولى دقيقة عن الآخرين، إلا أنه يمكن أن يغفلوا عن الإمكانات العميقة للأشخاص الذين يلتقون بهم يومياً. عندما يمنحون هؤلاء الغرباء فرصة، قد يكتشف INFJ أنهم يتشاركون في القيم والمواقف التي تجعلهم متوافقين على مستوى أعمق.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'مقدمة تعريفية',
              text2:
                  '''مثاليون ومبدئيون، الأشخاص الذين يتمتعون بشخصية INFJ (المحامون) لا يكتفون بالمرور عبر الحياة بلا هدف – بل يسعون للوقوف وإحداث فرق. بالنسبة لهؤلاء الأشخاص المتعاطفين، النجاح لا يتمثل في المال أو المكانة، بل في البحث عن الإشباع، ومساعدة الآخرين، وأن يكونوا قوة للخير في العالم.

على الرغم من أهدافهم وطموحاتهم السامية، لا ينبغي أن يُخطأ في اعتبار INFJ مجرد حالمين كسالى. الأشخاص الذين يتمتعون بهذه الشخصية يهتمون بالنزاهة، ونادرًا ما يشعرون بالرضا حتى يحققوا ما يعرفونه بأنه صحيح. مدفوعون بالضمير إلى أقصى حد، يتحركون في الحياة بوضوح قيمهم، ويهدفون إلى عدم فقدان التركيز على ما هو مهم حقًا – ليس بناءً على آراء الآخرين أو المجتمع بشكل عام، ولكن بناءً على حكمتهم وحدسهم الخاصين.'''),
          TabsCloumn(
              text1: 'البحث عن الهدف',
              text2:
                  '''ربما بسبب ندرة نوع شخصيتهم، يميل أصحاب شخصية INFJ إلى الشعور – سواء بوعي أو دون وعي – بأنهم مختلفون عن معظم الناس. مع حياتهم الداخلية الغنية ورغبتهم العميقة والدائمة في العثور على هدف حياتهم، لا يتناسبون دائمًا مع من حولهم. هذا لا يعني أن شخصيات INFJ لا يمكنها التمتع بالقبول الاجتماعي أو إقامة علاقات وثيقة – بل يعني فقط أنهم يشعرون أحيانًا بسوء الفهم أو بأنهم في حالة تضاد مع العالم.

لحسن الحظ، هذا الإحساس بعدم الانسجام لا يقلل من التزامهم بجعل العالم مكانًا أفضل. هذه الشخصيات تتأثر بالظلم، وعادة ما تهتم بالإيثار أكثر من المكاسب الشخصية. غالبًا ما يشعرون بأنهم مدعوون لاستخدام قوتهم – بما في ذلك الإبداع، والخيال، والحساسية – لرفع مستوى الآخرين ونشر روح التعاطف.'''),
          TabsCloumn(
              text1: 'التواصل مع الآخرين (ومع أنفسهم)',
              text2:
                  '''تقدر شخصيات INFJ العلاقات العميقة والأصيلة مع الآخرين. قلة من الأشياء تجلب لهذه الشخصيات الفرح بقدر معرفة شخص آخر بعمق – والشعور بأنهم معروفون بالمقابل. يفضلون المحادثات ذات المعنى أكثر بكثير من الأحاديث السطحية، وعادةً ما يتواصلون بطريقة دافئة وحساسة. هذا الصدق العاطفي والبصيرة يمكن أن يترك انطباعًا قويًا على من حولهم.

كونهم مفكرين وعادةً ما يكونون غيريين في تعاملهم، فإن شخصيات INFJ تبذل الكثير من الطاقة والاهتمام في علاقاتهم. ولكن هذا لا يعني دائمًا أنهم يشعرون بالتقدير بالمثل. يميل أصحاب هذه الشخصية إلى التروي وتقييم كيفية تأثير أفعالهم على الآخرين قبل اتخاذ أي خطوة. وبالتالي، قد يشعرون بالإحباط عندما لا يدرك الآخرون نواياهم الحسنة. بالإضافة إلى ذلك، فإنهم حساسون جدًا لأي نوع من النقد، وقد يأخذونه بشكل شخصي جدًا.'''),
          TabsCloumn(
              text1: 'مهمة شخصية',
              text2:
                  '''تشعر العديد من شخصيات INFJ بأن حياتهم تحمل غرضًا فريدًا – مهمة تم وضعهم على هذه الأرض لتحقيقها. بالنسبة لهم، يعد السعي لاكتشاف هذا الغرض أحد أكثر جوانب الحياة مكافأة – ثم، بمجرد العثور عليه، يسعون بكل جهدهم لتحقيقه على أكمل وجه.'''),
        ]),
      ])
    ]);
  }
}
