import 'package:flutter/material.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Info_Patterns.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Tab_Patterns.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Tabs_Column.dart';
import 'package:gradution_project/View/features/EachPatternInfo/patterns_structure.dart';
import 'package:gradution_project/View/features/EachPatternInfo/tabslistview.dart';
class Intj extends StatelessWidget {
  const Intj({super.key});

  @override
  Widget build(BuildContext context) {
    return const PatternsStructure(childs: [
      InfoPatterns(
        text1: 'INTJ',
        text2: 'مهندس',
        text3:
            '''يقبع المهندس المعمماري وحيدًا في القمة، وكونه واحدًا من أندر أنواع الشخصيات وأكثرهم قدرة استراتيجيًا،، فالمهندسون المعماريون يعرفون ذلك جيدًا. يمثل المهندسون المعماريون اثنين في المئة فقط من السكان، والنساء اللاتي يتمتعن بهذا النوع من الشخصية نادرات بصورة خاصة، حيث يشكلن 0.8٪ فقط من السكان – وغالبًا ما يكون تحديا بالنسبة لهم العثور على أناس مماثلين لهم في التفكير قادرين على مواكبتهم في نزعتهم العقلانية الدؤوبة ومناوراتهم المماثلة لما يحدث في لُعبة الشطرنج.''',
        image: 'assets/images/intj2.png',
      ),
      TabPatterns(
        tabchilds: [
          TabsListView(childs: [
            TabsCloumn(
                text1: 'عادات مكان العمل',
                text2:
                    '''بغض النظر عن المكان الذي يتواجدون فيه على سلم الحياة المهنية، يريد الأشخاص ذوو شخصية INTJ (المعمارية) متابعة أهدافهم المهنية وفقًا لمعاييرهم الخاصة. وإذا كان هناك أي نوع من الشخصيات التي تمتلك معايير عالية لأنفسهم، فإنها بالتأكيد INTJs. فهم حلّالون للمشكلات بالفطرة، ودائمًا ما يبحثون عن طرق أفضل وأكثر كفاءة لإنجاز المهام.

من الناحية النظرية، فإن هذا الموقف يجعلهم موظفين وزملاء عمل مثاليين. وفي العديد من الجوانب، هم كذلك بالفعل. ولكن هذه الشخصيات قد تكون قاسية أو متجاهلة تجاه الزملاء الذين لا يحترمونهم – وللأسف، قد يكون من السهل جدًا فقدان احترامهم. على وجه الخصوص، قد يواجه INTJs صعوبة في العمل مع الزملاء الذين يفضلون الراحة على الابتكار أو الاجتماع الاجتماعي على النجاح.'''),
            TabsCloumn(
                text1: 'المرؤوسون INTJ',
                text2:
                    '''الأشخاص ذوو شخصية INTJ معروفون باستقلالهم. هم ليسوا خجولين على الإطلاق عندما يتعلق الأمر بأخذ المبادرة، وتصحيح الأخطاء، أو إجراء تحسينات حتى على أصغر العناصر في مشروع عمل. أسوأ كابوس لهم هو وجود مدير يتبع أسلوب الإدارة التفصيلية، يسيطر على وقتهم من خلال اجتماعات عديمة الجدوى، ويصر على قواعد غير مفيدة، أو يقيم أداء الموظفين بناءً على مدى محبوبتهم بدلاً من جدراتهم الفعلية.

الألقاب تعني قليلًا لشخصية INTJ، وغالبًا ما يواجهون صعوبة في التنازل لمدير يعتبرونه أقل ذكاءً منهم. قد يجدون صعوبة في كبح أنفسهم عن تقديم ملاحظات وانتقادات لمديريهم – وهو نهج قد يرتد عليهم بنتائج عكسية، حسب نوع المدير. في الواقع، ليس كل المديرين سيكونون منطقيين أو منفتحين كما قد يفضل INTJs. ولكن هذا لا يعني أن هذه الشخصيات يجب أن تسمح لمدير أقل مثالية بأن يعيقهم.

يمكن لـ INTJs استخدام إبداعهم وابتكارهم لتوسيع مسؤولياتهم وتطوير خبراتهم – حتى لو لم يكن لديهم الاستقلالية التي يتوقون إليها. للقيام بذلك، قد يحتاجون إلى إعطاء الأولوية لبناء علاقة منتجة ومحترمة مع مديرهم، بغض النظر عن مدى بُعد هذا الشخص عن المثالية.'''),
            TabsCloumn(
                text1: 'مديرين INTJ',
                text2:
                    '''الأشخاص ذوو شخصية INTJ معروفون باستقلالهم. هم ليسوا خجولين على بشكل عام، يفضل INTJs أن يعاملوا من يعملون لديهم كأقران. بدلاً من الإدارة التفصيلية، يهدف هؤلاء الأشخاص إلى توجيه الاستراتيجيات الأوسع مع ترك الآخرين للتعامل مع الأنشطة اليومية. ولكن هذا لا يعني أنهم يتجنبون التدخل تمامًا. مديري INTJ يريدون أن يعرفوا بالضبط ما يحدث ومتى، وهم دائمًا مستعدون للجلوس ومراجعة كل تفاصيل صغيرة مع موظفيهم.

يحترم ويكافئ مدراء INTJ السلوك الاستباقي، حيث يقومون بتفويض المسؤوليات للموظفين الذين يمتلكون أقوى مهارات التفكير النقدي. لكن هذه الاستقلالية ليست مجرد هدية – بل هي مطلب. الموظفون الذين يواجهون صعوبة في توجيه أنفسهم – والذين يريدون فقط أن يتم إخبارهم بما يجب عليهم فعله – قد يجدون صعوبة في تلبية معايير هؤلاء المديرين. وأي شخص يحاول تغطية النتائج السيئة بالمدح أو الأعذار من المرجح أن يكون محبطًا، حيث أن هذه الاستراتيجيات تكاد لا تخدع الأشخاص من هذا النوع.لية.'''),
          ]),
          TabsListView(childs: [
            TabsCloumn(
                text1: 'مسارات الحياة المهنية',
                text2:
                    '''الأشخاص الذين يحملون شخصية INTJ (المعمارية) نادرًا ما يشعرون بالرضا عن العمل الذي يكون سهلًا جدًا. هم يريدون مسارًا مهنيًا يشعل فضولهم ويستفيد من ذكائهم، مما يسمح لهم بتوسيع مهاراتهم أثناء مواجهة التحديات والمشكلات ذات المعنى. إذا جعل وصف الوظيفة الشخص العادي يفكر: "واو، يبدو أن هذا صعب"، فقد يكون هذا هو الخيار المثالي لشخصية INTJ.'''),
            TabsCloumn(
                text1: 'مخاوف بداية الحياة المهنية',
                text2:
                    '''البدء من أسفل السلم المهني يمكن أن يكون محبطًا للأشخاص ذوي هذه الشخصية. في بداية حياتهم المهنية، قد يُكلفون بمهام سهلة وروتينية تملُّهم حتى الموت. يتمتع INTJs بأفكار إبداعية وخارج الصندوق. ولكن مع استهجانهم للتودد والسياسة في مكان العمل، قد يواجهون صعوبة في كسب ود رؤسائهم وزملائهم.
الخبر السار هو أنه مع مرور الوقت، يطور العديد من INTJs مهاراتهم ليصبح لديهم سجل حافل لا يمكن تجاهله. حتى عندما يقع الجميع من حولهم ضحية للتفكير الجماعي، يستطيع الأشخاص ذوو هذه الشخصية التمييز بين الضوضاء واكتشاف السبب الحقيقي للمشكلة – ثم إصلاحها. طالما أنهم لا يعزلون زملاءهم، يمكن لهذه الشخصيات التقدم في حياتهم المهنية وكسب النفوذ الذي يحتاجون إليه لتحقيق أفكارهم.'''),
            TabsCloumn(
                text1: 'التحديات الأكبر دائمًا',
                text2:
                    '''شخصيات INTJ تطالب بالتقدم والتطور، ويحبون استكشاف الأفكار الجديدة. مع تقدم حياتهم المهنية، قد ينجذبون إلى المناصب التي تسمح لهم بالتأثير على الاستراتيجيات العامة للشركة أو المنظمة. يسعى العديد من INTJs إلى أدوار ذات تأثير منخفض ولكن مؤثر مثل مديري المشاريع، مهندسي الأنظمة، استراتيجيي التسويق، محللي الأنظمة، المستشارين الإداريين، والاستراتيجيين العسكريين.
يميل الأشخاص ذوو هذه الشخصية إلى أن يكونوا أكثر سعادة في الوظائف التي تسمح لهم بالابتكار والتجربة بطرق كبيرة وصغيرة. لذلك، ليس من المفاجئ أن تكون الوظائف في الهندسة، البحث، العلوم، والتكنولوجيا خيارات شائعة بالنسبة لـ INTJs – ولكن المجالات الإبداعية، من الهندسة المعمارية إلى تأليف الموسيقى وتصميم ألعاب الفيديو، يمكن أن ترضي أيضًا نزعتهم الابتكارية. ورغبة INTJs المستمرة في الوصول إلى جوهر الأمور قد تقودهم إلى وظائف مثل المدققين، المتخصصين في الأمن السيبراني، أو محللي الأعمال.

الحقيقة هي أن الأشخاص ذوي شخصية INTJ يمكنهم تطبيق قوتهم في أي دور تقريبًا. على سبيل المثال، في بيئة التجزئة، قد يقودهم فضولهم اللامحدود إلى التحقيق في ما يجعل عرضًا واحدًا في واجهة المتجر أكثر فعالية من آخر. بعض المهن التي تتضمن مكونات اجتماعية قوية، مثل المبيعات أو الموارد البشرية، قد لا تبدو تناسبًا واضحًا – ولكن لحسن الحظ، يعرف INTJs كيف ينظرون إلى ما وراء الواضح.

إبداعيون ورؤيويون، يريد INTJ العثور على مهنة تستفيد من مواهبهم الفريدة. قليل من الشخصيات، إن وجدت، يمكنها أن تنافس قدرتهم على تحويل الأفكار المعقدة إلى استراتيجيات واضحة وقابلة للتنفيذ. هؤلاء الأفراد يعرفون كم يمكنهم تقديمه للعالم من خلال عملهم – وأولويتهم هي التأكد من أن موقعهم، مهما كان، يستخدم مهاراتهم ومعرفتهم وذكائهم بشكل كامل.'''),
          ]),
          TabsListView(childs: [
            TabsCloumn(
                text1: 'الأبوة',
                text2:
                    '''الأشخاص الذين يحملون شخصية INTJ (المعمارية) معروفون بعقلانيتهم والتحكم الذاتي، وقد يشعرون بالدهشة تجاه أي شخص لا يشاركهم هذه القوة – مثل الأطفال. بالنسبة لهذا النوع، يتطلب الأبوة والأمومة تعلم مهارات جديدة وتطوير مرونة فكرية. لحسن الحظ، فإن شخصيات INTJ دائمًا ما تكون على استعداد للتحدي – ولمن لديهم أطفال، يمكن أن تكون الأبوة والأمومة تحديًا ذا معنى خاص يمكنهم مواجهته.

كآباء، غالبًا ما يتعامل INTJs مع الدور بحس من الجدية والالتزام. يرون أنفسهم ليس فقط كراعين ولكن أيضًا كمرشدين لا غنى عنهم، مسؤولين عن المساعدة في تشكيل عقل أطفالهم، وفرض الانضباط، وتحفيز فضولهم الطبيعي.'''),
            TabsCloumn(
                text1: 'التواصل السليم',
                text2:
                    '''شخصيات INTJ تريد لأطفالهم أن يكبروا ليكونوا قادرين ومستقلين، ولديهم اهتمامات واضحة ومهارات تفكير نقدي قوية. بدلاً من فرض قواعد غير مجدية، يبحث الآباء من هذا النوع عن طرق مناسبة للعمر لتعزيز استقلالية أطفالهم. ولكن هذا لا يعني أنهم متساهلون – على العكس تمامًا. يتوقع INTJs من أطفالهم استخدام حريتهم بشكل مسؤول، وهم ليسوا من النوع الذي يشعر بالذنب إذا اضطروا إلى قول "لا" لأطفالهم.'''),
            TabsCloumn(
                text1: 'فوضى المشاعر',
                text2:
                    '''مقارنةً بالعديد من أنواع الشخصيات الأخرى، لا يشعر INTJs بالراحة بشكل خاص عند إظهار المودة. قد يبدو إغراق شخص ما بالحب والمدح أمرًا غير طبيعي بالنسبة لهم – حتى وإن كان ذلك الشخص هو طفلهم الخاص. لكن الأطفال يحتاجون إلى العناق والموافقة وتعابير أخرى عن الحب، خاصة خلال سنواتهم الأولى. نتيجة لذلك، قد يحتاج الآباء من هذا النوع إلى توسيع منطقة الراحة العاطفية لديهم لكي يظهروا لأطفالهم مقدار حبهم لهم.
تحدٍ آخر للآباء من هذا النوع هو تقديم الدعم العاطفي. يفخر INTJs بقدرتهم على التحكم في مشاعرهم، وقد يتوقعون (بشكل واعٍ أو غير واعٍ) أن يكون أطفالهم قادرين على القيام بالمثل. لكن هذا التوقع ليس معقولًا – فالمشاعر قد تكون مربكة، وأحيانًا فوضوية، لكنها طبيعية تمامًا، والأطفال يحتاجون إلى التحقق والدعم للتعامل معها.'''),
            TabsCloumn(
                text1: 'الإستعدادت لتحديات الحياة',
                text2:
                    '''يحاول الآباء من نوع INTJ التأكد من أن أطفالهم مستعدون للتعامل مع أي شيء قد يواجهونه في الحياة. يمتلك الآباء من هذا النوع موهبة في إعادة صياغة التحديات كفرص للتعلم – ومن خلال ذلك، يمكنهم إلهام أطفالهم لتطوير أسلوبهم الخاص في التفكير العقلاني وحل المشكلات. مع مرور الوقت، يمكن للأطفال من INTJs تطبيق هذه المهارات على مواقف أكثر تعقيدًا، مما يعزز ثقتهم بأنفسهم مع تقدمهم في العمر.

لكل والد حلم مختلف لمستقبل طفله. بالنسبة لشخصيات INTJ، الحلم هو تربية شخص بالغ كفء يعرف عقله ويحل مشكلاته بنفسه. فهم يدركون أن هذا لن يحدث إذا قاموا بحماية أطفالهم من كل شيء صعب أو غير سار في الحياة. لكن أملهم هو أنه إذا قدموا لأطفالهم الأدوات الصحيحة، فلن يكونوا مضطرين لذلك.'''),
          ]),
          TabsListView(childs: [
            TabsCloumn(
                text1: 'العلاقات الرومانسية',
                text2:
                    '''أصحاب شخصية INTJ (المعروفون بالمعماريين) يتعاملون مع الرومانسية كما يفعلون مع معظم التحديات: بشكل استراتيجي، مع أهداف واضحة وخطة لتحقيقها. في عالم عقلاني بحت، سيكون هذا النهج محكمًا، لكن أمور الحب نادرًا ما تكون عقلانية. وبالتالي، فإنهم معرضون لخطر التغاضي عن أو تفسير طبيعة البشر وعواطفهم بشكل غير دقيق.

بالنسبة لهذه الشخصيات، فإن إيجاد شريك متوافق يمكن أن يكون تحديًا خاصًا. كونهم منطقيين بطبعهم، لا يسعى أصحاب شخصية INTJ إلى الرفقة فقط، بل أيضًا إلى التحفيز الفكري من شريكهم – وهو سعي نادر يحمل تحدياته ومكافآته الفريدة. علاوة على ذلك، فهم نادرًا ما يشعرون بالرضا. لا يستطيعون التوقف عن تخيل كيف يمكن للعالم أن يكون أفضل مما هو عليه بالفعل – وغالبًا ما يطبقون نفس العقلية في مجال الحب. للأسف، إذا طبقوا نظرة نقدية بلا رحمة على كل شريك محتمل، قد يجد الأشخاص من هذا النوع أنفسهم دائمًا في حالة من الاستياء المستمر.'''),
            TabsCloumn(
                text1: 'مشاكل المواعدة',
                text2:
                    '''يقدر أصحاب شخصية INTJ العمق، والذكاء، والصدق التام. بالنسبة لهم، العلاقة التي لا تُبنى على هذه القيم ببساطة لا تستحق المتابعة. فهم يفضلون البقاء عازبين على أن يضطروا لإقامة علاقة زائفة لمجرد أن يكونوا مع شخص ما. قد لا يكون من المفاجئ، إذًا، أن القواعد غير المكتوبة والآداب الاجتماعية في عالم المواعدة قد تبدو لهم عديمة الفائدة أو حتى مهينة.

الخبر الجيد هو أن صراحة أصحاب شخصية INTJ ورفضهم للعب الألعاب الاجتماعية يمكن أن يكونا تنفسًا منعشًا في عالم المواعدة. الخبر السيء؟ العديد من العادات الرومانسية موجودة لسبب ما – وغالبًا لأنها تجعل الناس يشعرون بالراحة أو التميز أو الفضول. وعندما يرفض أصحاب شخصية INTJ التفاعل وفقًا لهذه القواعد، قد يجدون أن المواعدة تصبح صعبة، إن لم تكن مستحيلة.'''),
            TabsCloumn(
                text1: 'المرض العاطفي',
                text2:
                    '''شخصية INTJ ليست معروفة بالعروض التقليدية للرومانسية، مثل إرسال الزهور أو كتابة الملاحظات الرومانسية. معظم الأشخاص الذين يحملون هذه الشخصية يقضون وقتًا أطول في التفكير في الحب أكثر من التعبير عنه. ولكن عندما يعتقدون أن العلاقة تحمل إمكانيات حقيقية، فإن INTJs قادرون على إعطائها كل ما لديهم، حتى وإن كان ذلك يعني الخروج من منطقة راحتهم.

وعلاقة صحية وطويلة الأمد ستؤدي بالتأكيد إلى إخراج هذه الشخصيات من منطقة راحتهم في مرحلة ما. على وجه الخصوص، قد تكون العواطف بالنسبة لهم لغة ثانية. عندما يشارك شريكهم مشاعر قوية، غالبًا ما يفضل INTJs إغلاق أنفسهم أو تحليل الموقف بدلاً من مجرد الاستماع وتقديم الدعم. وعندما يحين الوقت لمشاركة أعماق قلوبهم الخاصة، قد يشعرون بعدم الراحة وكأنهم مكشوفون. بالنسبة لهذه الشخصيات، يصبح التكيف مع مشاعر شريكهم – ومشاعرهم الخاصة – عملية تحتاج إلى الكثير من الممارسة.'''),
          ]),
          TabsListView(childs: [
            TabsCloumn(
                text1: 'نقاط القوة',
                text2:
                    '''الأشخاص الذين يمتلكون شخصية INTJ (المهندسون المعماريون) يفخرون بقدرتهم العقلية. يمكنهم إعادة صياغة أي تحدٍ كفرصة لتحسين مهاراتهم في التفكير المنطقي وتوسيع معرفتهم، ومع هذا المنهج، يمكنهم ابتكار حلول حتى لأصعب المشكلات.

مطلع
قلة من الشخصيات تكون مكرسة مثل شخصية INTJ لتطوير آراء عقلانية وصحيحة ومعتمدة على الأدلة. بدلاً من التخمينات أو الافتراضات غير المدروسة، يعتمدون في استنتاجاتهم على البحث والتحليل. وهذا يمنحهم القوة للدفاع عن أفكارهم حتى في مواجهة الخلافات.

مستقل
بالنسبة للأشخاص الذين يمتلكون هذه الشخصية، فإن التكيف مع الآخرين يعني إلى حد ما السقوط في الرتابة. فالمبدعون والمتحفزون ذاتيًا يسعون لفعل الأمور بطريقتهم الخاصة. يمكنهم تصور قليل من الأشياء التي قد تكون محبطة مثل السماح للقواعد أو الأعراف العشوائية بأن تقف في طريق نجاحهم. علاوة على ذلك، هم سعداء باتخاذ القرارات دون حاجة إلى تدخل من الآخرين أو آراءهم. هؤلاء الأفراد يفضلون أخذ الأمور بأيديهم.

مصمم 
تشتهر هذه الشخصية بالطموح والتوجه نحو الأهداف. لن يستريح الأشخاص ذوو شخصية INTJ حتى يحققوا تعريفهم الخاص للنجاح، والذي غالبًا ما يتضمن إتقان المواضيع والمجالات التي تهمهم. هم ليسوا معروفين باتخاذ الطريق السهل، بل يشعرون أن السبيل الوحيد لتحقيق العظمة هو مواجهة التحديات مباشرة.

فضول 
الأشخاص ذوو شخصية INTJ مفتوحون للأفكار الجديدة طالما كانت هذه الأفكار عقلانية ومعتمدة على الأدلة. بطبيعتهم متشككون، هم يميلون إلى وجهات النظر غير التقليدية أو المخالفة. وإذا أثبتت الحقائق أنهم على خطأ، فإنهم عادةً ما يكونون مستعدين لتعديل آرائهم.

أصليون 
بدون شخصية INTJ، سيكون العالم مكانًا أقل إثارة للاهتمام. إن طبيعتهم المتمردة مسؤولة عن بعض من أكثر الأفكار والاختراعات غير التقليدية في التاريخ. حتى في حياتهم اليومية، يُجبر هؤلاء الأشخاص من حولهم على التفكير بطرق جديدة (وأحيانًا مفاجئة).'''),
            TabsCloumn(text1: 'نقاط الضعف', text2: '''متفاخر 
قد يكون الأشخاص ذوو شخصية INTJ على دراية كبيرة، لكنهم ليسوا معصومين عن الخطأ. قد يؤدي تأكيدهم على أنفسهم إلى إعاقتهم عن الاستفادة من المدخلات المفيدة من الآخرين – خصوصًا أولئك الذين يرونهم أدنى فكريًا. يمكن أن يظهر هؤلاء الأشخاص أيضًا على أنهم قساة أو أحاديون للغاية في محاولاتهم لإثبات خطأ الآخرين.

تجاهل العواطف 
بالنسبة لهذا النوع، العقلانية هي الملك. لكن السياق العاطفي غالبًا ما يكون أكثر أهمية من ما يود الأشخاص ذوو هذه الشخصية الاعتراف به. يمكن أن يصبحوا غير صبورين مع أي شخص يبدو أنه يقدر المشاعر أكثر من الحقائق. للأسف، تجاهل العاطفة هو نوع من التحيز بحد ذاته – وهو ما قد يعكر حكم هذا النوع من الشخصيات.

انتقاديون بشكل مفرط
يميل هؤلاء الأشخاص إلى امتلاك قدر كبير من ضبط النفس، خاصة فيما يتعلق بالأفكار والمشاعر. عندما يفشل الأشخاص في حياتهم في الوصول إلى نفس مستوى ضبط النفس، قد يظهرون كناقدين بشكل قاسٍ. ولكن هذه الانتقادات قد تكون غير عادلة – بناءً على معايير تعسفية بدلاً من فهم كامل للطبيعة البشرية.

محاربون
الأشخاص ذوو هذه الشخصية يكرهون اتباع أي شيء بشكل أعمى دون فهم السبب وراءه. يشمل ذلك القيود والأشخاص الذين يفرضونها. قد ينشغل هؤلاء الأشخاص في الجدال حول القواعد واللوائح التي لا فائدة منها – ولكن في بعض الأحيان تكون هذه المعارك بمثابة تشتيت عن أمور أكثر أهمية.
غير مدركين اجتماعيًا – قد تؤدي العقلانية المستمرة لشخصيات INTJ إلى إحباطات في حياتهم الاجتماعية. قد تتركهم محاولاتهم لتحدي التوقعات يشعرون بالعزلة أو الانفصال عن الآخرين. في بعض الأحيان، قد يصبح هؤلاء الأشخاص متشائمين بشأن قيمة العلاقات بشكل عام، متسائلين عن أهمية الحب والاتصال.'''),
          ]),
          TabsListView(childs: [
            TabsCloumn(
                text1: 'الصداقات',
                text2:
                    '''شخصيات INTJ، الذين يعرفون أيضًا بالمعماريين، يتمتعون بسرعة بديهة وفكاهة داكنة، وهم ليسوا بالنسبة للجميع – وهم على ما يرام مع ذلك. في الغالب، لا يهتمون حقًا بأن يُعتبروا "مُرَحب بهم" أو "مُميزين". كما أنهم لا يخصصون وقتهم وطاقتهم لأي شخص. بدلاً من ذلك، يفضلون الاحتفاظ بأنفسهم لأصدقائهم الذين يمكنهم مواكبة فضولهم الفكري وسرعة تفكيرهم.

قد تكون لشخصيات INTJ سمعة بأنها صعبة في التعرف عليها، لكن سيكون من الخطأ تصنيف هذا النوع من الشخصيات على أنه غير اجتماعي أو غير ودود. فهم يتمتعون بمتعة صحبتهم لأنفسهم وعقولهم الخاصة، لكنهم أيضًا يتوقون إلى علاقات هادفة مع الأصدقاء. في الواقع، لا يوجد شيء أكثر إثارة لشخصيات INTJ من الشعور بالشرارة التي يشعرون بها عندما ينغمسون في محادثة مع شخص يفهمهم حقًا'''),
            TabsCloumn(
                text1: 'صداقة فريدة',
                text2:
                    '''في صداقاتهم، كما في جوانب حياتهم الأخرى، يقدّر أصحاب شخصية INTJ الاستقلالية. قد يشعر الأشخاص الذين يحملون هذه الشخصية بأن الالتزامات الاجتماعية خانقة لهم. لا يريدون أن يشعروا بأنهم ملزمون تجاه أصدقائهم، ولا يريدون أن يشعر أصدقاؤهم بأنهم مدينون لهم. بالنسبة لـ INTJs، الصداقة المثالية هي تلك التي تكون بسيطة، خالية من الدراما، وقائمة على الاستمتاع الحقيقي بصحبة بعضهم البعض بدلاً من الالتزامات.

شخصيات INTJ مخلصة بشدة ويذهبون بعيدًا لمساعدة الأشخاص الذين يقدرونهم ويحترمونهم. سيوفرون بكل سرور قدرتهم الفائقة على حل المشكلات لخدمة تحديات أصدقائهم، مما يساعدهم ليس فقط بالطمأنينة ولكن أيضًا من خلال تقديم حلول منطقية وقابلة للتنفيذ واستراتيجيات مدروسة بعناية. ومع ذلك، من المهم ملاحظة أنه بينما يكون INTJs مستعدين للمساعدة، فإنهم قد يكونون غير مدركين لتجاهل المشاعر العاطفية التي لا يمكن حلها بشكل منطقي.'''),
            TabsCloumn(
                text1: 'مباراة فكرية',
                text2:
                    '''ليس من السهل دائمًا تكوين صداقة مع شخص يحمل هذه الشخصية. هؤلاء الأفراد لديهم صبر قليل تجاه القواعد الاجتماعية أو التوقعات، ويفضلون قضاء الوقت بمفردهم على قضاء الوقت مع شخص يملهم أو يزعجهم. يميل أصحاب شخصية INTJ إلى أن يكون لديهم فكرة واضحة عما يتوقعونه من حياتهم الاجتماعية وأصدقائهم، ولا يرغبون في إضاعة الكثير من الوقت مع أي شخص لا يبدو أنه يلبي هذه التوقعات.

من الخارج، قد يبدو هذا التصرف متجاهلاً، ولكن الحقيقة هي أن العديد من أصحاب شخصية INTJ لديهم قدرة خاصة على إيجاد أصدقاء في أماكن غير متوقعة. هؤلاء الأشخاص لا يتأثرون بشكل كبير بالمظاهر أو الوضع الاجتماعي، لذا فهم ليسوا خائفين من تكوين صداقات مع أشخاص قد يُعتبرون "غرباء" من قبل المجتمع العام. عند تقييمهم لصديق محتمل، لا يهتم أصحاب شخصية INTJ بشعبية الشخص بقدر اهتمامهم بقيمه ومدى توافقها مع قيمهم الخاصة، مثل الذكاء، والصدق، والتحسين الذاتي، أو ببساطة امتلاك منظور مختلف.
في الصداقة، يبحث أصحاب شخصية INTJ عن تطابق فكري بقدر ما يبحثون عن أي شيء آخر. فهم يتوقون إلى التحفيز العقلي، ويميلون إلى الاستمتاع أكثر مع الأصدقاء الذين يستطيعون تحدي أفكارهم، وتعريضهم لمفاهيم جديدة، وتوجيه المحادثات في اتجاهات غير متوقعة.'''),
          ]),
          TabsListView(childs: [
            TabsCloumn(
                text1: 'مقدمة تعريفية',
                text2:
                    '''الأشخاص من نوع شخصية INTJ (المعروفين بالمعماريين) هم أفراد فضوليون فكريًا ولديهم عطش عميق للمعرفة. يميل المعماريون إلى تقدير الإبداع والابتكار، والمنطق المباشر، والتحسين الذاتي. يعملون باستمرار على تعزيز قدراتهم العقلية وغالبًا ما يكونون مدفوعين برغبة شديدة في إتقان أي موضوع يثير اهتمامهم.

منطقيون وسريعو البديهة، يفتخر أصحاب شخصية INTJ بقدرتهم على التفكير بأنفسهم، ناهيك عن قدرتهم الفائقة على رؤية الزيف والنفاق بوضوح. نظرًا لأن عقولهم لا تهدأ أبدًا، قد يواجه هؤلاء الأشخاص صعوبة في العثور على أشخاص يمكنهم مواكبة تحليلاتهم المستمرة لكل شيء حولهم. ولكن عندما يجدون أفرادًا يشبهونهم في التفكير ويقدرون شدتهم وعمق تفكيرهم، فإنهم يقيمون علاقات عميقة ومحفزة فكريًا، يعتزون بها كثيرًا.'''),
            TabsCloumn(
                text1: 'روح ريادية',
                text2:
                    '''شخصيات INTJ يشككون في معظم الأمور، ويستندون في معتقداتهم على الأدلة الصلبة، والتفكير المنطقي، والعقلانية. العديد من أنواع الشخصيات الأخرى يثقون في الوضع الراهن، ويعتمدون على الحكمة التقليدية وخبرة الآخرين لتوجيه حياتهم. ولكن، يميل المعماريون INTJ إلى تفضيل اكتشافاتهم الخاصة. في سعيهم لإيجاد طرق أفضل لإنجاز الأمور، لا يخشون كسر القواعد أو مواجهة الانتقاد – بل في الواقع، غالبًا ما يستمتعون بذلك.

لكن كما سيخبرك أي شخص يحمل هذه الشخصية، فإن الفكرة الجديدة لا قيمة لها ما لم تكن فعّالة بالفعل. يريد المعماريون أن يكونوا ناجحين، وليسوا فقط مبتكرين. يجلبون حافزًا قويًا لعملهم، ويطبقون كامل قوتهم الفكرية والمنطقية وإرادتهم لتحقيق أهدافهم. لديهم صبر قليل تجاه أي شخص يحاول إبطاء تقدمهم بفرض قواعد غير ذات جدوى أو تقديم نقد غير مدروس – ومع ذلك، فإن الملاحظات الذكية مرحب بها عمومًا.

يتميز أصحاب شخصية INTJ بروح الاستقلالية القوية. لا يمانعون في العمل بمفردهم – في الواقع، يفضلون غالبًا أن يكونوا في صحبة أنفسهم – ربما جزئيًا لأنهم لا يحبون الانتظار حتى يتمكن الآخرون من مواكبتهم. الأشخاص من هذا النوع غالبًا ما لا يواجهون أي مشكلة في اتخاذ القرارات دون استشارة الآخرين. في بعض الأحيان، قد يظهر هذا السلوك كنوع من القسوة، حيث لا يأخذ في اعتباره أفكار الآخرين ورغباتهم وخططهم.
لكن سيكون من الخطأ اعتبار شخصيات INTJ على أنها غير مبالية. بغض النظر عن الصور النمطية التي تتعلق بعقولهم الهادئة، فإنهم يشعرون بعمق. عندما تسير الأمور بشكل خاطئ أو عندما يضرون بالآخرين، يتأثرون شخصيًا ويقضون وقتًا وجهدًا كبيرين في محاولة فهم السبب وراء ما حدث. قد لا يقدرون العاطفة كأداة لاتخاذ القرارات، ويجدون صعوبة في التواصل مع الأشخاص الذين يتصرفون بناءً على مشاعرهم، لكنهم يظلون بشرًا حقيقيي'''),
            TabsCloumn(
                text1: 'عطش المعرفة',
                text2:
                    '''شخصيات INTJ يمكن أن تكون في ذات الوقت من أكثر الحالمين جرأة وأكثر المتشائمين مرارة. يعتقدون أنه من خلال الإرادة والقوة العقلية، يمكنهم تحقيق حتى أصعب الأهداف. يؤمنون بشدة بأن اختيار الطريق السهل في أي موقف يمنع الناس من تحقيق العظمة. ومع ذلك، قد يكونون متشائمين تجاه الطبيعة البشرية بشكل عام، ويعتقدون أن معظم الناس كسالى، وغير مبدعين، أو ببساطة محكوم عليهم بالتفوق المتوسط.

يستمد الأشخاص ذوو شخصية INTJ الكثير من احترامهم لذاتهم من معرفتهم وذكائهم العقلي. في المدرسة، قد يكونون قد وُصفوا بـ "دراسات الكتب" أو "المنغمسين في المعرفة". لكن بدلاً من اعتبار هذه الألقاب إهانة، يتبنى العديد من الأشخاص بهذا النوع هذه التسميات. إنهم يعترفون بقدرتهم على تعليم أنفسهم عن أي موضوع يثير اهتمامهم، سواء كان ذلك في البرمجة أو الكابويرا أو الموسيقى الكلاسيكية.

شخصيات INTJ لا يتعلمون الأشياء الجديدة فقط من أجل التوسع المعرفي، بل يسعون لإتقانها أيضًا، حيث يرون في ذلك تحديًا حقيقيًا ويستمتعون بتطوير مهاراتهم وتحقيق التميز في أي مجال يدخلون فيه.'''),
          ]),
        ],
      )
    ]);
  }
}
