import 'package:flutter/material.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Info_Patterns.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Tab_Patterns.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Tabs_Column.dart';
import 'package:gradution_project/View/features/EachPatternInfo/patternsstructure.dart';
import 'package:gradution_project/View/features/EachPatternInfo/tabslistview.dart';

class Intp extends StatelessWidget {
  const Intp({super.key});

  @override
  Widget build(BuildContext context) {
    return const Patternsstructure(childs: [
      Infopatterns(
        text1: 'INTP',
        text2: 'منطقي',
        text3:
            '''الأشخاص الذين يتمتعون بنوع الشخصية INTP (المنطقيون) يفخرون بوجهة نظرهم الفريدة وذكائهم القوي. لا يستطيعون إلا أن يتأملوا في أسرار الكون – وهذا قد يفسر لماذا كان بعض من أكثر الفلاسفة والعلماء تأثيرًا في التاريخ من INTP. يميل الأشخاص الذين يتمتعون بهذا النوع من الشخصية إلى تفضيل الوحدة، حيث يمكنهم بسهولة الانغماس في أفكارهم عندما يُتركون بمفردهم. كما أنهم مبدعون ومخترعون للغاية، ولا يخافون من التعبير عن طرق تفكيرهم الجديدة أو التميز عن الجماهير.''',
        image: 'assets/intp2.png',
      ),
      Tabpatterns(tabchilds: [
        TabsListView(childs: [
          TabsCloumn(
              text1: 'عادات مكان العمل',
              text2:
                  '''بالنسبة للأشخاص من نمط شخصية INTP (المنطقيين)، فإن مكونات الرضا في مكان العمل بسيطة إلى حد ما – على الأقل من الناحية النظرية. يتوق أصحاب هذه الشخصية إلى التحفيز الفكري، والحرية في متابعة أفكارهم، وفرص لحل الألغاز المعقدة. وإذا تمكنوا من تلبية هذه الاحتياجات مع تقليل الالتزامات الاجتماعية والمهام الإدارية الروتينية، فسيكون ذلك أفضل!

ورغم أن البعض من هذه الشخصية قد يسخرون من الفكرة، إلا أنهم غالبًا ما يقدمون أفضل أداء لديهم عند العمل بالتعاون مع الآخرين. يميل INTP إلى العيش في عقولهم، حيث تأتيهم الأفكار والرؤى أسرع مما يستطيعون معالجتها أو تنفيذها. قد يشعرون أحيانًا بالانزعاج عندما يطلب منهم المديرون أو الزملاء التوقف قليلاً لترتيب أفكارهم والعمل على كيفية تنفيذها. لكن على المدى الطويل، يمكن لمثل هؤلاء الزملاء أن يكونوا السر وراء نجاح أصحاب هذه الشخصية.'''),
          TabsCloumn(
              text1: 'الموظفون من نوع شخصية INTP',
              text2:
                  '''في ظل الظروف المناسبة، يمكن لموظفي INTP أن يكونوا مبتكرين وفعّالين للغاية، حيث يتمكنون بسهولة من فهم المشاكل المعقدة التي توكل إليهم. قدراتهم الفريدة على الانغماس في المهام وتصوّر الحلول الإبداعية تجعلهم أصولًا لا تقدر بثمن في أماكن العمل. ومع ذلك، فإن تفضيلهم للعمل الفردي وأحيانًا نسيانهم للمهام الروتينية أو التفاصيل قد يُنظر إليه على أنه عيب.

غالبًا ما يشعر المنطقيون بإغراء تأجيل المهام التي تبدو مملة أو غير مهمة بالنسبة لهم، ولكن حتى "يدفعوا مستحقاتهم" من خلال القيام بهذه المهام، ربما لن يمنحهم مدراؤهم الحرية والمرونة التي يتطلعون إليها. وعلى الرغم من أن الأشخاص من هذا النوع قد يرغبون في تخطي هذه المراحل للوصول مباشرة إلى الأمور المثيرة للاهتمام، إلا أنهم بحاجة إلى إثبات أنفسهم أمام مديريهم أولاً.

الأخبار الجيدة:
يمكن أن يساعدهم الوقت الذي يقضونه في أسفل سلم الوظيفة على تطوير مهارات وعادات جديدة ستفيدهم لاحقًا في مسيرتهم المهنية. ورغم أن لديهم العديد من نقاط القوة، إلا أن إتمام المشاريع لا يُعتبر من بين نقاط قوتهم الأساسية. قد يشعر موظفو INTP بالضيق بسبب الرقابة والقيود التي يواجهونها في بداية حياتهم المهنية، أو يمكنهم استخدام تلك المحاسبة والهيكلية الإضافية لصالحهم، مما يساعدهم على أن يصبحوا أكثر كفاءة في تحويل أفكارهم إلى واقع.'''),
          TabsCloumn(
              text1: 'مديرين INTP',
              text2:
                  '''عمومًا، لا يهتم الأشخاص من نوع شخصية INTP (المنطقيون) بالسعي للسلطة أو التحكم في الآخرين، لكنهم غالبًا ما يستمتعون بتولي المناصب الإدارية. عندما يكونون في موقع القيادة، يفضلون تفويض المهام الإدارية التي يجدونها مملة للتركيز على الأمور الممتعة بالنسبة لهم: ابتكار أفكار جديدة.
كمدراء:
التسامح والمرونة:يميل مدراء INTP إلى التسامح والانفتاح على الاقتراحات، بشرط أن تكون منطقية ومدعومة بحجج قوية. كما يمنحون موظفيهم قدرًا كبيرًا من الحرية في العمل.
معايير عالية:يمنحون الحرية للموظفين، لكن هذه الحرية تأتي بثمن – إذ إن مدراء INTP لديهم توقعات عالية. يتوقعون أن يفهم الآخرون رؤاهم بسرعة ويقدموا أفكارًا تعادل رؤاهم في الجودة والإبداع.
النقد المباشر:يتميز هؤلاء المدراء بالقدرة على ملاحظة التناقضات أو الأخطاء بسرعة في عمل فريقهم، وقد لا يترددون في تقديم ملاحظات نقدية مباشرة.
التوازن بين النقد والتشجيع:مع اكتسابهم الخبرة، يدرك مدراء INTP أهمية موازنة النقد بالتشجيع. يساعد هذا التوازن في رفع معنويات الفريق وتحقيق نتائج أفضل.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'مسارات الحياة المهنية',
              text2:
                  '''أصحاب شخصية INTP (المنطقيون) غالبًا ما يجدون صعوبة في العثور على وظائف ومسارات مهنية تناسبهم حقًا.كونهم أشخاصًا مفكرين بحرية وغريبي الأطوار مع رؤى فريدة للعالم، فإن البيئات العملية التقليدية نادرًا ما تكون مصممة لتلبية احتياجاتهم.

ومع ذلك، بقليل من الابتكار والإبداع، يمكن لأصحاب هذه الشخصية العثور على وظائف تستفيد بشكل كامل من نقاط قوتهم – مثل الإبداع، والشغف بالأفكار، وروح الابتكار. هذه الصفات، كحال العديد من الأمور المتعلقة بهذه الشخصية، نادرة. ونتيجة لذلك، يمكنهم – مع بعض الجهد – إيجاد طرق للتميز في مجموعة واسعة من المجالات.'''),
          TabsCloumn(
              text1: 'دعوة للاستكشاف',
              text2:
                  '''يطمح أصحاب شخصية INTP إلى الاستكشاف، ولكن ليس بالطرق التقليدية.
إنهم ينجذبون إلى عوالم النظريات والأفكار، متحمسين للغوص تحت سطح الحياة اليومية واستكشاف ألغاز الكون. بروحهم الفضولية، يمكنهم العثور على الجمال في مفاهيم قد تبدو مملة للآخرين. يتم تمثيل شخصية INTP بشكل جيد بين علماء الرياضيات والمحللين والباحثين والعلماء، لا سيما في المجالات الأكثر تجريدًا مثل الفيزياء. كما يمكن أن تتناسب الوظائف في الهندسة والتكنولوجيا مع شخصيتهم، خاصة إذا كانت تتيح مجالًا للإبداع – فهؤلاء يفضلون تطوير مناهج جديدة بدلاً من قضاء أيامهم في تنفيذ أعمال الآخرين

ومع ذلك، لا تقتصر أفضل الوظائف لهذه الشخصية على المجالات التقنية. إن موهبة INTP في التحليل والبحث يمكن أن تكون ذات قيمة كبيرة في أي مجال تقريبًا، ولديهم مرونة للتألق حتى في الوظائف التي قد لا تبدو مطابقة بوضوح لشخصيتهم. أي وظيفة تتيح لهؤلاء الأفراد فرصة الابتكار أو التجريب بعمليات جديدة – من التدريس إلى الإدارة وحتى التجارة – يمكن أن تمنحهم رضاً لا حدود له.'''),
          TabsCloumn(
              text1: 'دوافع عميقة',
              text2:
                  '''في بعض الأحيان، قد يكون من الصعب على زملاء العمل فهم شخصيات INTP. بخلاف العديد من أنماط الشخصية الأخرى، لا يتحفز أصحاب هذه الشخصية برغبة في إبهار مديرهم، أو أن يتم قبولهم من زملائهم، أو الحصول على لقب وظيفي مبهر. في الواقع، غالبًا ما ينفرون من الأشياء التي تحفز العمال الآخرين، مثل أنشطة بناء الفريق، أو الأحاديث الجانبية غير الرسمية، أو اجتماعات المتابعة، أو الخطابات التحفيزية من المديرين.

بدلاً من ذلك، يتم تحفيز شخصيات INTP بواسطة فضولهم الخاص ومعاييرهم العالية تجاه أنفسهم. بالنسبة لهم، "الجيد بما فيه الكفاية" نادرًا ما يكون كافيًا، ويكرهون أن يُطلق عليهم وصف عادي أو (وهو الأسوأ) متوسط. ومع ذلك، فهم لا يعملون بجد لمجرد العمل، ولا تثير كل المهام اهتمامهم بنفس القدر. في بعض الأحيان، قد يتجاهلون العمل الروتيني أو الإداري لصالح مساعٍ يرونها أكثر إثارة أو أهمية.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'الأبوة',
              text2:
                  '''فيما يتعلق بالأبوة والأمومة، كما هو الحال مع العديد من الأدوار الاجتماعية، يواجه أصحاب شخصية INTP (المنطقيون) تحديًا قويًا ولكنه صحي.في بعض الأحيان، قد يشعرون بالحيرة من مشاعر أطفالهم العفوية وغير المنطقية والمتغيرة باستمرار – لكنها في النهاية طبيعية تمامًا. بعد كل شيء، لم يطور الأطفال بعد نوع التحكم الذاتي والمنطق الذي يعتبره أصحاب شخصية INTP أمرًا مفروغًا منه.

ومع ذلك، يمكن أن تكون الأبوة تجربة ذات مغزى عميق. بفضل تسامحهم وانفتاحهم، يشجع أصحاب شخصية INTP أطفالهم على التفكير بشكل مستقل، والسعي وراء المعرفة الجديدة، والتعبير عن آرائهم والدفاع عنها. يرون في هذه التجربة طريقًا ديناميكيًا للتعلم، حيث لا يقتصر دورهم على نقل الحكمة فقط، بل يكتسبون أيضًا رؤى قيمة باستمرار من خلال هذه العملية.'''),
          TabsCloumn(
              text1: 'كن صادقًا مع ذاتك',
              text2:
                  '''الآباء من أصحاب شخصية INTP عادةً لا يقلقون كثيرًا بشأن التوقعات الاجتماعية.بمعنى آخر، نادرًا ما ينشغلون بنصائح التربية أو بأفكار الآخرين حول كيفية تصرف أطفالهم. كما أنهم ليسوا من النوع الذي يدفع أطفالهم نحو حياة تقليدية مرتبة تبدأ بـ المدرسة > الوظيفة > الزواج > المنزل > الأطفال > التقاعد (وبالتحديد بهذا الترتيب!).

ومع ذلك، هذا لا يعني أن آباء INTP لا يمتلكون توقعات لأطفالهم – فهم يمتلكونها. يتوقع أصحاب هذه الشخصية أن يكون أطفالهم ذوي دافع ذاتي ومستقلين. ويأملون أنه عندما يكبر أطفالهم، سيكتسبون مهارات التفكير النقدي التي تمكنهم من تحديد مسار حياتهم بأنفسهم ومعرفة كيفية السعي لتحقيقه.'''),
          TabsCloumn(
              text1: 'هدية الحرية',
              text2:
                  '''أصحاب شخصية INTP يشجعون فضول أطفالهم، مما يمنحهم الحرية لاكتساب المعرفة وتوسيع آفاقهم.يتبع هؤلاء الآباء نهجًا مسترخيًا وفكريًا في تربية أطفالهم. بدلاً من فرض قواعد صارمة أو جداول زمنية دقيقة، يهدفون إلى خلق بيئة منزلية تشجع على الاستكشاف والاستقلالية.

يولي آباء INTP أيضًا أهمية كبيرة للنمو الفكري لأطفالهم. يشجعونهم على أن يكونوا مفكرين مستقلين وأن يشككوا في كل شيء. غالبًا ما يردون على أسئلة أطفالهم بسؤال مثل "ما رأيك أنت؟" بدلاً من تقديم إجابات مباشرة.
بالنسبة لشخصيات INTP، فإن احترام استقلالية أطفالهم هو علامة على التقدير والاحترام. لكن بالنسبة للعديد من الأطفال (وحتى الشباب)، قد تكون هذه الحرية الشخصية الكبيرة أمرًا مربكًا. إذا لم تتضمن الحياة المنزلية حدودًا معقولة وإرشادًا أبويًا، فقد يجد هؤلاء الأطفال أنفسهم مشتتين أو تائهين، معتقدين أنهم بحاجة إلى فهم العالم بأنفسهم – وهي مهمة شاقة بلا شك.'''),
          TabsCloumn(
              text1: 'تحدٍ جدير بالاهتمام',
              text2:
                  '''تقديم الدعم العاطفي قد لا يكون أمرًا سهلاً للآباء من أصحاب شخصية INTP – في الواقع، إلى جانب وضع القواعد والحدود، قد يكون هذا من بين أكبر التحديات التي يواجهونها.
الخبر السار هو أن هذه الشخصيات قادرة تمامًا على مواجهة هذا التحدي، رغم أنه قد يتطلب بعض الجهد.
يرغب آباء INTP في تمكين أطفالهم لحل مشاكلهم بأنفسهم وتلبية احتياجاتهم الشخصية. هذا هدف نبيل، لكن الأطفال يحتاجون إلى أساس قوي من الدعم والتقدير – إلى جانب القواعد والحدود المذكورة – قبل أن يتمكنوا من مواجهة العالم بمفردهم.
للمساعدة في بناء هذا الأساس، يحتاج هؤلاء الآباء إلى التعبير عن الحب والمودة والإعجاب الذي يشعرون به تجاه أطفالهم.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'العلاقات الرومانسية',
              text2:
                  '''يمتلك أصحاب شخصية INTP (المنطقيون) مزيجًا غير عادي من السمات التي غالبًا ما تكون مفاجأة سارة لشريكهم الرومانسي. قد يظهرون كأشخاص عقلانيين ومنطوين، لكن بمجرد أن يسقطوا حواجزهم، يظهر جانبهم المرح والإبداعي أيضًا.
كونهم انطوائيين، يقدر أصحاب شخصية INTP الوقت الذي يقضونه بمفردهم، لكن هذا لا يعني أنهم لا يتوقون إلى الصحبة. بالنسبة لهؤلاء الأشخاص، الشريك الرومانسي المثالي ليس فقط شخصًا يقضون الوقت معه، بل شخصًا يساويهم فكريًا ويستطيع تحدي أفكارهم. يريدون قضاء حياتهم في السعي نحو التعلم والنمو، ويأملون أن يكون الشخص الذي يحبونه ليس فقط شريكًا في هذه المهمة ولكن مشجعًا نشطًا لها أيضًا.'''),
          TabsCloumn(
              text1: 'اتصال حقيقي',
              text2:
                  '''التنقل في عالم الرومانسية قد يكون مهمة محيرة وغير متوقعة لأصحاب هذه الشخصية.
يتعامل أصحاب شخصية INTP مع علاقاتهم الرومانسية بالطريقة نفسها التي يتعاملون بها مع المشكلات الفكرية – بالتحليل والفضول والرغبة في فهم الآليات الأساسية. بالنسبة لهم، الشريك ليس مجرد اهتمام عاطفي، بل موضوع دراسة مثير، لغز مليء بالتعقيدات ينتظر أن يتم حله.

يأخذ INTP علاقاتهم الرومانسية على محمل الجد، لكنهم لا يهتمون كثيرًا بالتسميات التقليدية أو الشكليات المرتبطة بالمواعدة. عندما يجدون شريكًا يتواصلون معه على مستوى حقيقي – شخصًا يحترمون عقله ويستمتعون برفقته – يمضون قدمًا بوتيرتهم الخاصة وبأسلوبهم الفريد.

حتى في المراحل المبكرة من التعارف، يتميز أصحاب شخصية INTP بالصدق المباشر. لا يرون جدوى من ممارسة الألعاب، وعلى الرغم من أنهم قد يكونون هادئين، إلا أنهم ليسوا غامضين. نادرًا ما يخفون آرائهم، ويشجعون شريكهم على أن يكون صريحًا معهم أيضًا. بالنسبة لهم، يُعد الوضوح والصراحة علامة على الاحترام، وليس قلة تهذيب، كما أنهما وسيلة لتجنب سوء الفهم.
مع تطور العلاقة، تكون احتياجاتهم اليومية بسيطة. الهدايا والمفاجآت والخطط الاجتماعية المعقدة والمواعيد الرومانسية الفاخرة ليست ذات أهمية كبيرة بالنسبة لهم. لسوء الحظ، إذا كان شريكهم يرغب في هذه الأشياء، فقد لا يخطر ببالهم حتى التخطيط لها.

قد يحتاج أصحاب هذه الشخصية إلى بذل جهد خاص لتعلم كيفية التعبير عن مشاعرهم بطريقة تتناغم مع شريك حياتهم. خلاف ذلك، قد يشعر الشريك بأنه مهمل أو غير مقدّر أو حتى غير محبوب. من ناحية إيجابية، يمكن أن يحول INTP هذا الوضع إلى فرصة لتوظيف براعتهم الإبداعية المميزة لإيجاد طرق مبتكرة للتعبير عن حبهم.'''),
          TabsCloumn(
              text1: 'التعامل مع الصراع',
              text2:
                  '''قليلون يحبون الصراعات، ولكن أصحاب شخصية INTP معرضون بشكل خاص للانسحاب عندما تنشأ خلافات عاطفية.بدلًا من التباطؤ والاستماع بعمق، قد يلجأون إلى استخدام قدراتهم المنطقية لمحاولة إثبات خطأ شريكهم. وبدلاً من التعمق في القضايا والمشاعر المعقدة، قد يقدمون حلولًا بسيطة ومنطقية، غير راغبين في التورط في تعقيدات المشاعر.

ومع نضجهم، غالبًا ما يدرك أصحاب شخصية INTP أن الاحتياجات العاطفية للناس (بما في ذلك احتياجاتهم الخاصة) حقيقية ولها أهميتها. بالنسبة لنوع شخصية يعشق العقلانية، فإن هذه ليست دائمًا الدروس الأسهل استيعابًا. لكن هذا الوعي يمكن أن يساعدهم على مواجهة التحديات التي تواجه جميع العلاقات طويلة الأمد.
قد لا يكون الحديث عن المشاعر طبيعيًا بالنسبة لهم، ولكن يمكن لأصحاب هذه الشخصية أن يتعلموا إيجاد أرضية عاطفية مشتركة مع شريكهم، حتى في لحظات الخلاف.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(text1: 'نقاط القوة', text2: '''تحليليون
يقوم أصحاب شخصية INTP (المنطقيون) بتحليل كل شيء يصادفونه. يمنحهم ذلك مهارة اكتشاف الأنماط والروابط غير المتوقعة التي قد يغفل عنها الآخرون.
أصليون – بفضل خيالهم الذي لا يهدأ، يمكن لهذه الشخصيات أن تبتكر أفكارًا إبداعية وغير بديهية لا تخطر ببال معظم الناس. بالطبع، ليست جميع هذه الأفكار قابلة للتنفيذ، ولكن استعداد INTP للتفكير خارج الصندوق يمكن أن يؤدي إلى ابتكارات مذهلة.

منفتحون الذهن
يتم تحفيز INTP بدافع الفضول ورغبة شديدة في التعلم. ومع تعلمهم، نادرًا ما يخشون تغيير وجهة نظرهم – حتى في الأمور المتعلقة بالسياسة أو الدين أو الفلسفة. يميل أصحاب هذه الشخصية إلى استقبال الأفكار الجديدة، طالما أن هذه الأفكار تتصل بهم على المستوى الفكري.

فضوليون
دائمًا ما يبحث هؤلاء الأشخاص عن أشياء جديدة ليتعلموا عنها. قد تجدهم في أسبوع ما مهووسين بالجيوفيزياء، وفي الأسبوع التالي غارقين في مشاهدة مقاطع فيديو عن صناعة الجيتار. عندما تأتيهم الإلهام، يغمرون أنفسهم تمامًا في اهتماماتهم الجديدة، ويتعلمون كل ما يمكنهم تعلمه عنها.

صادقون
يهتم أصحاب شخصية INTP بالحقيقة. وبدلاً من البحث عن الراحة في الأيديولوجيات أو الأفكار التقليدية، يرغبون في فهم ما يجري حقًا تحت السطح. نتيجة لذلك، يمكن الاعتماد عليهم في مواجهة التحيز والمعلومات الخاطئة حتى عندما يكون ذلك صعبًا – ويتوقعون من الآخرين أن يكونوا صادقين معهم بالمقابل.'''),
          TabsCloumn(text1: 'نقاط الضعف', text2: '''منفصلون عن الواقع
يمكن لأصحاب شخصية INTP أن يغرقوا في أفكارهم الخاصة حتى أثناء وجودهم مع الآخرين. وعندما يعودون أخيرًا إلى المحادثة بشيء ليقولوه، قد يكتشفون أن الحديث قد انتقل إلى موضوع آخر. هذا قد يجعلهم يشعرون بالانفصال عن الآخرين، خاصة في التجمعات الاجتماعية الكبيرة.

غير حساسين
يرى أصحاب شخصية INTP أن العقلانية هي المفتاح لعالم أفضل وأكثر سعادة. في بعض الأحيان، قد يقللون من أهمية القيم "غير العقلانية" مثل المشاعر، والرحمة، وآداب السلوك، والتقاليد. ونتيجة لذلك، قد يظهرون بشكل غير مقصود وكأنهم غير حساسين أو قساة، على الرغم من أن نواياهم تكون جيدة بشكل عام.

غير راضين
لا يستطيع أصحاب هذه الشخصية منع أنفسهم من تخيل كيف يمكن أن تكون الأمور أفضل مما هي عليه. هم دائمًا يبحثون عن مشاكل لحلها، ومواضيع لتعلمها، وطرق جديدة للتعامل مع الأمور. ولكن إذا ذهبوا بعيدًا في هذا التفكير، فقد يصبح ذلك مرهقًا لهم، حيث يحاولون باستمرار إعادة اختراع العجلة بدلًا من التعامل بفعالية مع احتياجاتهم ومسؤولياتهم.
مفرطون في التفكير
عقول أصحاب شخصية INTP لا تهدأ أبدًا، فهي تعمل حتى عندما لا يفكرون بوعي. وبينما قد تكون أفكارهم السريعة مفيدة أحيانًا، إلا أنها قد تؤدي أيضًا إلى التفكير المفرط والإصابة بشلل التحليل. عندما يحدث ذلك، قد يجدون صعوبة في اتخاذ قرار أو تنفيذ أي إجراء لأنهم ينغمسون في التفكير بكل النتائج والزوايا الممكنة.
غير صبورين
يفخر أصحاب شخصية INTP بمعرفتهم ومشاركتهم لأفكارهم. ومع ذلك، عندما يتعلق الأمر بشرح منطقهم، فإنهم لا يكونون دائمًا صبورين. إذا لم يتمكن الطرف الآخر من متابعة حديثهم أو لم يظهر اهتمامًا كافيًا، فقد يتوقفون عن الشرح بجملة مختصرة مثل "لا يهم".'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'الصداقات',
              text2:
                  '''مثل أي شخص آخر، يبحث أصحاب شخصية INTP (المعروفون أيضًا بـ "المنطقيين") عن الرفقة والدعم من أصدقائهم. ولكنهم يقدّرون شيئًا آخر أيضًا: العمق الفكري. ليس الجميع يمكنهم تلبية معاييرهم كأصدقاء محتملين، ولكن عندما يفعل شخص ما ذلك، يمكن أن تشتعل العلاقة على الفور، مما يفاجئ الجميع الذين اعتقدوا أنهم فهموا هذا النوع من الشخصيات التي تبدو بعيدة.'''),
          TabsCloumn(
              text1: 'انتقائي ام انتقائي بعناية',
              text2:
                  '''ربما لأنهم لا يمانعون قضاء الوقت مع أفكارهم الخاصة، فهم لا يحيطون أنفسهم بالناس لمجرد التواجد معهم. ونتيجة لذلك، ليس من السهل دائمًا أن تصبح صديقًا مقربًا لأصحاب هذه الشخصية. ولكن عندما ينفتح أصحاب شخصية INTP، يمكنهم أن يكونوا أصدقاء حيويين وخياليين دائمًا لديهم شيء مثير أو غير متوقع ليقولوه.
يميل أفضل أصدقاء أصحاب شخصية INTP إلى مشاركة شغفهم بالأفكار الجديدة، والألغاز، والحلول. ولكن هذا لا يعني أن أصحاب هذا النوع من الشخصية يبحثون فقط عن أصدقاء يوافقونهم الرأي. فهم لا يمانعون تحدي أفكارهم – بل في الواقع، يكنّون احترامًا كبيرًا للأشخاص الذين يجعلونهم يعيدون التفكير في افتراضاتهم ويبقونهم على أهبة الاستعداد.
تستند صداقات INTP إلى المعرفة، وتُدعم بتبادل الأفكار والنظريات والمفاهيم. بالنسبة لهذا النوع من الشخصية، لا يوجد شيء أكثر إثارة من محادثة مليئة بالأفكار المعقدة تستمر حتى ساعات الصباح الأولى. أما الأشخاص الذين لا يستطيعون مجاراتهم أو الذين لديهم اهتمامات مختلفة تمامًا (لا تتحدث معهم عن المشاهير)، فقد يشعرون بأنهم يتم تجاهلهم أو إبعادهم. يميل هؤلاء الأصدقاء إلى تخصيص محادثاتهم للمواضيع التي يجدونها ذات معنى أو للأشخاص الذين يحبونهم بما يكفي لتحمل ذلك.'''),
          TabsCloumn(
              text1: 'معني الصداقة',
              text2:
                  '''عندما يلجأ الأصدقاء إلى أصحاب شخصية INTP بمشاكلهم ومعضلاتهم، يشعر هؤلاء عادة بالحماس للمساعدة. يمكن الاعتماد على هذه الشخصية لتقديم نصائح منطقية وحلول عقلانية، وتحويل حتى أكثر المواقف تعقيدًا إلى قائمة من الإيجابيات والسلبيات.
ولكن عندما يتعلق الأمر بالدعم العاطفي أو الأمور المتعلقة بالمشاعر، قد يشعر أصحاب هذه الشخصية بأنهم خارج نطاق راحتهم. بالنسبة لـ INTPs، تُعد واحدة من أعظم (وأصعب) دروس الصداقة هي أن الناس أحيانًا لا يحتاجون إلى نصائح حول كيفية حل مشاكلهم – بل يحتاجون فقط إلى شخص يمكنهم الاعتماد عليه ليكون بجانبهم.
مع أصحاب شخصية INTP، يمكن للأصدقاء أن يتوقعوا محادثات مثيرة للتفكير، وصدقًا غير مقيد، ووجهات نظر فريدة حول مجموعة متنوعة من الموضوعات. رغم أن صداقاتهم قليلة، إلا أنها عزيزة جدًا عليهم ويتم الاعتناء بها بعناية واهتمام كبير. يتمتع الأشخاص من هذا النوع بقدرة مذهلة على تجاوز المظاهر السطحية، مثل المكانة الاجتماعية أو طريقة اللباس، وتقدير الإمكانات الكاملة للشخص من الداخل.
في عالم مهووس بالتوافق مع القواعد والموضات، يمكن لهؤلاء الأفراد أن يلهموا أصدقائهم لتحدي الأعراف، وتجاهل الاتجاهات، واكتشاف أصواتهم الفريدة.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'مقدمة تعريفية',
              text2:
                  '''نوع شخصية المنطقي نادر إلى حد ما، فهم ثلاثة في المئة فقط من البشر، وذلك بالتأكيد شيء جيد بالنسبة لهم، حيث لا يوجد شيء مزعج لهم أكثر من كونهم "منتشرين". تفخر شخصيات المنطقي بقدرتهم على الابتكار والإبداع، ووجهة نظرهم الفريدة من نوعها وفكرهم المفعم بالحيوية. وعادةً ما يعرفون باسم الفيلسوف، أو المهندس، أو الأستاذ الحالم، كما يعزى لهم الفضل في العديد من الاكتشافات العلمية على مر التاريخ.'''),
          TabsCloumn(
              text1: 'حياة العقل',
              text2:
                  '''غالبًا ما يغرق أصحاب شخصية INTP في التفكير – وهو أمر ليس بالضرورة سيئًا. الأشخاص الذين يمتلكون هذا النوع من الشخصية نادرًا ما يتوقفون عن التفكير. منذ لحظة استيقاظهم، تمتلئ عقولهم بالأفكار والأسئلة والرؤى. وفي بعض الأحيان، قد يجدون أنفسهم يخوضون نقاشات كاملة داخل رؤوسهم. وليس من الغريب أن يسرحوا أثناء المحادثات؛ حيث تأخذهم عقولهم في رحلة إلى عوالم فكرية غير مستكشفة، حيث تُولد الأفكار الجديدة باستمرار.

من الخارج، قد يبدو أصحاب شخصية INTP وكأنهم يعيشون في حلم يقظة لا ينتهي. لديهم سمعة بأنهم متأملون، ومنعزلون، وقليلًا ما يكونون منفتحين. ولكن ذلك يتغير عندما يحاولون بوعي توجيه كل طاقتهم العقلية إلى اللحظة أو الشخص أمامهم. ومع ذلك، بغض النظر عن الوضع الذي يكونون فيه، فإن أصحاب شخصية INTP هم انطوائيون بطبيعتهم ويميلون إلى الشعور بالإرهاق من كثرة التفاعل الاجتماعي. وبعد يوم طويل، يتوقون إلى وقت يقضونه بمفردهم للاستغراق في أفكارهم.

يقدّر أصحاب شخصية INTP استقلاليتهم، وغالبًا ما يجدون أنفسهم أكثر إنتاجية خلال ساعات الليل المتأخرة عندما تقل المشتتات إلى حد كبير. ومع ذلك، سيكون من الخطأ الاعتقاد بأنهم غير ودودين أو متحفظون. عندما يتواصلون مع شخص يمكنه مواكبة طاقاتهم العقلية، فإنهم يتألقون بشدة، متنقلين من فكرة إلى أخرى. قلة من الأمور تضيف لهم طاقة مثل فرصة تبادل الأفكار أو الاستمتاع بنقاش حي مع شخص آخر فضولي وشغوف بالاستكشاف الفكري.'''),
          TabsCloumn(
              text1: 'بسيط يا عزيزي المنطقي',
              text2:
                  '''يعشق الأشخاص من نوع شخصية INTP تحليل الأنماط. ودون أن يعرفوا بالضرورة كيف يفعلون ذلك، غالبًا ما يمتلكون قدرة شبيهة بشيرلوك هولمز على اكتشاف التناقضات والاختلالات. بعبارة أخرى، قد يكون من السيئ الكذب على شخص يتمتع بهذا النوع من الشخصية.

ولكن من المفارقات أنه لا يجب دائمًا أخذ كلامهم كحقيقة مطلقة. نادرًا ما يقصد أصحاب شخصية INTP أن يكونوا غير صادقين، ولكن بسبب عقولهم النشطة، فإنهم أحيانًا يغمرون بالأفكار والنظريات التي لم يتأملوها بالكامل. قد يغيرون رأيهم بشأن أي شيء، بدءًا من خطط عطلة نهاية الأسبوع وصولًا إلى مبدأ أخلاقي أساسي، دون أن يدركوا أنهم قد أظهروا أنهم قد حسموا رأيهم في المقام الأول. بالإضافة إلى ذلك، يسعدهم غالبًا لعب دور "محامي الشيطان" فقط لإبقاء النقاش ممتعًا ومثيرًا.'''),
          TabsCloumn(
              text1: 'ألغاز الكون',
              text2:
                  '''يرغب الأشخاص الذين يمتلكون هذا النوع من الشخصية في فهم كل شيء في الكون، ولكن هناك مجال معين غالبًا ما يحيرهم: الطبيعة البشرية. كما يشير اسمهم، يشعر أصحاب شخصية INTP (المعروفون أيضًا بـ "المنطقيين") بأنهم في موطنهم الطبيعي عندما يتعلق الأمر بالمنطق والعقلانية. ونتيجة لذلك، قد يجدون أنفسهم في حيرة بسبب الطرق غير المنطقية وغير العقلانية التي تؤثر بها المشاعر والعواطف على سلوك الناس – بما في ذلك سلوكهم الخاص.

هذا لا يعني أن أصحاب شخصية INTP يفتقرون إلى المشاعر. فهم عمومًا يرغبون في تقديم الدعم العاطفي لأصدقائهم وأحبائهم، ولكنهم لا يعرفون دائمًا كيف يفعلون ذلك. ونظرًا لأنهم لا يستطيعون تحديد الطريقة الأفضل والأكثر كفاءة لتقديم الدعم، فقد يمتنعون عن قول أو فعل أي شيء على الإطلاق.

يمكن أن تؤثر هذه "الشلل التحليلي" على العديد من جوانب حياة أصحاب هذه الشخصية. قد يبالغون في التفكير حتى في أصغر القرارات، مما يجعلهم أحيانًا يشعرون بعدم الفاعلية والتوقف، منهكين من سيل الأفكار المستمر في أذهانهم لدرجة أنهم يكافحون لإنجاز الأمور.

والخبر الجيد هو أنهم لا يظلون عالقين لفترة طويلة. فالقوة الفريدة لديهم تشمل كل ما يحتاجونه للخروج من المآزق التي يقعون فيها من حين لآخر. ومن خلال الاستفادة من إبداعهم وعقلانيتهم المنفتحة، يمكن لأصحاب شخصية INTP تحقيق إمكاناتهم الكاملة – سواء كمفكرين أو كأشخاص سعداء ومتوازنين.'''),
        ]),
      ])
    ]);
  }
}
