import 'package:flutter/material.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Info_Patterns.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Tab_Patterns.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Tabs_Column.dart';
import 'package:gradution_project/View/features/EachPatternInfo/patterns_structure.dart';
import 'package:gradution_project/View/features/EachPatternInfo/tabslistview.dart';

class Isfp extends StatelessWidget {
  const Isfp({super.key});

  @override
  Widget build(BuildContext context) {
    return const PatternsStructure(childs: [
      InfoPatterns(
          text1: 'ISFP',
          text2: 'مغامر',
          text3:
              '''أنواع شخصية المغامر هي من الفنانين الحقيقيين، ولكن ليس بالضرورة بالمعنى التقليدي ممن يرسمون لوحات أشجار صغيرة سعيدة. وذلك على الرغم من أنهم قادرون تمامًا على فعل هذا في كثير من الأحيان. وبدلاً من ذلك، يستخدم هذا النوع من الشخصية الجماليات والتصميم والتقاليد الاجتماعية غير المألوفة. وتستمتع شخصية المغامر بقلب التوقعات التقليدية بتجاربها في الجمال والسلوك – فهم يحبون الخروج عن المألوف و"التفكير خارج الصندوق".''',
          image: 'assets/images/isfp2.png'),
      TabPatterns(tabchilds: [
        TabsListView(childs: [
          TabsCloumn(
              text1: 'عادات مكان العمل',
              text2:
                  '''يسعى أصحاب الشخصية ISFP (المغامرون) إلى تولي وظائف تمنحهم حرية كافية للتعبير عن شغفهم بالأفعال العفوية والتجارب العاطفية الصادقة. البيئات التقليدية التي تعتمد على التقاليد الصارمة والإجراءات المطبقة بإحكام ليست على الأرجح من الأمور التي تثير اهتمامهم. بفضل طبيعتهم العفوية والجذابة وشخصياتهم الممتعة بحق، فإن أفراد ISFP يبحثون فقط عن فرصة للتعبير عن هذه الصفات الطبيعية وللتأكد من أن جهودهم تلقى التقدير.'''),
          TabsCloumn(
              text1: 'الموظفون من نوع ISFP',
              text2:
                  '''يفضل أصحاب شخصية ISFP عادةً تلقي التعليمات بدلاً من إصدارها. ورغم أنهم ليسوا معروفين بتركيزهم على الأهداف طويلة الأجل، إلا أن عفويتهم وإبداعهم يضيفان لمسة مميزة ومنظورات جديدة للمهام التي يقومون بها. بالإضافة إلى ذلك، فإنهم عادةً منفتحون على الأفكار ومستعدون لتلقي الملاحظات وتطبيقها. لتحقيق أفضل أداء لديهم، يحتاجون إلى أهداف واضحة مصحوبة بقدر من الحرية الشخصية وبيئة عمل داعمة.
عندما يتم تحقيق التوازن المطلوب، يظهر أصحاب شخصية ISFP حماسهم للتعلم وشغفهم بحل المشكلات، خاصة عندما تتاح لهم الفرصة للتعامل المباشر مع الأفراد أو معالجة مشكلة بمفردهم. يتميزون بالتواضع والخجل إلى حد ما، مما يجعلهم نادرًا ما يعرضون المساعدة من تلقاء أنفسهم. ومع ذلك، فهم يحبون أن يشعروا بالتقدير، وعندما يتم تكليفهم بمهمة، فإنهم يعملون بجد لاكتساب هذا التقدير.'''),
          TabsCloumn(
              text1: 'المديرون من نوع ISFP',
              text2:
                  '''أكثر المواقف التي قد تبدو غريبة على أصحاب شخصية ISFP هي الإدارة. فهم ليسوا من النوع المسيطر، ولا يجدون متعة كبيرة في فرض السيطرة على الآخرين، أو التخطيط للأهداف طويلة المدى، أو معالجة السلوك غير المرضي. ومع ذلك، فإن شعورهم بأن الإدارة قد تبدو غير مألوفة لا يعني أنهم غير مؤهلين لها.
بفضل حساسيتهم، يتمتعون بمهارة الاستماع الجيد، مما يساعدهم على توجيه دوافع مرؤوسيهم الشخصية نحو تحقيق الأهداف المطلوبة. كما أنهم يمنحون مرؤوسيهم الحرية اللازمة لإنجاز العمل وحل المشكلات اليومية، وغالبًا ما يشاركونهم في هذه المهام بأنفسهم.هذا الأسلوب الفريد يجعل مديري ISFP متميزين في الإلهام والتعاون، مما يؤدي إلى كونهم محبوبين من قِبل فرقهم.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'مسارات الحياة المهنية',
              text2:
                  '''بالنسبة لأصحاب الشخصية ISFP (المغامرون)، فإنهم يحتاجون إلى أكثر من مجرد وظيفة. الثروة، السلطة، التنظيم، التقدم، والأمان، رغم أنها جوانب جيدة، تأتي غالباً في المرتبة الثانية مقارنة بحاجتهم الأهم: الحرية الإبداعية. يسعى أفراد ISFP إلى منفذ ملموس لإطلاق خيالهم، وفرصة للتعبير عن رؤيتهم لما هو فعّال.
أثناء رسم مسارهم المهني، يجلب الأشخاص من هذا النمط مزيجهم المميز من الإبداع والمرونة والذكاء العاطفي. فهم يميلون إلى التطبيق العملي للمهارات مع قدرة على التفكير خارج الصندوق، مما يجعلهم مناسبين للمهن التي تقدر الابتكار والعفوية.
بفضل وجهة نظرهم الفريدة ورغبتهم البسيطة في أن يكونوا على طبيعتهم، يعتبر أصحاب شخصية ISFP فنانين وموسيقيين ومصورين ومدربين بالفطرة، وكذلك مصممين من مختلف المجالات. فكرة إنشاء متجر على منصات مثل Etsy تعد أكثر جاذبية لهم بكثير من العمل الإداري التقليدي ضمن جدران مكتبية مزودة بإضاءة فلورية.'''),
          TabsCloumn(
              text1: 'أرواح حرة في العمل',
              text2:
                  '''أصحاب الشخصية ISFP يكرهون الجمود في البيئات الرتيبة التي لا تتغير. إنهم أرواح حرة يحتاجون إلى المرونة وفرص الارتجال والعمل الغامر الذي يحفز حواسهم. وبفضل انفتاحهم الفكري، لا يخشون تغيير مساراتهم المهنية إذا شعروا أن الطريق الحالي لا يناسبهم. يفضلون السير في طرق غير معبدة ويعيشون اللحظة، مؤمنين بأن الحاضر هو الأهم.

مع ذلك، قد يواجه أفراد ISFP صعوبة في التخطيط واتخاذ القرارات طويلة الأمد. يمكن أن يجعل ذلك مسارهم المهني معقدًا بعض الشيء، حيث يميلون إلى إعطاء الأولوية للتجارب الفورية على النتائج البعيدة. علاوة على ذلك، غالبًا ما يشعرون بأن لديهم سيطرة محدودة على العمليات المستقبلية مثل التخطيط للتقاعد – فهم لا يستطيعون التنبؤ بالمستقبل، لذا يرون أنه لا فائدة من القلق بشأنه الآن. أليس كذلك؟'''),
          TabsCloumn(
              text1: 'النظر إلى الغد',
              text2:
                  '''يمكن لهذا النهج في التفكير أن يعيق أصحاب الشخصية ISFP عن العديد من المهن الجيدة، مثل التدريب والإرشاد والتعليم، والتي تتطلب تخطيطًا طويل الأمد وغالبًا شهادات مكثفة للبدء. إن التركيز على هدف واحد لفترة طويلة يتطلب جهدًا كبيرًا منهم، ولكن تحقيق ذلك يمكن أن يجعل الحياة اليومية أكثر إشباعًا لبقية حياتهم.

مسار أسهل يتمحور حول العمل الحر والاستشارات في أي مجال يستمتع به هؤلاء الأشخاص. سواء كان ذلك في تنظيم الفعاليات الخيرية، أو التعاون مع المستشفيات لجعل إقامة المرضى أكثر راحة، أو ابتكار حرفة جديدة، يبدو دائمًا أن أفراد ISFP يجدون طريقة لإضفاء البهجة والجمال على العالم – وتحقيق مصدر رزق في الوقت ذاته.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'الأبوة',
              text2:
                  '''عندما يتعلق الأمر بتربية الأبناء، يميل الأشخاص من نمط الشخصية ISFP (المغامرون) إلى خلق بيئة آمنة وغير حكمية تتيح لأطفالهم التعبير عن أنفسهم بحرية. يؤمن هؤلاء الأفراد بأن لكل طفل الحق في اتباع مساره الفريد. وعلى الرغم من أن أحداً لا يكون مستعداً تماماً لخوض تجربة الأبوة أو الأمومة، إلا أن دفء شخصيات ISFP الطبيعي وعمليتهم وطبيعتهم المريحة تساعدهم على التكيف بسرعة والاستمتاع بكل لحظة، سواء كانت مليئة بالفرح أو التحديات التي تصاحب تربية الأطفال.'''),
          TabsCloumn(
              text1: '''العثور على السعادة 
في الحياة اليومية''',
              text2:
                  '''تكمن أعظم قوة للأشخاص من نمط الشخصية ISFP في السعادة التي يجدونها في التواجد مع أحبائهم ومساعدتهم. يتم تلبية الاحتياجات العملية منذ اليوم الأول، ويمكن لأطفالهم دائماً الاعتماد على وجود نشاط مثير أو شيء جديد لتعلمه كل يوم. قد يفاجئ آباء ISFP أطفالهم برحلات تخييم عفوية أو جلسة غير مخطط لها للفنون والحرف اليدوية في فترة ما بعد الظهيرة الهادئة. فهم ليسوا صارمين عندما يتعلق الأمر بالأشياء التي يرغب أطفالهم في استكشافها، إذ يؤمنون بأن التعلم والنمو غالباً ما يكمنان خارج نطاق الروتين الممنهج.

يحب الأشخاص من نمط الشخصية ISFP قضاء الوقت مع أطفالهم والاستمتاع بأنشطة تتمحور حول الوقت النوعي. سواء كانت رحلات عفوية، أو مشاريع لتحسين المنزل مثل إعادة طلاء غرف النوم، أو مجرد خبز بعض الحلويات معاً، فمن المحتمل أن تصبح هذه اللحظات ذكريات عزيزة على أطفالهم.
لكن هذا لا يعني أن آباء ISFP يتسمون بالتسلط – على العكس تماماً، فهم من أكثر أنماط الشخصية استرخاءً في أسلوب التربية. يؤمنون بأن الطريقة الوحيدة لضمان أن ينشأ أطفالهم بعقلية منفتحة وشخصية متوازنة هي منحهم حرية استكشاف وتجربة أشياء جديدة، ارتكاب الأخطاء والتعلم منها، مع التأكيد دائماً أنهم يستطيعون العودة إلى المنزل في نهاية المطاف أينما كانوا.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'العلاقات الرومانسية',
              text2:
                  '''الأشخاص الذين يحملون نمط الشخصية ISFP (المغامرون) قد يكونون غامضين ومن الصعب التعرف عليهم بشكل كامل. على الرغم من كونهم عاطفيين للغاية، إلا أنهم يحمون هذا الجانب الحساس من شخصياتهم بعناية، ويفضلون الاستماع أكثر من التعبير عن أنفسهم. يركزون بدلاً من ذلك على شريكهم، دون أن يكون لديهم اهتمام كبير بفرض مشاعرهم أو التأثير على الحالة المزاجية للموقف.
في بعض الأحيان، قد يكون هذا محبطًا، ولكن إذا تم قبولهم كما هم، فإن ISFPs يثبتون أنهم شركاء دافئون وحماسيون.'''),
          TabsCloumn(
              text1: 'قلب رقيق',
              text2:
                  '''بالنسبة للأشخاص من نمط الشخصية ISFP، من المهم أن يظهر الشريك لهم أن حبهم واهتمامهم محل تقدير. نادرًا ما يطلبون شكرًا مباشرًا، ولكن يمكن أن يؤذي مشاعرهم بشدة إذا شعروا بعدم التقدير أو التجاهل. لا يجب أن تكون هذه التعبيرات لفظية دائمًا – فـ ISFP يفضلون الأفعال على الكلمات – ولكن من الضروري أن يشعروا بأن مشاعرهم متبادلة.

على الجانب الآخر، فإن هذه الشخصيات تعد من بين أكثر الأنماط حساسية للنقد والصراع، مما يجعل توفير مستوى معين من الدعم العاطفي أمرًا ضروريًا.
عندما يشعرون بالتقدير، يكونون أكثر من سعداء لتقديم الحب والاهتمام بطريقتهم الخاصة. شخصيات ISFP تتمتع بحس عاطفي عميق. قد يكونون خجولين في الأماكن العامة، ولكن مع شريك يثقون به، يزول هذا الحاجز – وقلة هم من يشهدون هذا الجانب منهم، مما يجعله دائمًا مفاجأة سارة.'''),
          TabsCloumn(
              text1: 'الحب من الروح',
              text2:
                  '''تعتمد علاقات الأشخاص من نمط الشخصية ISFP على المشاعر والعواطف التي تشكل جوهر كل جانب من جوانب حياتهم العاطفية. بجانب هذا الحس العاطفي، يمتلكون ميلاً قوياً – بل حاجة – لاستكشاف الفرص الجديدة والمفاجآت. يُعتبر الضغط عليهم للدخول في أي التزامات طويلة الأمد أو التسرع في ذلك طريقًا مؤكدًا لإبعادهم. إذا لم يشعروا بالإثارة والتساؤل "ما الذي سيأتي بعد ذلك؟" كل صباح، قد يجدون أنفسهم يتساءلون: "ما الجدوى؟"

ومع ذلك، يمكن أن يكون تطوير مهارة التخطيط منطقة صحية للنمو بالنسبة لشخصيات ISFP. كما أن تعلم الشعور براحة أكبر في التعبير عن مشاعرهم والتواصل بوضوح أكبر يعد شيئًا يمكن لشريكهم أن يساعدهم على تحقيقه.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'نقاط القوة',
              text2:
                  '''جاذبية طبيعيةشخصيات ISFP تتمتع بالهدوء والدفء، وموقفهم المريح الذي يقوم على "عِش ودع غيرك يعيش" يجعلهم محبوبين وشائعين بشكل طبيعي.

حساسون تجاه الآخرينيمكن لشخصيات ISFP أن تتواصل بسهولة مع مشاعر الآخرين، مما يساعدهم على خلق الانسجام والنية الحسنة وتقليل الصراعات. العديد منهم يمتلكون قدرة فريدة على إدراك مشاعر الآخرين فقط من خلال الاستماع إلى أصواتهم.

طيبة وتشجيعيمتلك هؤلاء الأفراد لطفًا فطريًا وشعورًا بالعدالة يغذي فهمهم وتعاطفهم مع الآخرين، وغالبًا ما يساعدهم على خلق مساحة آمنة للتعبير عن الأفكار والمشاعر. بشكل عام، يتبنون موقفًا داعمًا ومستعدون دائمًا لتشجيع الآخرين على متابعة شغفهم.

خيال واسعيستخدم ISFPs إبداعهم وبصيرتهم لابتكار أفكار جريئة تُحرك القلوب. وعلى الرغم من صعوبة التعبير عن هذه الجودة في السيرة الذاتية، إلا أن خيالهم النابض وروحهم الاستكشافية تساعدهم بطرق غير متوقعة.

شغف كبيرعلى الرغم من هدوئهم وخجلهم، فإن قلوبهم تحمل مشاعر قوية. عندما ينجذبون إلى شيء مثير ومهم بالنسبة لهم، يمكن أن يضعوا كل شيء آخر جانبًا للتركيز عليه بكل حماس.'''),
          TabsCloumn(
              text1: 'نقاط الضعف',
              text2:
                  '''صعوبة مع الهيكليةتُعد حرية التعبير أولوية قصوى لشخصيات ISFP. أي شيء يُقيد تلك الحرية، مثل التقاليد أو القواعد الصارمة، يُشعرهم بالضغط. هذا يمكن أن يجعل البيئات التي تتطلب تنظيمًا صارمًا تحديًا كبيرًا لهم.

غير متوقعينتميل شخصيات ISFP إلى تجنب الالتزامات والخطط طويلة الأجل. هذه النزعة للابتعاد عن التخطيط للمستقبل يمكن أن تسبب توترًا في العلاقات العاطفية وصعوبات مالية لاحقًا في الحياة.

سريعو التأثر بالضغوطيعيش ISFPs في الحاضر ويمتلئون بالمشاعر. عندما تخرج الأمور عن السيطرة، يمكن أن يغلقوا على أنفسهم، مما يفقدهم سحرهم المعتاد وإبداعهم لصالح القلق والتوتر.

صعوبة في حل المشكلات التقنيةليس من طبيعة ISFPs التوجه نحو البناء أو الإصلاح أو اتخاذ نهج عملي عند مواجهة مشكلات تقنية. ميلهم للملاحظة أكثر من الانخراط المباشر يعيق قدرتهم على التعامل بفعالية مع المشكلات الميكانيكية أو التقنية.

تذبذب تقدير الذاتغالبًا ما يكون من الصعب قياس مهارات ISFPs التي تعتمد على الحساسية والاستكشاف. عندما يتم تجاهل جهودهم أو التقليل من شأنها – خاصة في وقت مبكر من حياتهم – قد يتأثرون بشدة. يمكن أن يتسلل الشك إلى نفوسهم، مما يجعلهم يصدقون الانتقادات السلبية دون وجود دعم قوي يساعدهم على تجاوز ذلك.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'الصداقات',
              text2:
                  '''الأشخاص من نوع شخصية ISFP (المغامرون) يتعاملون مع صداقاتهم بنفس الطريقة التي يتعاملون بها مع الحياة – بفضول وانفتاح وتقدير عميق للفردية. إنهم الأصدقاء الذين يقفون بجانبك لتشجيعك في أوقات نجاحك الكبيرة ويقدمون لك كتفًا تستند عليه في أوقات انكسارك. مهارتهم في التقاط الإشارات العاطفية وفهم المشاعر تجعلهم أصدقاء متعاطفين للغاية يوفرون حضورًا مطمئنًا وأذنًا صاغية في أوقات الأزمات أو الحيرة.'''),
          TabsCloumn(
              text1: 'الاستمتاع بالحياة معًا',
              text2:
                  '''شخصيات ISFP تؤمن بالأفعال أكثر من الأقوال، وهذا الشغف بالأفعال يساعدهم على التغلب على خجلهم عند مقابلة أشخاص جدد. عمومًا، يكونون متحفظين وحساسين للغاية – أكثر بكثير من معظم الناس. يستغرق الأمر وقتًا لبناء الثقة الكافية مع الأصدقاء الجدد ليشعروا بالراحة والانفتاح.

لكن عندما يكونون مع أصدقاء يثقون بهم، يعرفون كيف يسترخون ويتخلون عن القواعد والتقاليد والتوقعات لصالح الاستمتاع باللحظة. يسعد أشخاص ISFP بالتوافق مع أي شخص تقريبًا، لكن يجب أن يتجنب الأصدقاء المحتملون أن يكونوا متطلبين أو كثيري الانتقاد. إذا بدأ المعارف الجدد بتقديم نصائح مثل، "ستكون أفضل حالًا إذا..."، فمن غير المرجح أن تتطور العلاقة إلى صداقة عميقة – لأن ISFPs يأخذون هذه الملاحظات بشكل شخصي للغاية.

إذا كان الأصدقاء داعمين وسهلين في تعاملهم، فعادةً ما يعيد ISFPs اللطف بمزيد من الدفء والضحك. قد يقترحون حتى مغامرات عفوية على طول الطريق، مما يجعل صداقاتهم مثيرة ومليئة بتجارب مشتركة فريدة. وبالنسبة للأشخاص الذين يفضلون بيئات آمنة ومهيكلة، قد تكون هذه الصداقات تحديًا لهم – خاصة إذا كانوا يميلون إلى توجيه محاضرات لهذه الشخصيات العفوية حول كيفية عيش حياتهم. كما هو الحال مع أي انتقاد، يمكن لهؤلاء الأصدقاء أن يفعلوا ما يرونه مناسبًا ويتركوا ISFPs ليعيشوا حياتهم بطريقتهم الخاصة.

بشكل عام، يعتبر توفير مساحة شخصية كبيرة والحرية أمرًا ضروريًا لأشخاص ISFP. وكما أنهم يقدرون الحرية في تشكيل حياتهم، فإنهم يحترمون استقلالية أصدقائهم أيضًا. نادرًا ما يفرضون آرائهم على الآخرين، مما يساهم بشكل كبير في خلق بيئة مريحة في صداقاتهم. لا يوجد صديق أفضل من ISFPs للاستمتاع بالمرح البسيط وخالٍ من التوتر.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'مقدمة تعريفية',
              text2:
                  '''أصحاب شخصية ISFP (المغامرون) هم فنانون حقيقيون – ولكن ليس بالضرورة بالمعنى التقليدي. بالنسبة لهذه الشخصيات، تُعتبر الحياة نفسها لوحة للتعبير عن الذات. من طريقة لباسهم إلى كيفية قضاء أوقات فراغهم، يتصرفون بطرق تعكس بوضوح هويتهم كأفراد مميزين.

بروحهم الاستكشافية وقدرتهم على العثور على الفرح في الحياة اليومية، يمكن أن يكون الأشخاص من نوع ISFP من بين أكثر الأشخاص إثارة للاهتمام الذين قد تقابلهم يومًا.
مدفوعون بحسهم العميق بالعدالة وانفتاحهم الذهني، يتحرك أصحاب شخصية ISFP في الحياة بروح مشجعة ومعدية. يحبون تحفيز المقربين منهم على متابعة شغفهم، وعادة ما يتبعون اهتماماتهم الخاصة بنفس الحماس العفوي.
أما المفارقة؟ فمع تواضعهم وبساطتهم، يميل أصحاب هذه الشخصية إلى رؤية أنفسهم كأشخاص "يقومون بأمورهم الخاصة" فقط، لذلك قد لا يدركون حتى مدى تميزهم الحقيقي.'''),
          TabsCloumn(
              text1: 'جمال العقل المنفتح',
              text2:
                  '''يتبنى أصحاب شخصية ISFP نهجًا مرنًا وقابلًا للتكيف في الحياة. بينما تزدهر بعض الشخصيات على الجداول الصارمة والروتينات، يفضل الـ ISFPs التعامل مع كل يوم كما يأتي، ويفعلون ما يشعرون أنه مناسب في تلك اللحظة. يحرصون على ترك مساحة كبيرة في حياتهم للمفاجآت، مما يجعل العديد من ذكرياتهم الأكثر اعتزازًا مرتبطة بخروجات ومغامرات عفوية وغير مخطط لها، سواء كانوا بمفردهم أو مع أحبائهم.

هذا العقل المرن يجعل أصحاب هذه الشخصية متسامحين وغير متحيزين بشكل استثنائي. فهم يقدرون التنوع الموجود في العالم بصدق، ويرحبون بالأشخاص الذين قد يحملون آراءً مختلفة أو يمارسون أنماط حياة فريدة. لذا، ليس من المستغرب أنهم نادرًا ما يحاولون إقناع الآخرين بتغيير ما هم عليه أو ما يؤمنون به.'''),
          TabsCloumn(
              text1: 'العيش في وئام',
              text2:
                  '''في علاقاتهم، يتميز أصحاب شخصية ISFP بالدفء والود والرعاية، حيث يستمتعون بشكل كامل بصحبة أحبائهم. لكن لا تخطئ الظن: فهم بحاجة إلى وقت مخصص لأنفسهم لإعادة شحن طاقتهم بعد التفاعل مع الآخرين. هذا الوقت الخاص يمنحهم الفرصة لإعادة تأكيد هويتهم الشخصية – بمعنى آخر، للاتصال من جديد بما هم عليه حقًا.

إبداعيون وأحرار الروح، يسير أصحاب هذه الشخصية على إيقاعهم الخاص. قد يكون من السهل افتراض أنهم لا يهتمون كثيرًا بما يعتقده الآخرون عنهم، لكن غالبًا ما يكون الأمر عكس ذلك. فهم متأملون ومتفهمون، وقادرون على التقاط المشاعر والآراء غير المعلنة للآخرين، وقد يزعجهم إذا لم يشعروا بأنهم محبوبون أو معترف بهم أو مقدرون. إن تقبلهم العاطفي وطبيعتهم الحساسة بشكل حقيقي قد يكونان جزءًا من السبب الذي يجعلهم متسامحين للغاية مع الآخرين. وإذا كان هناك نوع من الشخصيات يؤمن بإعطاء فرصة ثانية لشخص ما أو شيء ما، فهو بالتأكيد الـ ISFP.

على الرغم من التحديات التي قد يواجهها أصحاب شخصية ISFP بسبب حساسيتهم، فإنهم يعيشون في الحاضر، ويدركون أنه ليس من الضروري التوقف عند الجروح أو الإحباطات الماضية. بدلًا من التركيز على كيف يمكن أن تكون الأمور مختلفة، يتمتع الأشخاص من هذا النوع بقدرة مذهلة على تقدير ما هو جميل في الحياة كما هي. في كل مكان ينظرون إليه، يمكنهم العثور على مصادر للجمال والمتعة التي قد يفوتها الآخرون – وهذا المنظور هو واحد من العديد من الهدايا التي يقدمونها للعالم.'''),
        ]),
      ])
    ]);
  }
}
