import 'package:flutter/material.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Info_Patterns.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Tab_Patterns.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Tabs_Column.dart';
import 'package:gradution_project/View/features/EachPatternInfo/patternsstructure.dart';
import 'package:gradution_project/View/features/EachPatternInfo/tabslistview.dart';


class Isfj extends StatelessWidget {
  const Isfj({super.key});

  @override
  Widget build(BuildContext context) {
    return const Patternsstructure(childs: [
      Infopatterns(
          text1: 'ISFJ',
          text2: 'مدافع',
          text3:
              '''نوع شخصية القنصل فريدة من نوعها تماماً، لأن هناك العديد من الصفات التي تحدد سماتهم الفردية. وعلى الرغم من كون المدافعون من الشخصيات المتفهِّمة المراعية للمشاعر، إلا أنهم قد يكونوا شرسين عندما تضطرهم الظروف لحماية عائلاتهم أو أصدقائهم؛ وعلى الرغم من هدوء المدافعين وتحفُّظهم، عادةً ما يتمتعون بمهارات متقدمة في التعامل مع الناس وعلاقات اجتماعية قوية، وعلى الرغم من أن شخصية المدافع تنشُد الأمن والاستقرار، إلا أنها تتقبل التغيير بشكل ملحوظ ما دامت تشعر بأنها مفهومة ومقدَّرة.''',
          image: 'assets/isfj2.png'),
      Tabpatterns(tabchilds: [
        TabsListView(childs: [
          TabsCloumn(
              text1: 'عادات مكان العمل',
              text2:
                  '''بغض النظر عن موقعهم في السلم الوظيفي، يتشارك الأشخاص ذوو شخصية ISFJ (المدافعون) في هدف واحد: تقديم الخدمة الجيدة والتفاني فوق كل شيء. يمكن الاعتماد دائمًا على شخصيات ISFJ بفضل لطفهم وقدرتهم على الاستماع بعناية إلى المخاوف وإيجاد طرق لحلها. إن إيجاد حلول تفيد جميع الأطراف هو جزء أساسي من نهجهم، ولا توجد شخصية أخرى تنافسهم في الرضا الذي يشعرون به عند إيجاد حلول عملية وواضحة للتحديات اليومية.'''),
          TabsCloumn(
              text1: 'الموظفون من نوع ISFJ',
              text2:
                  '''كموظفين، يمثل الأشخاص ذوو شخصية ISFJ قوة الالتزام المتواضع.يمكن الاعتماد عليهم واحترامهم بفضل صبرهم وتفانيهم، وهم بحاجة إلى مكافأة واحدة فقط على عملهم: رضاهم عن مساعدة الآخرين. 
وإذا عبّر الشخص المستفيد عن امتنانه، فإن ذلك يجعلهم أكثر سعادة. غالبًا ما تجعل ولاء ISFJ واعتماديتهم منهم أشخاصًا لا غنى عنهم لرؤسائهم. في الواقع، هم الشخصية الأكثر احتمالاً للتوافق مع رؤسائهم. قد يرجع ذلك جزئيًا إلى أن هذه الشخصيات تُظهر قدرًا كبيرًا من الدقة في تنفيذ المهام دون شكاوى، وأيضًا لأنهم أفراد يتميزون بالتفكير العميق والدفء، ويبذلون جهدًا للتعرف على الأشخاص من حولهم.

ومع ذلك، فإن نفور شخصيات ISFJ من إثارة المشاكل قد يجعل من الصعب عليهم تصحيح أو مخالفة رؤسائهم أو زملائهم، حتى عندما يكون ذلك ضروريًا لتجنب إهدار الوقت والجهد. لحسن الحظ، مع مرور الوقت، يتعلم العديد من ISFJ التعبير عن آرائهم (وتصحيحاتهم) بطريقة لطيفة وغير انتقادية.'''),
          TabsCloumn(
              text1: 'المديرون من نوع ISFJ',
              text2:
                  '''في الواقع، غالبًا ما يفضلون تلقي التعليمات بدلاً من إعطائها، ولكن مهاراتهم الشخصية وأخلاقيات العمل تجعلهم مناسبين تمامًا لإدارة الآخرين. عادة ما يكون مديرو ISFJ دافئين وسهلين في التعامل، دائمًا على استعداد للإجابة على الأسئلة وتقديم المساعدة. نظرًا لعدم وجود رغبة حقيقية لديهم لممارسة السلطة على الآخرين، يفضلون العمل جنبًا إلى جنب مع مرؤوسيهم، لضمان سير الأمور بسلاسة وتقليل الصراعات.

يهتم مديرو ISFJ بالكفاءة والفعالية، لكنهم لا يفضلون تحقيق ذلك على حساب العلاقات الإيجابية مع فريقهم. قد يكون التغيير تحديًا كبيرًا بالنسبة لهؤلاء المدراء، بما في ذلك اتخاذ القرارات الصعبة مثل فصل موظف لا يحقق الأداء المطلوب. في بعض الأحيان، قد يبذل مديرو ISFJ الكثير من طاقتهم في محاولة مساعدة موظف غير منتج، ولكنهم يفضلون ارتكاب هذا الخطأ بدلاً من ارتكاب خطأ التخلي عن شخص كان بحاجة فقط إلى فرصة أخرى.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'مسارات الحياة المهنية',
              text2:
                  '''أصحاب الشخصية ISFJ (المدافعون) يتعاملون مع مساراتهم المهنية بنفس الالتزام والصبر والتفاني الذي يظهرونه في جوانب حياتهم الأخرى. لهذا السبب، غالبًا ما يُنظر إليهم على أنهم العمود الفقري لمكان عملهم.
ISFJ يتميزون بالموثوقية والاجتهاد، وهم دائمًا مستعدون لمد يد العون لمن يحتاجها. يشعرون بالفخر عند إنجاز العمل بشكل كامل ودقيق، نادرًا ما يتجنبون المهام التي تتطلب وقتًا أو جهدًا. هذا الالتزام الراسخ بأخلاقيات العمل، إلى جانب رغبتهم الحقيقية في خدمة الآخرين، يجعل من شخصيات ISFJ إضافة لا غنى عنها في مجموعة واسعة من المهن.'''),
          TabsCloumn(
              text1: 'التألق خلف الكواليس',
              text2:
                  '''قلة من أنواع الشخصيات يمكن أن تضاهي التقدير العميق لشخصيات ISFJ لما يعنيه لعب دور داعم. بدلاً من البحث عن الأضواء لأنفسهم، فإنهم يستمتعون حقًا بمساعدة الآخرين ودعمهم. لذا، ليس من المستغرب أن يسعى أصحاب شخصية ISFJ إلى أماكن عمل تعاونية تعتمد على العمل الجماعي بدلاً من أن تكون تنافسية أو ذات ضغط عالٍ.

بفضل تواضعهم الطبيعي، يجدون الرضا في المهن التي تتيح لهم تعزيز نمو الآخرين وشفائهم وتقدمهم. صبرهم وقدرتهم على البقاء حاضرين في اللحظة تجعلهم على درجة عالية من الوعي باحتياجات الأشخاص الذين يخدمونهم. التعليم مثال بارز على مهنة تستفيد من هذه القوى لدى ISFJ، وكذلك العلاج بالنطق، العلاج الوظيفي، العلاج الطبيعي، الطب، والعمل الاجتماعي.'''),
          TabsCloumn(
              text1: 'عدم تفويت أي تفصيل',
              text2:
                  '''بعض أنواع الشخصيات تفقد حماسها عند مواجهة مهمة مملة ومتعددة الجوانب، لكن ليس ISFJ. فاهتمامهم بالتفاصيل هو من أعظم نقاط قوتهم. وبفضل ذلك، فإن المجالات التي تعتمد على الاهتمام بالتفاصيل، مثل القانون، والمحاسبة، وتحليل البيانات، والبحث، تكون مناسبة جدًا لأصحاب هذه الشخصية. الأمر اللافت بشكل خاص هو كيف يبقون متصلين بالجانب الإنساني من هذا العمل، نادرًا ما ينسون التأثير الذي يمكن أن تحدثه جداول البيانات أو المذكرات الخاصة بهم على الأشخاص الحقيقيين.

ورغم مواهبهم العديدة، فإن هؤلاء الأشخاص غالبًا ما يرفضون المطالبة بالاعتراف بإنجازاتهم أو السعي للحصول على الترقيات، مفضلين أن تتحدث أعمالهم عن نفسها. وبالنظر إلى احترامهم للتقاليد والأمان الوظيفي، فإنهم عادة لا يواجهون مشكلة مع فكرة التقدم في تسلسل هرمي منظم، حيث يثقون أن رؤساءهم سيمنحونهم الترقيات في الوقت المناسب. ولكن حتى الشخص الأكثر صبرًا يمكن أن يشعر بالإحباط إذا بدت مساهماته تُغفل باستمرار. وعندما يقرر أصحاب شخصية ISFJ أخيرًا اتخاذ خطوة نحو الأدوار الإدارية، يكتشفون غالبًا أن نقاط قوتهم تتناسب بشكل كبير مع بناء فريق مترابط، منتج، وفعّال.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'الأبوة',
              text2:
                  '''الأشخاص من أصحاب شخصية ISFJ (المدافعون) هم آباء مخلصون ومسؤولون يرون في الأبوة أو الأمومة ليس مجرد دور بل دعوة حقيقية. يجلب ISFJs إحساسهم الفطري بالتفاني، والموثوقية، والاتساق إلى أسلوبهم في التربية، بهدف توفير أساس مستقر يساعد أطفالهم على النمو ليصبحوا أفرادًا قادرين وناجحين وسعداء.

ولكن فيما يتعلق بالأبوة أو الأمومة، لا يقتصر دافع ISFJs على الشعور بالواجب – بل هو أيضًا مدفوع بالحب، وهذا الحب العميق والقوي يمكن أن يكون مذهلاً بكل معنى الكلمة. يشعر العديد من أصحاب هذه الشخصية أن الأبوة والأمومة تمنحهم فرصة لاستخدام هباتهم في الإيثار، والكرم، والصبر أثناء عملهم الدؤوب لتوجيه روح جديدة جميلة في العالم.'''),
          TabsCloumn(
              text1: 'الطريق إلى الاستقلال',
              text2:
                  '''نظرًا لأن أصحاب شخصية ISFJ يقدرون التقاليد والإرشاد، فلا عجب أن العديد منهم يتبنون أدوارًا واضحة ومحددة للآباء والأبناء. لا يرون أنفسهم كأصدقاء أو أقران لأطفالهم، بل ينظرون إلى دورهم، وغالبًا ما يكون هذا صحيحًا، كسلطة محبة – شخص يشارك الحكمة والقيم، ويعلم أطفالهم برفق وحزم الفرق بين الصواب والخطأ.

قد يكون من الصعب على الآباء من نوع ISFJ التعامل مع المرحلة التي يحاول فيها أطفالهم، كجزء من تطورهم الطبيعي، تأكيد استقلاليتهم. في هذه المرحلة، يميل الأطفال إلى اختبار الحدود، وتجربة طرق جديدة لفعل الأشياء، واتخاذ قراراتهم الخاصة – مما قد يتضمن أحيانًا معارضة نصائح وقيم آبائهم.
'''),
          TabsCloumn(
              text1: 'فيض من الحب',
              text2:
                  '''لحسن الحظ، تُعرف شخصيات ISFJ بحفاظها الدائم على مقدار الحب الكبير الذي تكنّه لأطفالها. صحيح أن الآباء من هذا النوع قد يكونون أحيانًا مفرطين في جهودهم لتوجيه أطفالهم نحو الطريق الذي يعتقدون أنه الأفضل لهم. ومع ذلك، حتى إذا قرر أطفالهم السير في اتجاه مختلف، فهذا لا يعني أن ISFJ سيتوقفون عن حبهم أو عن محاولة مساعدتهم للعثور على طريقهم نحو السعادة.

الحقيقة هي أن التربية ليست سهلة لأي نوع من الشخصيات – على الأقل إذا كان الوالدان يقومان بها على النحو الصحيح. ومع ذلك، يتمتع ISFJ بميزة الجمع بين العناية المدروسة والمسؤولية في تقديم تلك الرعاية. وغالبًا ما يُنظر إليهم على أنهم آباء مثاليون، حيث يستطيعون توفير الاستقرار والأمان – والأهم من ذلك – فيضًا من الحب والدعم لأطفالهم.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'العلاقات الرومانسية',
              text2:
                  '''العلاقات الرومانسية تكشف عن جانب من شخصية ISFJ (المدافعون) قد لا يكون واضحًا من النظرة الأولى. تحت مظهرهم الصبور والمتواضع، ينبض هؤلاء الأشخاص بالتزام عاطفي عميق وولاء تجاه من يحبونهم. في بعض الأحيان، قد يفاجأ هؤلاء الأشخاص أنفسهم بشدة مشاعرهم – خاصة رغبتهم القوية في حماية شريك حياتهم ورعايته.
تتسم مشاعر أصحاب شخصية ISFJ بالعمق لدرجة تجعلهم يواجهون صعوبة في بعض الأحيان في العثور على الكلمات المناسبة للتعبير عن مدى أهمية شريك حياتهم بالنسبة لهم. ولكنهم يظهرون حبهم بطرق لا تُحصى في حياتهم اليومية. دائمًا ما يكونون متحمسين لجعل حياة أحبائهم أفضل وأكثر راحة، ويمكنهم تحويل أبسط المهام – مثل إعداد العشاء أو تنظيم رحلة عطلة نهاية الأسبوع – إلى إيماءة حب صادقة.'''),
          TabsCloumn(
              text1: 'شخصية ISFJ في الحب',
              text2:
                  '''على الرغم من أن أصحاب شخصية ISFJ يتمتعون عادةً بروح المبادرة وقدرتهم على الإنجاز، إلا أنهم غالبًا ما يجدون صعوبة في اتخاذ الخطوة الأولى في العلاقات العاطفية. قد يكون طلب مواعدة شخص ما أمرًا غير مريح للغاية بالنسبة لهم، حيث يميلون إلى القلق ليس فقط بشأن احتمال الرفض، ولكن أيضًا بشأن احتمال انتهاك قواعد اجتماعية غير معلنة. الأخبار السيئة هي أن ISFJs قد يشعرون بالجمود، راغبين في بدء علاقة ولكن منتظرين الطرف الآخر لاتخاذ الخطوة الأولى.

عندما يجدون أنفسهم في علاقة، فإن ISFJs يتسمون بالالتزام. يجد هؤلاء الأشخاص إشباعًا عميقًا في مشاركة وقتهم، طاقتهم، وعاطفتهم مع شخص آخر. كشركاء، فإنهم عادةً ما يكونون داعمين وسخيّين للغاية.
لا يأخذون علاقاتهم باستخفاف، ولا يستسلمون بسهولة – حتى عند مواجهة التحديات التي لا مفر منها. يميل أصحاب شخصية ISFJ إلى تقدير واقعي للجهد المطلوب لبناء علاقة طويلة الأمد وصحية، وهم على استعداد تام لبذل الجهد اللازم لبناء رابط قوي مع الشخص الذي يعتزّون به.'''),
          TabsCloumn(
              text1: 'سلامة القلب',
              text2:
                  '''النهج الواقعي الذي يتبناه أصحاب شخصية ISFJ في الحياة قد يخفي المشاعر القوية والعميقة التي تسكن داخلهم. ليس من المفاجئ إذن أن يحتاج هؤلاء الأشخاص وقتًا أطول من غيرهم للتعافي من ألم الانفصال أو حتى من خلاف مؤلم بشكل خاص. نظرًا لأن ISFJs يقدمون الكثير من أنفسهم في علاقاتهم، فإنهم قد يشعرون بجرح عميق عندما يعتقدون أن الطرف الآخر لا يبادلهم نفس القدر من الحب، الالتزام، الاحترام، أو التقدير.

لسوء الحظ، قد يجد أصحاب شخصية ISFJ صعوبة في إنهاء العلاقة – حتى عندما تكون العلاقة غير ناجحة. قد يستمرون في البقاء نتيجة ولاء في غير محله، خوف عام من التغيير، أو أمل بأنهم يستطيعون بطريقة ما إصلاح المشكلات وتحسين الأمور.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(text1: 'نقاط القوة', text2: '''داعمون
يتمتع أصحاب شخصية ISFJ (المدافعون) بمساعدة الآخرين بكل سرور، حيث يشاركون معارفهم واهتمامهم وخبراتهم مع أي شخص يحتاجها. يسعى المدافعون إلى تحقيق مواقف تحقق الفوز للجميع، مفضلين العمل الجماعي على المنافسة كلما كان ذلك ممكنًا.

يمكن الاعتماد عليهم
بدلاً من العمل بنوبات متقطعة ومليئة بالحماس التي تترك الأمور غير مكتملة، يتبع المدافعون نهجًا دقيقًا وحذرًا. يتعاملون بثبات لضمان إنجاز الأمور بأعلى المعايير – وغالبًا ما يتجاوزون ما هو مطلوب منهم. بالإضافة إلى ذلك، يتفق معظم المدافعين على أن الحفاظ على الانضباط والموثوقية يصبح أسهل مع مرور الوقت.

مراقبون جيدون
يتمتع أصحاب الشخصية ISFJ بموهبة ملاحظة الأشياء، لا سيما المتعلقة بالآخرين. يركزون على أدق التفاصيل في ما يقوله ويفعله الآخرون، مما يمنحهم رؤى غير متوقعة حول حياة الآخرين ومشاعرهم.

متحمسون
عندما يكون الهدف صحيحًا، يكرس المدافعون جميع مواهبهم لتحقيق شيء يعتقدون أنه سيحدث فرقًا حقيقيًا وإيجابيًا في حياة الآخرين – سواء كان ذلك عبر مبادرة عالمية لمحاربة الفقر أو ببساطة إسعاد عميل في العمل.

مجتهدون
لا يكتفي أصحاب الشخصية ISFJ بإنجاز أعمالهم، بل يفخرون بالقيام بما هو أبعد من جميع مهامهم ومسؤولياتهم. غالبًا ما يكون لديهم ارتباط عاطفي بالمشاريع والمنظمات التي كرسوا أنفسهم لها، ولن يرتاحوا حتى يكملوا نصيبهم – أو أكثر من نصيبهم – من العمل لتقديم المساعدة.

مهارات عملية جيدة
تقدم شخصية ISFJ مزيجًا نادرًا من طبيعة إيثارية وعملية مكتسبة بصعوبة. فهم لا يكتفون بمجرد الرغبة في مساعدة الآخرين، بل يتخذون خطوات فعلية – مما يعني أنهم أكثر من سعداء بتشمير سواعدهم والقيام بما يلزم للعناية بأصدقائهم وعائلاتهم وأي شخص آخر يحتاج إلى المساعدة.'''),
          TabsCloumn(text1: 'نقاط الضعف', text2: '''تواضع مفرط
يهتم أصحاب شخصية ISFJ بمشاعر الآخرين إلى حد قد يدفعهم إلى الامتناع عن التعبير عن آرائهم أو المطالبة بالاعتراف المستحق بمساهماتهم. غالبًا ما يقللون من أهمية جهودهم بالكامل إذا شعروا بأنهم كان بإمكانهم تحسين جانب بسيط من المهمة.

حساسية مفرطة
على الرغم من محاولتهم إخفاء ذلك، فإن الأشخاص ذوي شخصية ISFJ حساسون جدًا لآراء الآخرين، وقد يفقدون توازنهم إذا لم يُقدّر أحد جهودهم أو يوافق عليها. عند مواجهة النقد أو الاختلاف – حتى وإن كان بنوايا حسنة – قد يشعرون وكأنهم يتعرضون لهجوم شخصي.

كبت مشاعرهم
بسبب طبيعتهم الخاصة والمتحفظة، يميل المدافعون إلى كبت مشاعرهم، خاصة السلبية منها. هذا يمكن أن يخلق سوء فهم في علاقاتهم. وفي النهاية، قد تتراكم كل هذه المشاعر المكبوتة وتظهر في لحظة واحدة على شكل نوبة إحباط مفاجئة وغير مألوفة.

التردد في التغيير
يُعتبر أصحاب شخصية ISFJ من أكثر الشخصيات التي تواجه صعوبة في التعامل مع التغيير. فكسر التقاليد ليس سهلاً على هذه الشخصيات الثابتة التي تولي قيمة كبيرة للتاريخ والسوابق. حتى عندما يكون التغيير ضروريًا، قد ينتظرون حتى تصل الأمور إلى نقطة حرجة قبل اتخاذ خطوة للتكيف.

إيثار مفرط
الطبيعة العطوفة والسخية لأصحاب شخصية ISFJ تجعلهم عرضة للاستغلال من قبل الآخرين. يجدون صعوبة في إثارة الخلاف ومواجهة الأشخاص الذين لا يؤدون واجباتهم. في الواقع، يُعتبر المدافعون الأكثر احتمالاً للقول بأنهم يفضلون تنظيف الفوضى التي يسببها الآخرون بدلاً من مواجهتهم مباشرة.
'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'الصداقات',
              text2:
                  '''نظرًا لدفء شخصيات ISFJ ودعمها وسخائها، ليس من المستغرب أن ينجذب الآخرون إليهم كأصدقاء. لكن على الرغم من أنهم يقدرون صداقاتهم ويعتزون بها، إلا أنهم لا يجدون سهولة في بناء روابط مع أي شخص.

يميل الأشخاص من هذا النمط إلى الخصوصية ويكونون قليلاً أكثر حماية لأنفسهم. ونتيجة لذلك، قد يستغرق الأمر وقتًا قبل أن ينفتحوا على شخص جديد. يفسر هذا السبب في أن معظم صداقات ISFJ لا تبدأ كلقاءات عشوائية في ليلة صاخبة، بل من خلال تواصل مريح ومستمر – على سبيل المثال، في المدرسة أو العمل. شخصيات ISFJ تقدر الفرصة لتقوية الروابط مع شخص آخر مع مرور الوقت، تدريجيًا ومشاركة المزيد والمزيد عن أنفسهم.'''),
          TabsCloumn(
              text1: 'الانسجام مع الآخرين',
              text2:
                  '''في أعماقهم، يتوق معظم أصحاب الشخصية ISFJ لأن يكونوا محبوبين ومقبولين. هذا رغبة طبيعية تُفسر سبب شهرتهم كأصدقاء مُراعين وموثوقين. يهتم ISFJs بما يعتقده الآخرون عنهم، لذلك يسعون دائمًا لإظهار أفضل ما لديهم في جميع علاقاتهم، بما في ذلك صداقاتهم.

هذا السلوك يجعل ISFJs أصدقاء استثنائيين. ومع ذلك، إذا تمادى الأمر، فقد يجدون أنفسهم في فخ محاولة إرضاء الجميع. على عكس بعض الشخصيات التي لا تواجه مشكلة في التعبير عن رأي غير شائع أو طرح سؤال محرج، يميل ISFJs إلى تجنب إثارة المشاكل، سواء كان ذلك يعني طلب استرداد قرض أو الاختلاف مع اختيار مكان العشاء.

عادةً ما ينبع هذا السلوك من الخوف من الرفض. وبينما يكون معظم ISFJs مرتاحين تمامًا لوجود دائرة صغيرة ومقربة من الأصدقاء، يزعجهم بشدة فكرة فقدان قبول أحد هؤلاء الأصدقاء. المشكلة هي أنه، مع مرور الوقت، قد تؤدي محاولة إرضاء الآخرين إلى فقدانهم الشعور بهويتهم وقدرتهم على اتخاذ القرارات بناءً على شروطهم الخاصة.'''),
          TabsCloumn(
              text1: 'السعي لتحقيق التوازن',
              text2:
                  '''من النادر أن يضاهي أي نوع شخصية آخر الرغبة الشديدة لدى أصحاب الشخصية ISFJ في دعم أصدقائهم في جميع الظروف. دائمًا مستعدون لتقديم النصيحة والمساعدة والطمأنينة، يفخر ISFJs بأن الناس يلجؤون إليهم في أوقات الحاجة.
في الواقع، قد يتجاهلون ميلهم الطبيعي لتجنب المواجهات عندما يتعلق الأمر بأقرب أصدقائهم، حيث يقفون للدفاع عنهم إذا تم التشكيك في شخصياتهم أو تعرضوا لأي أذى. إن تواجدهم بجانب أحبائهم بأي طريقة ممكنة يمنح أصحاب هذه الشخصية شعورًا حقيقيًا بالهدف في الحياة.

يتوق أصحاب الشخصية ISFJ إلى الولاء والاحترام – وفي عالم مثالي، بعض التقدير لكل ما يقدمونه. ومع ذلك، على الرغم من أن العديد منهم يرغبون في الحصول على الدعم والتشجيع من أصدقائهم، إلا أنهم غالبًا ما يكونون فخورين جدًا بطلب ذلك، تمامًا كما قد لا يشعرون بالراحة عند طلب المساعدة التي يحتاجونها.
لحسن الحظ، مع مرور الوقت، يتعلم العديد من أصحاب هذه الشخصية أن أي شخص يستغل طبيعتهم الكريمة والإيثارية ليس صديقًا حقيقيًا.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'مقدمة تعريفية',
              text2:
                  '''بطريقتهم المتواضعة والبسيطة، يساهم الأشخاص الذين يتمتعون بشخصية ISFJ (المدافعون) في الحفاظ على توازن العالم. يتميزون بالعمل الجاد والتفاني العميق، ويشعرون بمسؤولية كبيرة تجاه من حولهم. يُعتمد عليهم في الوفاء بالمواعيد النهائية، وتذكر أعياد الميلاد والمناسبات الخاصة، والحفاظ على التقاليد، وتقديم الدعم والرعاية لأحبائهم. ومع ذلك، نادرًا ما يطالبون بالتقدير أو الاعتراف بجهودهم، مفضلين العمل خلف الكواليس.
يمتلك هذا النوع من الشخصية مجموعة متنوعة من القدرات. فرغم حساسيتهم واهتمامهم بالآخرين، يتمتع ISFJs بمهارات تحليلية ممتازة ودقة في الملاحظة. وعلى الرغم من تحفظهم، فإنهم عادة ما يتمتعون بمهارات اجتماعية متطورة وعلاقات اجتماعية قوية. هؤلاء الأشخاص هم بالفعل أكثر من مجرد مجموعة من الصفات، إذ تبرز قوتهم المتنوعة في حتى أكثر الجوانب العادية في حياتهم اليومية.'''),
          TabsCloumn(
              text1: 'هبة الولاء',
              text2:
                  '''إحدى أعظم نقاط القوة لدى شخصيات ISFJ هي الولاء. فهم نادرًا ما يتركون صداقة أو علاقة تتلاشى بسبب قلة الجهد. بل على العكس، يستثمرون طاقة كبيرة في الحفاظ على روابط قوية مع أحبائهم – وليس فقط من خلال إرسال رسائل قصيرة مثل "كيف حالك؟". يُعرف الأشخاص الذين يتمتعون بهذا النوع من الشخصية بترك كل شيء جانبًا ومد يد العون عندما يمر صديق أو أحد أفراد العائلة بأوقات عصيبة.

يشعر ISFJs بأنهم أكثر نشاطًا وفعالية عندما يقدمون الدعم لشخص يحتاج إلى مساعدتهم. ولا يتوقف إحساسهم بالولاء عند حدود المقربين منهم فقط، بل يمتد إلى مجتمعاتهم وأماكن عملهم وحتى التقاليد العائلية. ومع ذلك، فإن شدة التزامهم ورغبتهم في الخدمة قد تنطوي على بعض الجوانب السلبية.
قد يستغل الآخرون طبيعة ISFJs المتعاونة والمجتهدة، مما يتركهم يشعرون بالإرهاق والاحتراق النفسي. وقد يشعرون بالذنب أو التوتر عندما يفكرون في قول "لا" أو إجراء تغييرات – حتى لو كانت ضرورية – على أنفسهم أو علاقاتهم أو الطريقة التي اعتادوا بها على القيام بالأشياء.'''),
          TabsCloumn(
              text1: 'أعلى المعايير',
              text2:
                  '''بالنسبة لشخصيات ISFJ، فإن "جيد بما يكفي" نادرًا ما يكون كافيًا. يمكن أن يكون هؤلاء الأشخاص شديدي الدقة إلى درجة الكمال. يأخذون مسؤولياتهم على محمل الجد، ويسعون دائمًا لبذل أقصى ما في وسعهم وتجاوز توقعات الآخرين.
ورغم اجتهادهم واتساقهم في العمل، تُعرف شخصيات ISFJ بتواضعها. نادرًا ما يسعون إلى الأضواء أو إلى التقدير العلني لما يقومون به. لكن هذا لا يعني أنهم يتقبلون عدم ملاحظتهم أو عدم تقدير جهودهم.

وبينما يميل ISFJs إلى التقليل من شأن إنجازاتهم، فهذا لا يعني أنهم لا يستمتعون بالاعتراف بمجهودهم – أو أنهم على ما يرام مع الشعور بأنهم مُهملون أو غير مقدرين. وإذا لم يتعلموا كيفية الدفاع عن أنفسهم، فقد يجدون أنفسهم يفقدون الحماس والدافع بهدوء، مما يؤدي في النهاية إلى شعورهم بالاستياء تجاه من لا يبدون تقديرًا لجهودهم.'''),
          TabsCloumn(
              text1: '''الحضور من أجل الآخرين – 
ومن أجل أنفسهم''',
              text2:
                  '''على الرغم من أنهم انطوائيون بطبيعتهم، إلا أن شخصيات ISFJ تمتلك طبيعة اجتماعية عميقة. بفضل قدرتهم على تذكر تفاصيل حياة الآخرين، يتمتعون بموهبة خاصة تجعل أصدقاءهم ومعارفهم يشعرون بأنهم محل اهتمام ومعرفة وتقدير. قلة من أنماط الشخصيات يمكنها أن تضاهي قدرتهم على اختيار الهدية المناسبة تمامًا لأي مناسبة، سواء كانت كبيرة أو صغيرة.'''),
        ]),
      ])
    ]);
  }
}
