import 'package:flutter/material.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Info_Patterns.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Patterns_Structure.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Tab_Patterns.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Tabs_Column.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Tabs_List_View.dart';


class Istj extends StatelessWidget {
  const Istj({super.key});

  @override
  Widget build(BuildContext context) {
    return const Patternsstructure(childs: [
      Infopatterns(
          text1: 'ISTJ',
          text2: 'لوجستي',
          text3:
              '''يُعتقَد أن نوع شخصية اللوجستي هو الأكثر وفرة، حيث يشكِّلون حوالي 13٪ من البشر. والخصائص المميزة لهم هي النزاهة والمنطق العملي والتفاني الذي لا يكل في أداء الواجب مما يجعلهم نواة حيوية لكثير من الأسر، فضلاً عن المنظمات التي تدعم التقاليد والقواعد والمعايير، مثل مكاتب المحاماة والهيئات التنظيمية والعسكرية. الناس من نوع شخصية اللوجستي يتمتعون بتحمل المسؤولية عن أفعالهم، ويفخرون بالعمل الذي يقومون به عند تحقيق الهدف، فلا تبخل شخصيات اللوجستي بوقتهم وطاقتهم لاستكمال كل مهمة بدأوها بالدقة والصبر.''',
          image: 'assets/istj2.png'),
      Tabpatterns(tabchilds: [
        TabsListView(childs: [
          TabsCloumn(
              text1: 'عادات مكان العمل',
              text2:
                  '''يعتبر الأشخاص الذين يتمتعون بشخصية ISTJ بمثابة الصورة النمطية للموظف المجتهد والمخلص. في جميع الأدوار الوظيفية، يسعون إلى تحقيق الهيكلية، القواعد الواضحة، واحترام السلطة والتسلسل الهرمي. بالنسبة لهم، فإن المسؤوليات ليست أعباءً، بل هي تعبير عن ثقة الآخرين بهم وفرصة لإثبات أنهم الشخص المناسب للمهمة مرة أخرى.

ومع ذلك، فإن التغيير الذي يصاحب تولي مسؤوليات جديدة أو فقدان المسؤوليات القديمة يشكل غالبًا تحديًا كبيرًا لهم. يظهر هذا التحدي بطرق مختلفة حسب موقع السلطة الذي يشغلونه، ولكنه يظل أحد أكثر العقبات أهمية التي يجب التغلب عليها.كما أن عدم الحساسية يمثل ضعفًا شائعًا لديهم، وهو جانب قد يستفيدون من تحسينه، لأن المهارات الشخصية غالبًا ما تكون عنصرًا محوريًا في التنمية الشخصية والمهنية على حد سواء.'''),
          TabsCloumn(
              text1: 'الموظفون من نوع ISTJ',
              text2:
                  '''يتمتع الأشخاص الذين لديهم شخصية ISTJ بشغف لتحمل المسؤولية، مما يجعلهم الخيار الأمثل لتولي المهام الصعبة والمشاريع غير المحببة. غالبًا ما يُعرفون بتركيزهم المذهل واهتمامهم بالتفاصيل، مما يمكّنهم من التعامل بكفاءة مع أي مشروع يتم تزويدهم بدليل إرشادي لتنفيذه.
على الجانب الآخر، قد يجعلهم هذا الموقف مترددين في التخلي عن المسؤوليات حتى عندما يكونون مثقلين بالمهام أو عندما يكون هناك شخص آخر أكثر كفاءة لتولي المهمة.'''),
          TabsCloumn(
              text1: 'المديرون من نوع ISTJ',
              text2:
                  '''يحب الأشخاص الذين يحملون شخصية ISTJ تحمل المسؤولية والاستفادة من القوة الناتجة عنها. يدفعون أنفسهم بشدة للوفاء بالتزاماتهم، وعادة ما يبذلون جهدًا يفوق المتوقع منهم، ويتوقعون أن يظهر مرؤوسوهم نفس المستوى من التفاني.
في الوقت نفسه، فإن تفضيلهم لاتباع القواعد، والالتزام بالتسلسل الهرمي، والنفور العام من الابتكار، يجعل مرؤوسيهم يسيرون على خط رفيع عند التفكير خارج الصندوق. أي خروج عن الحدود المتوقعة يجب أن يكون مدعومًا بأدلة قوية ونتائج استثنائية لإقناعهم.

يُقال إنه من الأفضل القيام بالعمل أولًا ثم طلب الإذن لاحقًا، لكن من الصعب تطبيق ذلك مع ISTJs، حيث إنهم لا يتسامحون مع إخفاقات مرؤوسيهم في الالتزام بالخطط الموضوعة مسبقًا. مع إيمانهم بأن الحقيقة (كما يرونها) أهم من الحساسية، يمكن لشخصيات ISTJ أن توجه انتقادات قاسية عند الحاجة. كما أن استعدادهم لاتخاذ قرارات صعبة يجعلهم لا يتسامحون مع أي تصرف يُفسر على أنه عدم احترام أو تجاوز للسلطة.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'مسارات الحياة المهنية',
              text2:
                  '''بينما قد تكون العديد من الشخصيات مرتاحة للعمل المرن كمستشارين أو أصحاب أعمال فردية، يركز الأشخاص من نوع شخصية ISTJ (اللوجيستيون) بشكل أكبر على بناء وظائف طويلة الأمد ومستقرة. هذا لا يعني أن اللوجيستيين غير قادرين على القيام بهذا النوع من العمل – فكثير منهم يجدون أنفسهم يفكرون فيما هو موجود وراء جدران المكاتب – لكن ما يتوقون إليه هو الاعتماد والاستقرار، وهو ما ينعكس بشكل واضح في اختيارهم للوظائف، ربما أكثر من أي جانب آخر في حياتهم.'''),
          TabsCloumn(
              text1: 'عقل راسخ',
              text2:
                  '''تشير الحقائق إلى أن معظم الوظائف التي يفضلها أصحاب شخصية ISTJ تدور حول مؤسسات تحظى بالاحترام التقليدي، وتتمتع بالسلطة، والأمان، والاتساق المستقر. تعتبر المهن كضباط عسكريين، محامين، قضاة، ضباط شرطة، ومحققين شائعة للغاية بين اللوجيستيين. وهذا منطقي، حيث لا توفر هذه الوظائف فقط الاستقرار الذي يبحث عنه هؤلاء الأشخاص، بل تتماشى أيضًا مع مبادئهم ورغبتهم في التصرف بكرامة وشرف في كل ما يقومون به.

بالطبع، لا تقتصر اختيارات ISTJ على هذه المجالات فقط – هناك العديد من الأدوار الأخرى التي تستفيد من موثوقيتهم، وموضوعيتهم، ونظرتهم الدقيقة، وقدرتهم على الحفاظ على تركيز حاد لفترات طويلة. عندما تكون الحقائق والمنطق في غير محلها، يتدخل اللوجيستيون كالمحاسبين، المدققين، محللي البيانات، مديري المالية، مديري الأعمال، والأطباء الذين يتولون تحديد القضايا والإبلاغ عنها وتصحيحها.
معظم هذه الوظائف تتيح لـ ISTJ العمل بمفردهم، وهو ما يفضلونه عادة. ولكن عندما يكون العمل الجماعي ضروريًا، فإن أفضل بيئة لهم هي تلك التي تتميز بأدوار ومسؤوليات محددة بوضوح، وتعليمات دقيقة حول كيفية تنفيذ المهام.'''),
          TabsCloumn(
              text1: 'العمود الفقري للمجتمع',
              text2:
                  '''قد يواجه أصحاب شخصية ISTJ تحديات في التعامل مع المتطلبات المتزايدة للانفتاح والتواصل الاجتماعي في بيئة العمل الحديثة. وبسبب قلة ممارستهم لفهم مشاعر الآخرين، يمكن أن تبدو مقاربتهم القائمة على "الحقائق فقط" منفرة، خاصة عند التعامل مع شخصيات أكثر حساسية. ينطبق هذا الأمر ليس فقط على زملاء العمل، بل على العملاء أيضًا – حيث تكون الوظائف الخدمية مثل البيع بالتجزئة والعمل في المطاعم، بالإضافة إلى المهن التي تتطلب تفاعلات عاطفية مكثفة مثل الطب النفسي، عادةً تحديًا أكبر بالنسبة لهم.

أفضل المسارات المهنية لشخصيات ISTJ تميل إلى التركيز على اتجاه واحد: إعطاء الأولوية للحقائق فوق المشاعر، مما يسمح لهم بالحفاظ على المعايير الصارمة التي تشكل العمود الفقري للمجتمع. القوانين هي أساس كل ما يعتبره الناس أمرًا مفروغًا منه في الحياة الحديثة، بدءًا من العقد الاجتماعي الذي يسهل العلاقات، إلى القوانين التي تحمي أبسط حقوق الإنسان، إلى الدساتير والمعاهدات التي تحكم الدول. يتولى أصحاب هذه الشخصية أدوارًا كمدافعين عن هذه الأفكار، بطرق كبيرة وصغيرة، ويحق لهم أن يفخروا بذلك.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'الأبوة',
              text2:
                  '''الأشخاص من نوع شخصية ISTJ (اللوجستيون) غالبًا ما يشعرون بالراحة عند تولي دور الوالدية والمسؤوليات التي تصاحبها. يمتزج إحساسهم بالانضباط والشرف بشكل جيد مع تقليد قائم منذ الأزل: تربية الأطفال ليصبحوا أفرادًا محترمين ومساهمين في المنزل والمجتمع ككل. وكما هو الحال مع معظم التزاماتهم، لا يأخذ ISTJ دور الأبوة بخفة، بل يجعلون من هذا الدور مهمة أساسية لضمان أن هذا التقليد يتم الحفاظ عليه بأعلى المعايير.

ومع ذلك، قد لا يكون هذا النهج سهلاً دائمًا على أطفالهم، حيث يميل ISTJ إلى أن يكونوا صارمين، مع وضع معايير وتوقعات عالية. هؤلاء الآباء ينشئون بيئات مستقرة ومحددة بوضوح لأطفالهم، مع التركيز دائمًا على مساعدتهم في تطوير إحساسهم بمكانتهم في المجتمع وأداء أدوارهم بشكل فعال.'''),
          TabsCloumn(
              text1: 'القيادة بالمبادئ',
              text2:
                  '''الآباء من نوع شخصية ISTJ يتميزون بمبادئ قوية، حيث يقدرون الصبر والعمل الجاد، وهما من الصفات التي غالبًا ما يجد الأطفال صعوبة في تبنيها. ومع ذلك، يتوقع هؤلاء الآباء أن يلتزم أطفالهم بهذه المعايير ويتشاركوا هذه القيم لمصلحتهم الخاصة. وعلى الرغم من أن هذا النهج قد يؤتي ثماره على المدى الطويل، إلا أنه يجب على الآباء من نوع ISTJ أن يدركوا أن طريقتهم هذه قد تخلق حواجز طبيعية ومسافة تجعل الأطفال يتساءلون أحيانًا عما إذا كانوا يعملون معًا كفريق واحد.

إذا استمر هذا النهج أو تصاعد مع عناد متبادل، فقد يتحول إلى حالة دائمة في العلاقة، وهو شيء قد يندم عليه كل من الآباء من نوع ISTJ وأطفالهم في النهاية. لذلك، من الأفضل لهم التمسك بقيمهم الخاصة – مع الاعتراف بأن لكل شخص أهدافه الخاصة – ومحاولة الوصول إلى منتصف الطريق لدعم أطفالهم في تحقيق أهدافهم. الجمع بين تفانيهم الطبيعي وهدفهم الواضح مع المرونة في دعم رؤية أطفالهم الخاصة يؤدي إلى إحساس متبادل بالاحترام والإنجاز، وهو أمر يجعل أي والد من نوع ISTJ فخورًا.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'العلاقات الرومانسية',
              text2:
                  '''أصحاب شخصية ISTJ (اللوجستيون) يتميزون بالاعتمادية الكاملة، ويتجلى هذا السمة بوضوح في علاقاتهم الرومانسية. كونهم يميلون إلى الروتين، فإنهم يحترمون بشدة التقاليد التي نشأوا عليها، ويأملون في مشاركة ثقافتهم وقيمهم مع شريك منفتح على استكشافها معهم.

على الرغم من أن طبيعتهم المتحفظة والمنظمة قد تجعل مواعدة أصحاب هذه الشخصية أمرًا يتطلب بعض التحدي، إلا أنهم شركاء مخلصون بحق، على استعداد لتكريس قدر كبير من التفكير والجهد لضمان علاقات مستقرة ومرضية للطرفين.'''),
          TabsCloumn(
              text1: 'ملتزمون بشدة',
              text2:
                  '''لا تُعتبر المواعيد العمياء أو العلاقات العشوائية طرقًا مفضلة لدى أصحاب شخصية ISTJ (اللوجستيون) للعثور على شركاء محتملين. فمخاطر هذه المواقف وعدم القدرة على التنبؤ بما قد يحدث تثير قلقهم، والخروج لليلة مليئة بالرقص في نادٍ ليس من الأمور التي يفضلونها دون تفكير عميق وتحفظات جادة.

يفضل أصحاب هذه الشخصية طرقًا أكثر مسؤولية ومحافظة للتعارف، مثل تناول العشاء مع زميل مهتم أو – في لحظات مغامرتهم النادرة – ترتيب لقاء من خلال صديق مشترك. غالبًا ما تشمل مواعيدهم المثالية شيئًا مألوفًا لديهم، مثل تناول الطعام في مطعمهم المفضل. أي شيء خارج عن المتوقع قد يجعلهم يشعرون بالتوتر أو عدم الارتياح – وهما أمران لا يساعدان عادة في تعزيز أجواء الرومانسية.

يقترب الأشخاص من هذا النوع من العلاقات كما يفعلون مع معظم الأمور الأخرى: من منظور منطقي، يبحثون عن التوافق وتلبية الاحتياجات اليومية وطويلة الأجل للطرفين. وهذا ليس أمرًا يأخذونه بخفة، وبمجرد أن يتم تأسيس الالتزامات، يلتزمون بوعودهم حتى النهاية. يتميز أصحاب شخصية ISTJ ببناء الأسس، والوفاء بمسؤولياتهم، والحفاظ على علاقاتهم فعالة ومستقرة.'''),
          TabsCloumn(
              text1: 'قلب يمكن الاعتماد عليه',
              text2:
                  '''يمكن أن ينشغل أصحاب شخصية ISTJ (اللوجستيون) إلى درجة تجعلهم مقتنعين بصحة موقفهم لدرجة أنهم يركزون على "الفوز" في المناقشات التي يعتقدون أنها تدور حول الحقائق فقط، دون أن يدركوا أن شريكهم قد يرى الأمور من منظور مختلف قائم على الاعتبار والحساسية. وقد يشكل هذا تحديًا كبيرًا لعلاقاتهم، خاصة إذا كان الشريك أكثر حساسية. ومع ذلك، فإن شعور ISTJ العميق بالمسؤولية والالتزام يمهد الطريق لتجاوز هذه العقبة، ويحرصون على ملاحظة هذا الفارق والعمل على تحسينه في المستقبل.

وعلى الرغم من أن نهجهم الثابت قد يبدو مملًا للبعض، إلا أن هناك جاذبية لا يمكن إنكارها لهذا النهج. فالأشخاص من هذا النوع يتمتعون بإصرار هادئ وموثوقية قوية – وهي صفات نادرة بين الأنواع الأخرى من الشخصيات – مما يمكن أن يكون له تأثير إيجابي حتى على الأشخاص الأكثر تقلبًا، حيث يساعدهم على البقاء متصلين بالواقع مع استكشاف آفاق جديدة.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'نقاط القوة',
              text2:
                  '''صريح ومباشرالنزاهة جوهر شخصية ISTJ (اللوجستي). يرفضون التلاعب العاطفي والألعاب الذهنية والأكاذيب من أي نوع، مفضلين التعامل مع الواقع بطريقة بسيطة وصريحة.

منضبطيجسد أصحاب شخصية ISTJ النزاهة من خلال كلماتهم وأفعالهم. يتميزون بالصبر والعزيمة، حيث يوفون بالتزاماتهم ويحافظون على وعودهم دون تردد. يقدرون الهيكلية، ويتبعون القواعد بصرامة، ويحترمون السلطة، مما يُبرز إرادتهم القوية وطبيعتهم الملتزمة.

مسؤول للغايةيفضل أصحاب شخصية ISTJ مواصلة العمل حتى لو كان ذلك على حساب نومهم بدلًا من عدم الوفاء بما وعدوا به. مخلصون وموثوقون، غالبًا ما يؤدون واجباتهم تجاه الأشخاص والمنظمات التي التزموا بها، وفي الوقت المحدد، مع الالتزام الصارم بالإرشادات الموضوعة.

هادئ وعمليلن تكون وعودهم ذات قيمة إذا فقدوا أعصابهم عند كل علامة من علامات الصعوبة. يميل أصحاب شخصية ISTJ إلى الحفاظ على هدوئهم واتخاذ قرارات واضحة وعقلانية. قد يأخذون في الاعتبار تفضيلات الآخرين، لكن قراراتهم تستند في النهاية إلى العملية.

منظم وفعالالهدف الأساسي لأصحاب شخصية ISTJ هو أن يكونوا فعالين فيما اختاروه. يعتقدون أن تحقيق ذلك يتم بشكل أفضل عندما يعرف الجميع بوضوح ما يحدث ولماذا. تساعد القواعد واللوائح الواضحة هؤلاء الأشخاص في الحفاظ على النظام والعمل بطريقة منتجة.

يستند إلى البحثيفخر أصحاب شخصية ISTJ بكونهم مصادر معرفية، مع تركيز على الإجراءات والتقنيات التي تضمن نتائج موثوقة. يتيح لهم ذلك التعامل بنجاح مع مجموعة متنوعة من المواقف، حيث يستوعبون ويطبقون بيانات جديدة حسب الحاجة للحفاظ على الأداء الوظيفي.'''),
          TabsCloumn(
              text1: 'نقاط الضعف',
              text2:
                  '''عنيدالحقائق هي الحقائق بالنسبة لأصحاب شخصية ISTJ، مما يجعلهم يقاومون أي فكرة جديدة لا تدعمها هذه الحقائق. هذا النهج في اتخاذ القرارات يجعل من الصعب عليهم تقبل أنهم كانوا مخطئين بشأن شيء ما – ولكن الجميع قد يغفلون عن تفصيل، حتى الـ ISTJs.

غير حساسعلى الرغم من أنهم لا يقصدون أن يكونوا قاسيين، فإن صراحة أصحاب شخصية ISTJ يمكن أن تجرح مشاعر الشخصيات الأكثر حساسية. فهم يؤمنون بشدة بمبدأ أن "الصراحة أفضل سياسة". قد يأخذون المشاعر في الاعتبار، ولكن فقط بقدر ما يساعدهم ذلك في التعبير عن رسالتهم بفعالية.

يعمل دائمًا وفق القواعديعتقد أصحاب شخصية ISTJ أن الأمور تسير بشكل أفضل عندما تكون القواعد واضحة ومحددة، مما يجعلهم مترددين في كسر تلك القواعد أو تجربة أشياء جديدة حتى عندما تكون المخاطر قليلة. البيئات غير المهيكلة قد تجعلهم يشعرون بالتوتر وعدم الرضا.

يميل إلى إصدار الأحكامنظرًا لأن الـ ISTJs يقدرون الحقائق والأدلة الملموسة بشكل كبير، فمن غير المرجح أن يحترموا الأشخاص الذين يخالفون المعلومات المثبتة – خصوصًا أولئك الذين يختارون الجهل عمدًا. عندما يتجاهل الآخرون الأدلة القاطعة ويعتمدون بدلاً من ذلك على الافتراضات أو العواطف، قد يصبح أصحاب شخصية ISTJ متحاملين، معتبرين هؤلاء الأفراد غير عقلانيين أو مضللين.

عرضة للإرهاقيجمع كل ذلك ليجعل الـ ISTJs يعتقدون أنهم الوحيدون القادرون على إتمام المشاريع بشكل موثوق. ومع تحميل أنفسهم أعباء عمل ومسؤوليات إضافية، ورفضهم النوايا الحسنة والأفكار المفيدة، يصلون في النهاية إلى نقطة انهيار لا يستطيعون بعدها تقديم المزيد. وحيث أنهم هم من حملوا المسؤولية على عاتقهم، قد يعتقدون أن الفشل يقع على عاتقهم وحدهم.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'الصداقات',
              text2:
                  '''الأشخاص من ذوي شخصية ISTJ ليسوا عفويين في تكوين صداقاتهم، كما أنهم ليسوا كثيري الكلام أو يميلون إلى المرح في إظهار محبتهم. ومع ذلك، ما يميز أصدقاء ISTJ هو ولاؤهم وموثوقيتهم وشرفهم واعتماديتهم.

قد يأتي الآخرون ويذهبون مع تقلبات الحياة، لكن شخصيات ISTJ تبقى بجانب أصدقائهم مهما كانت الظروف. يحملون في صداقاتهم التزامًا عميقًا قد يصعب على أنواع الشخصيات الأخرى تصديقه أو فهمه.'''),
          TabsCloumn(
              text1: 'هبة الولاء',
              text2:
                  '''تُعد شخصيات ISTJ منهجية للغاية، لذا فإن ولاءها لا يُمنح بسهولة. وغالبًا ما يكونون بطيئين في تكوين الصداقات، مما يؤدي إلى تكوين دائرة صغيرة من الأصدقاء المقربين. لكن ما يميزهم هو التزامهم بالوقوف بجانب الأشخاص في دائرتهم، حيث إن وعودهم ليست شيئًا يُنكث بسهولة.

رغم أن التعبير عن المشاعر ليس من أقوى مهارات شخصيات ISTJ، فإنهم يجدون دائمًا طرقًا لإظهار محبتهم ودعمهم. وكما قال سقراط: "الوجود هو الفعل"، فإن استعدادهم لاتخاذ خطوات عملية لدعم أصدقائهم يعوض عن كلماتهم.
ومع ذلك، فإن هذه الصورة تبدو جادة للغاية، وهي تُظهر فقط جانبًا واحدًا من شخصيات ISTJ وطريقتهم في التعامل مع صداقاتهم. على الجانب الآخر، يعرفون كيف يتوقفون عن الجدية، خاصةً مع الأصدقاء المرحين والاجتماعيين. يستمتعون بالاسترخاء وخوض مناقشات ممتعة حول العمل، والحياة، والأحداث الجارية.

لا تحب شخصيات ISTJ الصراع، وينعكس هذا في طريقة اختيارهم لأصدقائهم. فهم يميلون إلى تكوين صداقات مع أشخاص يشاركونهم المبادئ والآراء. ورغم أنهم أقل احتمالًا لتكوين صداقات مع شخصيات مختلفة تمامًا – لأن ذلك يتطلب الكثير من الجهد للتواصل – فإنهم يقدرون نقاط القوة والصفات الإيجابية لدى الآخرين.'''),
          TabsCloumn(
              text1: 'أفضل معاً',
              text2:
                  '''في الواقع، وكأنهم يريدون إثبات هذه الفكرة، فإن شخصيات ISTJ أحيانًا تكون صداقات مع أشخاص أكثر عفوية وإبداعًا. هذه العلاقات غالبًا ما تُبنى ليس على التفاهم المتبادل، بل على احترام الاختلافات بين الطرفين.

يستمتع أصحاب شخصية ISTJ بالإعجاب باتساع أفكار الآخرين وتنوعها، حيث إنهم واثقون من ذكائهم الخاص. وفي الوقت نفسه، غالبًا ما يُقدَّرون على واقعيتهم واعتماديتهم – وهما سمتان يصعب العثور عليهما في كثير من الأحيان. وكما هو الحال دائمًا، يبقى المعرفة هي العامل الموحِّد بين هذه الشخصيات المختلفة.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'مقدمة تعريفية',
              text2:
                  '''أصحاب شخصية ISTJ (اللوجيستيون) يقولون ما يعنون ويعنون ما يقولون، وعندما يلتزمون بفعل شيء ما، فإنهم يحرصون على الوفاء به. بفضل طبيعتهم المسؤولة والقابلة للاعتماد عليها، ليس من المستغرب أن يكون لدى شخصيات ISTJ احترام عميق للهيكلية والتقاليد. غالبًا ما ينجذبون إلى المنظمات، وأماكن العمل، والبيئات التعليمية التي توفر هياكل واضحة وتوقعات محددة.

ورغم أن ISTJ قد لا يكونون لافتين للأنظار أو يسعون للحصول على الاهتمام، إلا أنهم يقومون بدورهم وأكثر للحفاظ على استقرار المجتمع ودعمه. في عائلاتهم ومجتمعاتهم، يكسب هؤلاء الأشخاص الاحترام بسبب اعتماديتهم، وعمليتهم، وقدرتهم على الحفاظ على الهدوء والمنطقية حتى في أكثر المواقف توترًا.'''),
          TabsCloumn(
              text1: 'حياة من النزاهة',
              text2:
                  '''يؤمن أصحاب شخصية ISTJ أن هناك طريقة صحيحة للتعامل مع أي موقف، وأن أي شخص يدعي عكس ذلك ربما يحاول التلاعب بالقواعد لخدمة مصالحه الخاصة. بناءً على ذلك، نادرًا ما يترددون في تحمل مسؤولية أفعالهم واختياراتهم. فهم سريعون في الاعتراف بأخطائهم، حتى لو لم يكن ذلك يظهرهم بمظهر جيد أو يجعل الآخرين يشعرون بالراحة.
بالنسبة لشخصيات ISTJ، فإن الصدق والتواصل المباشر أكثر أهمية بكثير من السعي وراء المظاهر أو الإبهار. يفضلون إرضاء ضميرهم الخاص على أن يكذبوا لإبهار شخص آخر.

تُعرف شخصيات ISTJ بسعيها الدؤوب للوفاء بالتزاماتها مهما كانت الظروف. وغالبًا ما يشعرون بالدهشة من الأشخاص الذين لا يلتزمون بنفس المعايير الصارمة التي يفرضونها على أنفسهم. في بعض الأحيان، قد يصدرون أحكامًا غير عادلة على الآخرين الذين لا يظهرون نفس مستوى ضبط النفس – مشتبهين بأن الشخص قد يكون كسولاً أو غير صادق، في حين أنه قد يكون في الواقع يواجه تحديات أخرى.
على الرغم من أن هذا قد يجعل شخصيات ISTJ تبدو صارمة أو غير متعاطفة، فإن أحكامهم غالبًا ما تنبع من التزامهم الراسخ بالاعتماد على النفس والهيكلية.'''),
          TabsCloumn(
              text1: 'تحمل العبء الزائد',
              text2:
                  '''تعد إخلاص شخصيات ISTJ سمة مميزة تُثير الإعجاب، وهي المحرك وراء العديد من إنجازاتهم. ومع ذلك، يمكن أن تصبح هذه السمة نقطة ضعف يستغلها الآخرون. بفضل أخلاقياتهم المهنية القوية وشعورهم بالواجب، قد يجدون أنفسهم بشكل متكرر يتحملون مسؤوليات الآخرين. ورغم أنهم قد لا يشتكون من هذا الوضع، يمكن أن ينتهي بهم الأمر بالشعور بالإرهاق أو الإحباط إذا كانوا يتوقعون – أو يأخذون على عاتقهم – تحمل الأعباء الزائدة عن زملائهم أو أصدقائهم أو أحبائهم.

ورغم أن شخصيات ISTJ ليست معروفة بتعبيرها السريع عن مشاعرها، فإن هذا لا يعني أنهم لا يشعرون بالإحباط أو الاستياء عند تحملهم عبئًا أكبر مما ينبغي. وإذا لم يحرصوا على جعل علاقاتهم متوازنة ومستدامة، فقد ينتهي بهم الأمر بالتضحية بالاستقرار الذي يسعون جاهدين لحمايته.

والخبر السار هو أنه من خلال تعلم وضع حدود مناسبة والتحدث عندما يشعرون بأنهم منهكون، يمكن لأصحاب شخصية ISTJ تقديم كامل إمكانياتهم للعالم، بما في ذلك وضوحهم، وولائهم، واعتماديتهم.'''),
        ]),
      ])
    ]);
  }
}
