import 'package:flutter/material.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Info_Patterns.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Tab_Patterns.dart';
import 'package:gradution_project/View/features/EachPatternInfo/Tabs_Column.dart';
import 'package:gradution_project/View/features/EachPatternInfo/patterns_structure.dart';
import 'package:gradution_project/View/features/EachPatternInfo/tabslistview.dart';

class Istp extends StatelessWidget {
  const Istp({super.key});

  @override
  Widget build(BuildContext context) {
    return const PatternsStructure(childs: [
      InfoPatterns(
          text1: 'ISTP',
          text2: 'مبدع',
          text3:
              '''شخصيات ISTP تحب استكشاف العالم من حولهم بأيديهم وعيونهم وقدرتهم على اللمس والنظر مستخدمين العقلانية الباردة والفضول الحماسي. الأشخاص الذين يتمتعون بهذا النوع من الشخصية هم صناع الطبيعية، منتقلون من مشروع إلى آخر، يبنون كل شيئ مفيد أو حتى غير ضروري لمجرد المتعة الناجمة من ذلك، وحباً في التعلم من بيئتهم خلال الرحلة.''',
          image: 'assets/istp2.png'),
      TabPatterns(tabchilds: [
        TabsListView(childs: [
          TabsCloumn(
              text1: 'عادات مكان العمل',
              text2:
                  '''بالنسبة للأشخاص من النوع الشخصي ISTP (Virtuosos)، فإنهم لا يبحثون عادة عن وظائف تأخذهم بعيدًا عن منطقة راحتهم (على الرغم من أن ما يُعتبر داخل منطقة راحتهم قد يكون متنوعًا بشكل مفاجئ)، ويفضلون العمل مع أقل قدر ممكن من التفاعل الاجتماعي. ومع ذلك، إذا توفرت لهم مساحة للتنفس ومشكلة عملية لحلها، فإنهم يمكن أن يكونوا من بين الأشخاص الأكثر إنتاجية.
كما هو الحال مع أي شخص، فإن إجبار شخصيات ISTP على التأقلم مع قالب لا يناسبهم لا يؤدي إلى نتائج فعالة. ولكن عند التعرف على منظورهم الفريد ومواهبهم الخاصة، يمكن أن تكون النتائج استثنائية.'''),
          TabsCloumn(
              text1: 'الموظفون من نوع ISTP',
              text2:
                  '''إن ما يرغبون فيه كمرؤوسين أكثر من أي شيء آخر هو مساحة صغيرة من المرونة. يكونون سعداء بالبقاء في الوظيفة مع ولاء مفاجئ طالما أن مديريهم أو أرباب عملهم لا يجبرونهم على الالتزام بشيء لا يمكن تغييره أو التراجع عنه في اليوم التالي. القواعد الصارمة، والإرشادات المحددة، والاتفاقيات الرسمية تجعلهم يشعرون بالضيق والملل. وإذا تعرضت أساليبهم أو عاداتهم للنقد أو أُجبروا على التغيير، فقد يظهرون عنادًا ملحوظًا.

ما يمكن أن يضيء يومهم حقًا هو قائمة عشوائية وقابلة للإدارة من الأشياء التي تحتاج إلى إصلاح أو التعامل معها. يتمتع أصحاب الشخصية ISTP بموهبة توفير طاقاتهم لهذه المناسبات ويمكنهم التعامل مع هذه القوائم بكفاءة وسهولة.'''),
          TabsCloumn(
              text1: 'المديرون من نوع ISTP',
              text2:
                  '''مديرو الشخصية ISTP يتعاملون مع مرؤوسيهم بالطريقة التي يفضلون أن يُعاملوا بها: بحد أدنى من الحديث ومرونة في الحدود. ليسوا من الأشخاص الذين يميلون إلى الثرثرة أو التعبير العاطفي، وقد يراهم الأشخاص الأكثر حساسية باردين وبعيدين – فالإشادة المفرطة أو المجاملات الصاخبة ليست جزءًا من طبيعتهم.
في الواقع، من غير المرجح أن يكون هناك الكثير من التعليقات من مديري ISTP، سواء كانت إيجابية أو سلبية. ومع ذلك، عندما تنشأ مشكلات، فإنهم مستمعون رائعون ويعملون على وضع حلول عملية وعادلة وغير متحيزة'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'مسارات الحياة المهنية',
              text2:
                  '''يُعتبر الأشخاص بشخصية ISTP من أصعب الشخصيات التي يمكن تحديدها في العديد من جوانب الحياة، خصوصًا في حياتهم المهنية. إنهم يزدهرون في بيئات مليئة بالتنوع وعدم التوقع، حيث يتساءلون كل صباح: "ما الذي سيأتي بعد ذلك؟". هذه السمات تجعلهم أحد أكثر أنواع الشخصيات غموضًا، وكذلك واحدة من أكثرها تنوعًا في العالم المهني.

ما يميز شخصيات ISTP هو افتقارهم إلى الصبر أو الوقت عندما يتعلق الأمر بالأفكار أو المشاريع التي لا يمكن تطبيقها بشكل عملي وفوري. إنهم حلالو مشاكل بالفطرة، ويتمتعون بتركيز لا يتزعزع على الحلول العملية. لا توجد شخصية أخرى تتسم بهذا القدر من الانبهار بكيفية عمل الأشياء، وكيفية استخدام الأدوات، وكيف يمكن تجميع الحقائق لإنتاج نتائج فورية ومرضية.

يجعل هذا المزيج الفريد من الفضول والحيوية العملية الأشخاص بشخصية ISTP بارعين في مجالات مثل الميكانيكا، وتشغيل المعدات، وتحليل البيانات، وعلم الأدلة الجنائية. ومع ذلك، فهم بالطبع ليسوا محدودين بهذه المهن فقط.

لكنها ليست العملية الروتينية للإدارة التي يسعى وراءها الأشخاص بشخصية ISTP، بل العملية التي تبقيهم مهتمين وتمنحهم الحرية. البيئات التي تتميز بهيكلية صارمة تجعل هؤلاء الأفراد يشعرون بالملل والتعب. إنهم يزدهرون في الوظائف التي تتيح لهم العمل بشكل مستقل وفقًا لجداولهم الزمنية الخاصة، ولا تتطلب الكثير من العلاقات الاجتماعية أو التحدث أمام الجمهور.
نظرًا لأنهم غالبًا ما يكونون متمركزين تمامًا في اللحظة الحالية، فإن الأشخاص بشخصية ISTP يتمتعون بمهارة في الوظائف التي تتطلب استجابة للأزمات، مثل رجال الإطفاء، والمسعفين، والمحققين، والطيارين.
وربما يكون الأهم بالنسبة لشخصيات ISTP هو الشعور بأنهم ليسوا عالقين. إن الحرية في التنقل، ووضع جدولهم الزمني الخاص، وتحديد مسؤولياتهم وبيئاتهم، تتفوق تقريبًا على كل الاعتبارات الأخرى، بما في ذلك الالتزامات الصارمة والزملاء التقليديين.'''),
          TabsCloumn(
              text1: 'احتضان عدم التوقع',
              text2:
                  '''يمكن تحويل أي مهارة أو اهتمام إبداعي أو بنّاء تقريبًا إلى عمل مستقل أو مشروع تجاري بشروط صاحبه، سواء كان ذلك في التدوين، تحليل الأنظمة، الرياضة، أو القيادة. قد يحتاج الأشخاص بشخصية ISTP إلى العمل على تطوير قدراتهم في التخطيط طويل المدى وتفضيلهم للنتائج السريعة لجعل هذا المسار فعالًا، ولكن من الممكن كسب لقمة العيش من خلال بيع القطع اليدوية والأعمال الحرفية في أوقات فراغهم. كما يمكنهم العثور على وظائف تقليدية تلبي هذه الاحتياجات، طالما أنهم قادرون على الحفاظ على استقلاليتهم بطريقة أو بأخرى.

تتميز شخصيات ISTP بمهارات طبيعية في حل المشكلات وتركيزهم على تحقيق النتائج. إنهم يفهمون أن المخاطرة غالبًا ما تؤدي إلى مكافأة، وبمجرد أن يتمكنوا من استخدام هذا الفهم بنضج، فإنهم يصبحون مرغوبين للغاية في أي مجال أو بيئة ديناميكية.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'الأبوة',
              text2:
                  '''يميل الأشخاص من نمط الشخصية ISTP (Virtuosos) إلى منح أطفالهم قدرًا كبيرًا من الحرية والفرص لفعل ما يرغبون فيه – بالطبع، ضمن حدود منطقية. يعتقدون عمومًا أن الأطفال يجب أن يكون لديهم القدرة على التعبير عن أنفسهم، حتى لو تسبب ذلك في إزعاج الآخرين أحيانًا.

من وجهة نظر ISTPs، العالم مكان كبير مليء بالفرص والمغامرات، ومصمم للاستكشاف والتجربة دون تدخل مفرط أو محاولات للسيطرة على ما يمكن للآخرين فعله أو لا يمكنهم فعله – حتى لو كانوا أطفالًا.
يتبنون نهجًا عمليًا وبسيطًا في التربية، مما يجعلهم يشجعون أطفالهم على التعلم من التجربة المباشرة، ويؤمنون بأن الأخطاء جزء لا يتجزأ من عملية النمو.'''),
          TabsCloumn(
              text1: 'العالم بين يديك',
              text2:
                  '''في المراحل المبكرة من الحياة، يكون هذا النهج مفيدًا للغاية لأطفالهم. ففي هذا العمر، كل شيء صغير يمثل معجزة يجب استكشافها بجميع الحواس. الكتل ليست مجرد ألوان وأشكال مختلفة، بل أيضًا لها روائح ومذاقات، وهذا النوع من الاستكشاف الحسي يتماشى تمامًا مع طبيعة شخصيات ISTP.

مع تطور مهارات أطفالهم الحركية، يكون ISTPs سعداء بالمشاركة في بناء تلك الكتل معهم. وعندما يكبر الأطفال ويكتسبون مهارات أكثر تعقيدًا، يجد ISTPs متعة كبيرة في تعليمهم كيفية استخدام الأدوات الحقيقية لبناء أشياء حقيقية.

إذا كان أطفالهم النامون يشاركونهم حبهم للطبيعة العفوية والشغف بالأنشطة العملية، فإن ISTPs يسعدون بمرافقتهم في أي مغامرة تقريبًا. ومع ذلك، لا يتم فرض أي من هذه الأنشطة على الأطفال. بدلاً من ذلك، يرى ISTPs أنهم ليسوا بحاجة إلى نقل مبادئهم واهتماماتهم إلى أطفالهم، بل يستمتعون فقط بأن أطفالهم يستمتعون بفعل الأشياء.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'العلاقات الرومانسية',
              text2: '''مواعدة الأشخاص من نمط الشخصية ISTP (Virtuosos)
تشبه المواعدة مع أشخاص من نمط الشخصية ISTP رقصة التانغو – معقدة ومثيرة، تجمع بين التباعد والاهتمام الحقيقي، حوارات صريحة، والكثير من العفوية والاستمتاع باللحظة. لا يمكن فرض أي شيء في علاقات ISTP، ولكن طالما يتم منحهم المساحة التي يحتاجونها ليكونوا على طبيعتهم، فإنهم سيستمتعون بسرور بوجود شريك مستقر ومحب.'''),
          TabsCloumn(
              text1: 'قلب مستقل',
              text2:
                  '''في المراحل الأولى من المواعدة، قد يكون الأشخاص من نمط الشخصية ISTP صعبين جدًا في التعرف عليهم. يعيشون في الحاضر، ويفضلون الشركاء الذين يركزون على الواقع الحالي بدلاً من الافتراضات المستقبلية أو مشاعر الماضي.

إذا لم يكن الشريك المحتمل على مستوى توقعاتهم، فقد يقررون ببساطة الابتعاد. يحتاج ISTPs إلى مساحة شخصية كبيرة، سواء جسديًا أو نفسيًا، وأي محاولات للتحكم فيهم أو جدولة أنشطتهم قسرًا تزيد من احتمالية انسحابهم من العلاقة.
مع تطور العلاقات، يكتشف شركاء ISTPs أن الحميمية هي واحدة من أكثر الطرق سهولة للوصول إلى التعبير العاطفي لديهم. ليس لأنهم يفتقرون إلى المشاعر – بل على العكس، مشاعرهم عميقة وقوية. إنما يميلون إلى إخفاء تلك المشاعر وحمايتها، جزئيًا لأنهم غير متأكدين من كيفية التعامل معها والتعبير عنها، وجزئيًا لأنهم يعتقدون أن الناس يجب أن يتعاملوا مع مشاعرهم الداخلية بشكل خاص.'''),
          TabsCloumn(
              text1: 'فن التواصل الخفي',
              text2:
                  '''يميل الأشخاص من نمط الشخصية ISTP إلى ترك العديد من الأمور غير معلنة، معتقدين أنها مفهومة بشكل ضمني. أي محاولة لدفع التفاهمات أو حتى العلاقات نفسها نحو النقاش المفتوح لضمان الالتزام، خاصة في المراحل المبكرة، قد تقابل بشيء من الذعر أو الاستياء. لا شيء يبدو مرعبًا لهم أكثر من فكرة أنه لا يوجد مخرج. بالنسبة لهم، كل يوم هو فرصة جديدة، ويفضلون مراجعة التزاماتهم بشكل لحظي.

لا ينبغي لشركائهم أن يأخذوا هذا السلوك على محمل شخصي – فهو ببساطة طريقة عمل عقول ISTPs. يعيشون في الحاضر، في عالم مليء بالأنشطة الحسية، ويحتاجون إلى الشعور بالحرية للانغماس في شيء ما اليوم ثم فقدان الحماس تجاهه غدًا دون أن يتم استجوابهم بشأن موعد إنهاء شيء ما أو سبب تغيير رأيهم المفاجئ.
مع ذلك، يمكن لزيادة التعبير عن مشاعرهم وقبول فكرة الثبات والالتزام أن تضيف توازنًا مهمًا لشخصيات ISTPs، مما يساعدهم على تعزيز علاقاتهم وتقويتها.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(text1: 'نقاط القوة', text2: '''مجتهدون وملاحظون
الأشخاص من نمط الشخصية ISTP (Virtuosos) دائمًا منشغلون بمشاريع وأعمال عملية. كأفراد عمليين، يعشقون الانخراط في بيئتهم وتحويل ملاحظاتهم إلى حلول عملية.

مهرة ومبدعون
هذا النمط يتميز بخيال واسع في الأمور العملية مثل الميكانيكا والحرف اليدوية والمهارات الفنية. تأتي الأفكار الجديدة بسهولة إليهم، ويحبون استخدام أيديهم لتحويلها إلى واقع.

عفويون
يتمتعون بالقدرة على التكيف مع الظروف المفاجئة والتفكير بسرعة. هذه المرونة تضيف لمسة من عدم التوقع، لكنهم يستطيعون تخزين طاقاتهم العفوية لإطلاقها عندما تكون الحاجة ماسة.

صريحون وأصيلون
يقدرون الصراحة والتواصل المباشر. يتحدثون بوضوح ودون تجميل للكلمات، مما يعكس صدقهم. هذه الصراحة تساعد في بناء وضوح في علاقاتهم وتمكنهم من التعبير عن رغباتهم واحتياجاتهم.

مستقلون
يعتمدون على أنفسهم بدرجة كبيرة، ويزدهرون عند تنفيذ المهام بمفردهم. هذا الاستقلال يعزز إبداعهم وقدراتهم القوية على حل المشكلات.

متجذرون في الواقع
لديهم قدرة فريدة على التركيز على اللحظة الحالية. بنظرة ثاقبة لما يحدث الآن، هم أقل عرضة للانشغال بفرضيات المستقبل أو الندم على الماضي.'''),
          TabsCloumn(text1: 'نقاط الضعف', text2: '''غير معتذرين
بقدر ما يتمتع الأشخاص من نمط الشخصية ISTP بالقدرة على التكيف مع الظروف، يمكنهم أيضًا تجاهل التيار تمامًا والانتقال في اتجاه مختلف دون كثير من الاعتبار لتفضيلات الآخرين. وإذا حاول أحدهم اقتراح مسار مختلف، قد يصبحون صريحين بشدة في التعبير عن انزعاجهم.

غير حساس
يعتمد ISTPs على المنطق، وحتى عندما يحاولون التفاعل بعاطفة أو تعاطف، فإن الأمر نادرًا ما يكون ناجحًا بالشكل المناسب، إذا ما تم التعبير عنه أصلًا.

منعزلون ومتحفظون
من الصعب للغاية معرفة الكثير عن ISTPs. فهم يحتفظون بأمورهم الشخصية لأنفسهم، وغالبًا ما يفضلون الصمت على الحديث الصغير أو الحوارات غير الجوهرية.

سريعو الملل
يعشق ISTPs كل ما هو جديد، مما يجعلهم بارعين في الاكتشافات العملية، ولكنهم أقل موثوقية عندما يتطلب الأمر التركيز على الأمور بمجرد أن تفقد جاذبية التجديد. بمجرد أن يفهموا شيئًا ما، يميلون ببساطة إلى الانتقال لشيء جديد وأكثر إثارة للاهتمام.

مستقلون
في حين أن الاستقلالية تُعد ميزة، إلا أنها قد تصبح تحديًا في العلاقات الاجتماعية، بما في ذلك الرومانسية. فرض جدول زمني خاص بشخص آخر عليهم – خاصةً جدول اجتماعي – قد لا يناسبهم لفترة طويلة. وقد تكون لديهم قدرة محدودة على تحمل الأشخاص الذين يأخذون من وقتهم للقيام بأمور يفضلون تجنبها.

مفرطون في الشك
يمكن أن يساعدهم نهجهم العام المتشكك على تجنب الافتراضات غير المبررة، ولكن إذا لم يتم التحكم في هذا الشك، فقد يؤدي إلى تجاهل حقائق أكثر ذاتية أو جوانب غير قابلة للقياس من التجربة الإنسانية. بالإضافة إلى ذلك، قد يفوتون فرصًا بسبب ترددهم في المخاطرة أو استكشاف مفاهيم غير مألوفة نتيجة لغياب دليل قاطع. وبالمثل، قد يؤدي الشك المفرط إلى توتر العلاقات الاجتماعية بسبب تصورات عن السلبية أو انعدام الثقة.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'الصداقات',
              text2:
                  '''عندما يتعلق الأمر بكيفية تعامل الأشخاص من نمط الشخصية ISTP (Virtuosos) مع صداقاتهم، فقد تبدو أساليبهم الاجتماعية غريبة بعض الشيء مقارنةً بالمألوف. يقدر أصحاب شخصية ISTP وقتهم الخاص واستقلاليتهم الشخصية أكثر بكثير من الشخص العادي. ونتيجة لذلك، عندما يقررون الانخراط في التفاعل الاجتماعي، يكونون انتقائيين للغاية بشأن من يتواصلون معه. إنهم أشبه بسرٍ محفوظٍ جيدًا – ليس كل شخص يحصل على شرف أن يكون صديقهم.'''),
          TabsCloumn(
              text1: 'الحفاظ على العفوية',
              text2:
                  '''يرجع الكثير من انتقائية الأشخاص ذوي نمط الشخصية ISTP إلى عدم رغبتهم في الالتزام بأي شخص أو نشاط معين. إجبارهم على الالتزام المستمر بالأنشطة المجدولة يعد أسرع طريقة لإنهاء الصداقة معهم. ومع ذلك، طالما بقيت الأمور مرنة وغير ملزمة، يمكن أن تكون صداقاتهم غنية ومجزية.

يعيش أصحاب الشخصية ISTP في الحاضر، مستمتعين بكل ما تجلبه الحياة، ولا يشعرون بأي التزام حقيقي لتغيير مسارهم بسبب خطط الآخرين. إذا لم يرغب الأصدقاء في فعل ما يفعله أصحاب الشخصية ISTP، فهم أحرار في القيام بما يريدون، وسيجتمعون في وقت لاحق. قد تفاجئ تغيرات مواقفهم أصدقائهم أحيانًا، لكنهم عادة ما يكونون مباشرين جدًا بشأن كيفية رغبتهم في قضاء وقتهم.
الأشخاص من هذا النوع موهوبون في استخدام قدراتهم، وغالبًا ما يستمتعون ببعض المنافسة. هذا يجعل هواياتهم، خاصة الأنشطة العملية، أكثر متعة عند ممارستها مع الآخرين، وعادة ما تكون هذه الهوايات أساس صداقاتهم.'''),
          TabsCloumn(
              text1: '''السحر المفاجئ
لكونك على طبيعتك''',
              text2:
                  '''الأشخاص من نمط الشخصية ISTP يتمتعون بشعبية غير عادية، وكأنها تأتي بشكل عفوي دون تخطيط. هواياتهم المثيرة وطباعهم العملية الحادة تجعلهم جذابين لشريحة واسعة من الناس. ولكن التحدي الحقيقي يكمن في الوصول إلى أعماقهم ليصبح الشخص صديقًا حقيقيًا لهم. قد يكون لديهم العديد من الأشخاص الذين يحملون لهم مشاعر طيبة أو يعرفونهم بشكل سطحي، ولكن هناك قلة قليلة فقط ممن يشعرون بأنهم يفهمونهم حقًا.'''),
        ]),
        TabsListView(childs: [
          TabsCloumn(
              text1: 'مقدمة تعريفية',
              text2:
                  '''شخصيات ISTP (Virtuosos)يحب الأشخاص من نوع شخصية ISTP استكشاف العالم من خلال أيديهم وأعينهم، حيث يلمسون ويفحصون كل ما يحيط بهم بجدية مبهرة وفضول عفوي وجرعة صحية من الشك. هم بطبيعتهم صانعون، ينتقلون من مشروع إلى آخر، يبنون الأشياء المفيدة وأحيانًا غير الضرورية بدافع المتعة والتعلم من بيئتهم أثناء ذلك. لا يجدون متعة أعظم من الانخراط في العمل بأيديهم، وتفكيك الأشياء ثم إعادة تجميعها، وتركها بحالة أفضل قليلًا مما كانت عليه.

يفضل الأشخاص من نوع شخصية ISTP التعامل مع المشكلات بشكل مباشر، حيث يبحثون عن حلول واضحة وبسيطة بدلاً من اللجوء إلى أساليب معقدة لحل المشكلات. يعتمد هؤلاء الأشخاص بشكل كبير على الخبرة المباشرة وتجربة المحاولة والخطأ أثناء تنفيذ أفكارهم ومشاريعهم. وعادةً ما يفضلون العمل وفقًا لسرعتهم الخاصة وبشروطهم الخاصة، دون مقاطعات غير ضرورية.'''),
          TabsCloumn(
              text1: 'مباشرون وحاسمون',
              text2:
                  '''على الرغم من الغموض الذي يُنسَب إليهم، فإن الأشخاص من نوع شخصية ISTP يتميزون بوضوح وبساطة في طبيعتهم. فهم مباشرون لكن محتفظون بمسافة، هادئون لكن يمكن أن يكونوا مفاجئين بالعفوية، مجتهدون ولكنهم يركزون على أولوياتهم الخاصة. يمكن أن يكون من الصعب التنبؤ بسلوكهم، حتى بالنسبة لأصدقائهم وأحبائهم. قد يبدون مستقرين لفترة من الوقت، لكنهم غالبًا ما يكدّسون طاقة اندفاعية تنفجر فجأة، مما يدفعهم لاستكشاف اتجاهات جديدة وجريئة.
قرارات ISTPs تنبع غالبًا من طبيعتهم العقلانية وإحساسهم بما يبدو عمليًا في اللحظة، لكن هذا لا يعني أنهم لا ينجرفون مع شغفهم بين الحين والآخر. بمجرد أن تشتعل شرارة الحماس لديهم، يكرسون وقتهم وطاقتهم بشدة ملحوظة حتى تظهر فرصة أخرى أكثر جذبًا أو أكثر إشباعًا. وعندما يحدث ذلك، لا يترددون في التخلي عن المشاريع أو المواقف التي يرون أنها غير مثمرة أو خالية من الإمكانات.

إحدى أكبر التحديات التي قد يواجهها أصحاب شخصية ISTP هي ميلهم للتصرف بسرعة ودون تفكير طويل، مما قد يؤدي إلى إزعاج الآخرين أحيانًا. فهم ليسوا من النوع الذي يغلف آرائهم أو مشاعرهم بكلمات لطيفة. يتسم أسلوب تواصلهم بالوضوح والصراحة، والذي يُساء تفسيره في كثير من الأحيان على أنه قسوة أو افتقار إلى الحساسية. ولكن في الواقع، هذا ببساطة هو أسلوبهم الصادق في التعامل.
لا يهتم ISTPs بإرضاء الآخرين أو الالتزام بالمجاملات الاجتماعية غير الضرورية. معهم، لا حاجة كبيرة للتشكيك في نواياهم، لأن ما يرونه الناس هو ما يحصلون عليه. إنهم يعطون الأولوية للصدق والوضوح على العبارات المنمقة، مما يجعلهم شخصيات حقيقية ومباشرة.'''),
          TabsCloumn(
              text1: 'رفض القواعد',
              text2:
                  '''شخصيات ISTP تتميز بكونها فريدة ومتميزة، حيث تتبع إيقاعها الخاص بدلًا من الالتزام بالقواعد والمعايير المجتمعية. من خلال نظرتهم الانتهازية ونهجهم المباشر في الحياة، يصنعون نسيجًا غنيًا من التجارب والتفاعلات، بعضها قد يكون محبطًا للغاية وبعضها الآخر ممتعًا بشكل كبير.

مدفوعون بمعرفتهم والأدلة المتاحة لهم، يعتمد ISTPs على الإلهام والشعور الداخلي للتنقل في حياتهم. فهم يبتعدون عن الروتين المرسوم مسبقًا ليتبعوا غرائزهم، غير مقيدين بالتقاليد، ويفضلون رسم مسارهم الخاص في كل ما يفعلونه.

في جوهرهم، يعيش الأشخاص من نوع ISTP حياتهم بحرية وفقًا لشروطهم الخاصة، حيث يقدرون الاستقلالية الشخصية فوق معظم الأمور الأخرى. وبينما يتنقلون بين التوقعات الاجتماعية، يجدون دائمًا طريقة للخروج عن المألوف. قد لا تتماشى رحلتهم مع الأعراف العامة، ولكن في ذلك يكمن جمال وقوة رؤيتهم الفريدة. العثور على بيئة يمكنهم فيها التعايش مع أشخاص يتفهمون حاجتهم إلى الحرية، والمساحة، وعدم التوقع، سيمنحهم سنوات مليئة بالسعادة.'''),
        ]),
      ])
    ]);
  }
}
