import 'package:flutter/material.dart';
import 'package:gradution_project/View/settings/Custom_Setting_Background.dart';
import 'package:gradution_project/View/settings/info_Column.dart';
import 'package:gradution_project/View/widget/constant.dart';

class SettingCondition extends StatelessWidget {
  const SettingCondition({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
        backgroundColor: primaryColor,
        body: SafeArea(
            child: Column(children: [
          const CustomSettingBackdround(),
          const SizedBox(
            height: 25,
          ),
          Expanded(
              child: Container(
                  decoration: const BoxDecoration(
                      color: secondaryColor,
                      borderRadius:
                          BorderRadius.vertical(top: Radius.circular(50))),
                  child: ListView(children: const [
                    SizedBox(
                      height: 50,
                    ),
                    Padding(
                      padding: EdgeInsets.all(8.0),
                      child: Padding(
                        padding: EdgeInsets.all(8.0),
                        child: Row(
                          mainAxisAlignment: MainAxisAlignment.start,
                          children: [
                            Spacer(),
                            Center(
                                child: Text(
                              "الشروط والاحكام ",
                              style: TextStyle(
                                  fontSize: 24,
                                  color: primaryTextColor,
                                  fontWeight: FontWeight.bold),
                            )),
                            Spacer(),
                            Icon(Icons.arrow_forward_ios, size: 16)
                          ],
                        ),
                      ),
                    ),
                    Infocolumn(
                        txt1: """آخر تحديث: 7 مايو 2025""",
                        txt2:
                            """يرجى قراءة هذه الشروط والأحكام بعناية قبل استخدام الخدمة."""),
                    Infocolumn(txt1: """التفسير والتعريفات""", txt2: """
التفسير والتعريفات
التفسير
الكلمات التي تبدأ بحروف كبيرة لها معاني محددة في ظل الشروط التالية. هذه التعريفات تحمل نفس المعنى سواء ظهرت بالمفرد أو الجمع.  
التعريفات   
لغرض هذه الشروط والأحكام:  

  - التطبيق: يعني البرنامج الذي توفره الشركة والذي يمكن تنزيله على أي جهاز إلكتروني، واسمه Mind Map.  
  - متجر التطبيقات: يعني خدمة التوزيع الرقمي التي تديرها وتطورها Apple Inc. (متجر تطبيقات Apple) أو Google Inc. (متجر Google Play) والذي تم من خلاله تنزيل التطبيق.  
  - البلد: يعني مصر.  
  - الشركة (يشار إليها إما بـ "الشركة"، "نحن"، "نا" أو "خاصتنا" في هذه الاتفاقية): تعني Mind Map.  
  - الجهاز: يعني أي جهاز يمكنه الوصول إلى الخدمة مثل الكمبيوتر أو الهاتف المحمول أو الجهاز اللوحي الرقمي.  
  - الخدمة: تعني التطبيق.  
  - خدمة وسائل التواصل الاجتماعي لطرف ثالث: تعني أي خدمات أو محتوى (بما في ذلك البيانات أو المعلومات أو المنتجات أو الخدمات) التي يوفرها طرف ثالث قد يتم عرضها أو تضمينها أو توفيرها من خلال الخدمة.  
  - أنت: تعني الفرد الذي يصل أو يستخدم الخدمة، أو الشركة أو الكيان القانوني الآخر الذي يمثله هذا الفرد عند الوصول إلى الخدمة أو استخدامها، حسبما ينطبق.  """),
                    Infocolumn(
                        txt1: """الإقرار """,
                        txt2:
                            """هذه هي الشروط والأحكام التي تحكم استخدام هذه الخدمة والاتفاقية التي تعمل بينك وبين الشركة. تحدد هذه الشروط والأحكام حقوق والتزامات جميع المستخدمين فيما يتعلق باستخدام الخدمة.  
يعتمد وصولك إلى الخدمة واستخدامك لها على قبولك والامتثال لهذه الشروط والأحكام. تنطبق هذه الشروط والأحكام على جميع الزوار والمستخدمين وأي شخص آخر يصل إلى الخدمة أو يستخدمها.  
بوصولك إلى الخدمة أو استخدامها، فإنك توافق على الالتزام بهذه الشروط والأحكام. إذا كنت لا توافق على أي جزء من هذه الشروط والأحكام، فلا يجوز لك الوصول إلى الخدمة.  
أنت تعلن أن عمرك أكثر من 18 عامًا. لا تسمح الشركة لمن تقل أعمارهم عن 18 عامًا باستخدام الخدمة.  
يعتمد وصولك إلى الخدمة واستخدامك لها أيضًا على قبولك والامتثال لسياسة الخصوصية الخاصة بالشركة. تصف سياسة الخصوصية الخاصة بنا سياساتنا وإجراءاتنا بشأن جمع واستخدام وكشف معلوماتك الشخصية عند استخدامك للتطبيق أو الموقع الإلكتروني، وتخبرك عن حقوق الخصوصية الخاصة بك وكيف يحميك القانون. يرجى قراءة سياسة الخصوصية الخاصة بنا بعناية قبل استخدام الخدمة.  
 
"""),
                    Infocolumn(
                        txt1: """الإنهاء """,
                        txt2:
                            """يجوز لنا إنهاء أو تعليق وصولك على الفور، دون إشعار مسبق أو مسؤولية، لأي سبب كان، بما في ذلك على سبيل المثال لا الحصر إذا انتهكت هذه الشروط والأحكام.  
عند الإنهاء، سينتهي حقك في استخدام الخدمة على الفور.  
"""),
                    Infocolumn(txt1: """الفصلية والتنازل """, txt2: """الفصلية  
 
إذا تم اعتبار أي بند من هذه الشروط غير قابل للتنفيذ أو باطل، فسيتم تعديل هذا البند وتفسيره لتحقيق أهدافه إلى أقصى حد ممكن بموجب القانون المعمول به، وسيستمر تنفيذ البنود المتبقية بكامل قوتها وأثرها.  

التنازل  
  
باستثناء ما هو منصوص عليه هنا، فإن الفشل في ممارسة حق أو المطالبة بتنفيذ التزام بموجب هذه الشروط لن يؤثر على قدرة الطرف على ممارسة هذا الحق أو المطالبة بهذا التنفيذ في أي وقت لاحق، كما أن التنازل عن أي خرق لا يشكل تنازلاً عن أي خرق لاحق.  
  """),
                    Infocolumn(txt1: """اتصل بنا""", txt2: """
إذا كان لديك أي أسئلة حول هذه الشروط والأحكام، يمكنك الاتصال بنا:  
   عن طريق زيارة هذه الصفحة على موقعنا الإلكتروني: <https://mind-map-new.vercel.app/>  
"""),
                  ]))),
        ])));
  }
}
